#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2ab4018b6f023ac7d5c907a0231c150f.pdb
; shader hash: 2ab4018b6f023ac7d5c907a0231c150f
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbClearBuffers
; {
;
;   struct cbClearBuffers
;   {
;
;       struct struct.ConstantBufferClearBuffers
;       {
;
;           uint ValueCount0;                         ; Offset:    0
;           uint ValueCount1;                         ; Offset:    4
;           uint ValueCount2;                         ; Offset:    8
;           uint ValueCount3;                         ; Offset:   12
;       
;       } cbClearBuffers;                             ; Offset:    0
;
;   
;   } cbClearBuffers;                                 ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gVoxelRadiance
; {
;
;   float3 $Element;                                  ; Offset:    0 Size:    12
;
; }
;
; Resource bind info for gClusterRadiance
; {
;
;   uint4 $Element;                                   ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !26, globals: !37)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CClearBufferShader_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 15, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 15, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 20, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 20, size: 128, align: 32, elements: !17, templateParams: !23)
!17 = !{!18, !20, !21, !22}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 20, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 20, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 20, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 20, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !19)
!25 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!26 = !{!27}
!27 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 10, type: !28, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!24, !13}
!37 = !{!38, !41, !43, !44, !45, !48, !50, !53, !54, !55, !69, !73, !77, !79, !81}
!38 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !39, line: 87, type: !40, isLocal: true, isDefinition: true)
!39 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!41 = !DIGlobalVariable(name: "PI", scope: !0, file: !39, line: 105, type: !42, isLocal: true, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!43 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !39, line: 106, type: !42, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !39, line: 107, type: !42, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !46, line: 45, type: !47, isLocal: false, isDefinition: true)
!46 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!48 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !46, line: 46, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!50 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !52, isLocal: true, isDefinition: true)
!51 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!53 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !42, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !42, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariable(name: "cbClearBuffers", linkageName: "\01?cbClearBuffers@@3U?$ConstantBuffer@UConstantBufferClearBuffers@@@@A", scope: !0, file: !1, line: 3, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferClearBuffers>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !57)
!57 = !{!58}
!58 = !DITemplateTypeParameter(name: "T", type: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferClearBuffers", file: !60, line: 164, size: 128, align: 32, elements: !61)
!60 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!61 = !{!62, !66, !67, !68}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount0", scope: !59, file: !60, line: 166, baseType: !63, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !64, line: 8, baseType: !65)
!64 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !19)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount1", scope: !59, file: !60, line: 167, baseType: !63, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount2", scope: !59, file: !60, line: 168, baseType: !63, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount3", scope: !59, file: !60, line: 169, baseType: !63, size: 32, align: 32, offset: 96)
!69 = !DIGlobalVariable(name: "gVoxelRadiance", linkageName: "\01?gVoxelRadiance@@3V?$RWStructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 5, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<float, 3> >", file: !1, line: 5, size: 96, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "element", type: !5)
!73 = !DIGlobalVariable(name: "gClusterRadiance", linkageName: "\01?gClusterRadiance@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 6, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 6, size: 128, align: 32, elements: !2, templateParams: !75)
!75 = !{!76}
!76 = !DITemplateTypeParameter(name: "element", type: !16)
!77 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !39, line: 87, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !40, size: 32, align: 4, offset: 64)
!79 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !39, line: 87, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !40, size: 32, align: 4, offset: 32)
!81 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !39, line: 87, type: !82, isLocal: false, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !40, size: 32, align: 4)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!86 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CClearBufferShader_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferClearBuffers> cbClearBuffers : register(b0);\0D\0A\0D\0ARWStructuredBuffer<float3> gVoxelRadiance : register(u0);\0D\0ARWStructuredBuffer<uint4> gClusterRadiance : register(u1);\0D\0A\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    if (DTid.x >= cbClearBuffers.ValueCount0)\0D\0A        return;\0D\0A    \0D\0A    gVoxelRadiance[DTid.x] = float3(0.0f, 0.0f, 0.0f);\0D\0A    \0D\0A    if (DTid.x >= cbClearBuffers.ValueCount1)\0D\0A        return;\0D\0A    \0D\0A    gClusterRadiance[DTid.x] = uint4(0, 0, 0, 0);\0D\0A}"}
