#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c89d61aefd9fa166584ea5dd4c9dbd90.pdb
; shader hash: c89d61aefd9fa166584ea5dd4c9dbd90
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbLightTransport
; {
;
;   struct cbLightTransport
;   {
;
;       struct struct.ConstantBufferIndirectLightTransport
;       {
;
;           float3 LightDirection;                    ; Offset:    0
;           uint VoxelCount;                          ; Offset:   12
;           float3 LightPosition;                     ; Offset:   16
;           float LightIntensity;                     ; Offset:   28
;           float3 EyePosition;                       ; Offset:   32
;           uint DispatchNumber;                      ; Offset:   44
;       
;       } cbLightTransport;                           ; Offset:    0
;
;   
;   } cbLightTransport;                               ; Offset:    0 Size:    48
;
; }
;
; Resource bind info for gFaceClusterPenaltyBuffer
; {
;
;   float $Element;                                   ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gFaceCloseVoxelsPenaltyBuffer
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !18)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CFacePenalty_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 349, type: !5, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !{!19, !31, !33, !34, !35, !38, !40, !43, !44, !45, !92, !104, !106, !109, !110, !111, !112, !132, !133, !134, !138, !139, !149, !150, !153, !154, !156, !158}
!19 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !20, line: 87, type: !21, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 87, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 87, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 87, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 87, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 87, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !16}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIGlobalVariable(name: "PI", scope: !0, file: !20, line: 105, type: !32, isLocal: true, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!33 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !20, line: 106, type: !32, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !20, line: 107, type: !32, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !36, line: 45, type: !37, isLocal: false, isDefinition: true)
!36 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!38 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !36, line: 46, type: !39, isLocal: false, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!40 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !41, line: 15, type: !42, isLocal: true, isDefinition: true)
!41 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!43 = !DIGlobalVariable(name: "cos30", scope: !0, file: !41, line: 16, type: !32, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariable(name: "cos25", scope: !0, file: !41, line: 17, type: !32, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !47)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "T", type: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !50, line: 26, size: 1792, align: 32, elements: !51)
!50 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!51 = !{!52, !53, !54, !57, !58, !59, !62, !63, !64, !65, !66, !67, !68, !91}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !49, file: !50, line: 28, baseType: !7, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !49, file: !50, line: 29, baseType: !26, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !49, file: !50, line: 31, baseType: !55, size: 96, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !56, line: 4, baseType: !22)
!56 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !49, file: !50, line: 32, baseType: !26, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !49, file: !50, line: 34, baseType: !55, size: 96, align: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !49, file: !50, line: 35, baseType: !60, size: 32, align: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !56, line: 8, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !11)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !49, file: !50, line: 37, baseType: !55, size: 96, align: 32, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !49, file: !50, line: 38, baseType: !60, size: 32, align: 32, offset: 480)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !49, file: !50, line: 40, baseType: !55, size: 96, align: 32, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !49, file: !50, line: 41, baseType: !60, size: 32, align: 32, offset: 608)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !49, file: !50, line: 43, baseType: !55, size: 96, align: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !49, file: !50, line: 44, baseType: !26, size: 32, align: 32, offset: 736)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !49, file: !50, line: 46, baseType: !69, size: 512, align: 32, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !71, templateParams: !88)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !70, file: !1, line: 3, baseType: !26, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!88 = !{!30, !89, !90}
!89 = !DITemplateValueParameter(name: "row_count", type: !17, value: i32 4)
!90 = !DITemplateValueParameter(name: "col_count", type: !17, value: i32 4)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !49, file: !50, line: 47, baseType: !69, size: 512, align: 32, offset: 1280)
!92 = !DIGlobalVariable(name: "cbLightTransport", linkageName: "\01?cbLightTransport@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !94)
!94 = !{!95}
!95 = !DITemplateTypeParameter(name: "T", type: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !50, line: 152, size: 384, align: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !96, file: !50, line: 154, baseType: !55, size: 96, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !96, file: !50, line: 155, baseType: !60, size: 32, align: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "LightPosition", scope: !96, file: !50, line: 157, baseType: !55, size: 96, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "LightIntensity", scope: !96, file: !50, line: 158, baseType: !26, size: 32, align: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !96, file: !50, line: 160, baseType: !55, size: 96, align: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchNumber", scope: !96, file: !50, line: 161, baseType: !60, size: 32, align: 32, offset: 352)
!104 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!106 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !108)
!108 = !{!15}
!109 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !107, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !107, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !107, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 13, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 13, size: 2688, align: 32, elements: !2, templateParams: !114)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "element", type: !116)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !50, line: 193, size: 2688, align: 32, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !116, file: !50, line: 195, baseType: !7, size: 96, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !116, file: !50, line: 196, baseType: !60, size: 32, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !116, file: !50, line: 198, baseType: !55, size: 96, align: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !116, file: !50, line: 199, baseType: !60, size: 32, align: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !116, file: !50, line: 201, baseType: !55, size: 96, align: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !116, file: !50, line: 202, baseType: !60, size: 32, align: 32, offset: 352)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !116, file: !50, line: 204, baseType: !55, size: 96, align: 32, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !116, file: !50, line: 205, baseType: !60, size: 32, align: 32, offset: 480)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !116, file: !50, line: 207, baseType: !55, size: 96, align: 32, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !116, file: !50, line: 208, baseType: !26, size: 32, align: 32, offset: 608)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !116, file: !50, line: 210, baseType: !129, size: 2048, align: 32, offset: 640)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, align: 32, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 64)
!132 = !DIGlobalVariable(name: "gVoxelsInCluster", linkageName: "\01?gVoxelsInCluster@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 14, type: !107, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 15, type: !107, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 16, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 16, size: 96, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "element", type: !23)
!138 = !DIGlobalVariable(name: "gVoxelNormalBuffer", linkageName: "\01?gVoxelNormalBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !135, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 19, type: !140, isLocal: false, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 19, size: 64, align: 32, elements: !2, templateParams: !141)
!141 = !{!142}
!142 = !DITemplateTypeParameter(name: "element", type: !143)
!143 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 19, size: 64, align: 32, elements: !144, templateParams: !147)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !143, file: !1, line: 19, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !143, file: !1, line: 19, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!147 = !{!15, !148}
!148 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 2)
!149 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !107, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 22, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 22, size: 32, align: 32, elements: !2, templateParams: !152)
!152 = !{!30}
!153 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 23, type: !151, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !20, line: 87, type: !155, isLocal: false, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !21, size: 32, align: 4, offset: 64)
!156 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !20, line: 87, type: !157, isLocal: false, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !21, size: 32, align: 4, offset: 32)
!158 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !20, line: 87, type: !159, isLocal: false, isDefinition: true)
!159 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !21, size: 32, align: 4)
!160 = !{i32 2, !"Dwarf Version", i32 4}
!161 = !{i32 2, !"Debug Info Version", i32 3}
!162 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
