#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: fbdfecb3e208debd2369adb1ccc4394a.pdb
; shader hash: fbdfecb3e208debd2369adb1ccc4394a
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !84)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CGaussianFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !17, !25, !31, !16, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 178, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 206, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 206, size: 96, align: 32, elements: !8, templateParams: !13)
!8 = !{!9, !11, !12}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 206, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 206, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 206, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !10)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 3)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 205, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 205, size: 64, align: 32, elements: !19, templateParams: !22)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 205, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 205, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !5)
!24 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 213, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 213, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 213, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 213, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!14, !24}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 245, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 245, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 245, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 245, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 245, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!38, !15}
!38 = !DITemplateTypeParameter(name: "element", type: !16)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!23, !15}
!46 = !{!47, !50, !54, !58, !62, !65, !69, !72, !75, !78, !81}
!47 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 176, type: !48, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !39}
!50 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !51, file: !51, line: 117, type: !52, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!25, !4}
!54 = !DISubprogram(name: "filterFace", linkageName: "\01?filterFace@@YA?AV?$vector@M$02@@II_N@Z", scope: !1, file: !1, line: 84, type: !55, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!6, !4, !4, !57}
!57 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!58 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !59, file: !59, line: 74, type: !60, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!60 = !DISubroutineType(types: !61)
!61 = !{!39, !4, !39}
!62 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !59, file: !59, line: 91, type: !63, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!57, !39, !31, !39}
!65 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !59, file: !59, line: 124, type: !66, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!57, !39, !39, !68}
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!69 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !59, file: !59, line: 102, type: !70, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!57, !4, !68}
!72 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 34, type: !73, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!17, !39, !39}
!75 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !51, file: !51, line: 125, type: !76, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!4, !25}
!78 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !59, file: !59, line: 83, type: !79, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!4, !39, !39}
!81 = !DISubprogram(name: "gaussianDistribution", linkageName: "\01?gaussianDistribution@@YAMMMMM@Z", scope: !1, file: !1, line: 74, type: !82, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !10, !10, !10, !10}
!84 = !{!85, !88, !90, !91, !92, !94, !96, !98, !99, !100, !146, !158, !159, !162, !163, !164, !165, !168, !169, !170, !171, !175, !176, !178, !180, !181, !183, !185}
!85 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !86, line: 87, type: !87, isLocal: true, isDefinition: true)
!86 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!88 = !DIGlobalVariable(name: "PI", scope: !0, file: !86, line: 105, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!90 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !86, line: 106, type: !89, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !86, line: 107, type: !89, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !51, line: 45, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!94 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !51, line: 46, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!96 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !59, line: 15, type: !97, isLocal: true, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!98 = !DIGlobalVariable(name: "cos30", scope: !0, file: !59, line: 16, type: !89, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "cos25", scope: !0, file: !59, line: 17, type: !89, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !102)
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "T", type: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !105, line: 26, size: 1792, align: 32, elements: !106)
!105 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!106 = !{!107, !108, !109, !112, !113, !114, !116, !117, !118, !119, !120, !121, !122, !145}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !104, file: !105, line: 28, baseType: !39, size: 96, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !104, file: !105, line: 29, baseType: !10, size: 32, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !104, file: !105, line: 31, baseType: !110, size: 96, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !111, line: 4, baseType: !6)
!111 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !104, file: !105, line: 32, baseType: !10, size: 32, align: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !104, file: !105, line: 34, baseType: !110, size: 96, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !104, file: !105, line: 35, baseType: !115, size: 32, align: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !111, line: 8, baseType: !4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !104, file: !105, line: 37, baseType: !110, size: 96, align: 32, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !104, file: !105, line: 38, baseType: !115, size: 32, align: 32, offset: 480)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !104, file: !105, line: 40, baseType: !110, size: 96, align: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !104, file: !105, line: 41, baseType: !115, size: 32, align: 32, offset: 608)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !104, file: !105, line: 43, baseType: !110, size: 96, align: 32, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !104, file: !105, line: 44, baseType: !10, size: 32, align: 32, offset: 736)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !104, file: !105, line: 46, baseType: !123, size: 512, align: 32, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !125, templateParams: !142)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !124, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!142 = !{!14, !143, !144}
!143 = !DITemplateValueParameter(name: "row_count", type: !16, value: i32 4)
!144 = !DITemplateValueParameter(name: "col_count", type: !16, value: i32 4)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !104, file: !105, line: 47, baseType: !123, size: 512, align: 32, offset: 1280)
!146 = !DIGlobalVariable(name: "cbGaussianFilter", linkageName: "\01?cbGaussianFilter@@3U?$ConstantBuffer@UConstantBufferGaussianFilter@@@@A", scope: !0, file: !1, line: 4, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferGaussianFilter>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !148)
!148 = !{!149}
!149 = !DITemplateTypeParameter(name: "T", type: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferGaussianFilter", file: !105, line: 221, size: 256, align: 32, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !150, file: !105, line: 223, baseType: !110, size: 96, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !150, file: !105, line: 224, baseType: !115, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !150, file: !105, line: 226, baseType: !115, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "KernelSize", scope: !150, file: !105, line: 227, baseType: !115, size: 32, align: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !150, file: !105, line: 228, baseType: !115, size: 32, align: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !150, file: !105, line: 229, baseType: !115, size: 32, align: 32, offset: 224)
!158 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !68, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !160, isLocal: false, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !161)
!161 = !{!23}
!162 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !160, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !160, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !160, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 14, type: !166, isLocal: false, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !167)
!167 = !{!14}
!168 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 15, type: !166, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 17, type: !68, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gGaussianFaceIndices", linkageName: "\01?gGaussianFaceIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 19, type: !160, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariable(name: "gFaceRadianceReadBuffer", linkageName: "\01?gFaceRadianceReadBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 21, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !173)
!173 = !{!174}
!174 = !DITemplateTypeParameter(name: "element", type: !18)
!175 = !DIGlobalVariable(name: "gReadFinalRadianceBuffer", linkageName: "\01?gReadFinalRadianceBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 23, type: !172, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 25, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 25, size: 64, align: 32, elements: !2, templateParams: !173)
!178 = !DIGlobalVariable(name: "gGaussianPrecomputedDataBuffer", linkageName: "\01?gGaussianPrecomputedDataBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 26, type: !179, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !167)
!180 = !DIGlobalVariable(name: "gWriteFinalRadianceBuffer", linkageName: "\01?gWriteFinalRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 28, type: !177, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !86, line: 87, type: !182, isLocal: false, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !87, size: 32, align: 4, offset: 32)
!183 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !86, line: 87, type: !184, isLocal: false, isDefinition: true)
!184 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !87, size: 32, align: 4, offset: 64)
!185 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !86, line: 87, type: !186, isLocal: false, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !87, size: 32, align: 4)
!187 = !{i32 2, !"Dwarf Version", i32 4}
!188 = !{i32 2, !"Debug Info Version", i32 3}
!189 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
