#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f69d76fc86a0b685e2afabb875ddde98.pdb
; shader hash: f69d76fc86a0b685e2afabb875ddde98
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !89)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CGaussianFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !14, !23, !24, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 197, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 197, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 197, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 197, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 197, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !{!22, !13}
!22 = !DITemplateTypeParameter(name: "element", type: !18)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 184, baseType: !18)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 225, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 225, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 225, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 225, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 225, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 224, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 224, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 224, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 224, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!22, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 241, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 241, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 241, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 241, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!32, !39}
!46 = !{!47, !50, !54, !57, !61, !65, !68, !71, !75, !78, !81, !85, !86}
!47 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 182, type: !48, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !14}
!50 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !51, file: !51, line: 83, type: !52, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!23, !14, !14}
!54 = !DISubprogram(name: "gaussianDistribution", linkageName: "\01?gaussianDistribution@@YAMMMMM@Z", scope: !1, file: !1, line: 75, type: !55, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!28, !28, !28, !28, !28}
!57 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !58, file: !58, line: 117, type: !59, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!59 = !DISubroutineType(types: !60)
!60 = !{!40, !23}
!61 = !DISubprogram(name: "filterFace", linkageName: "\01?filterFace@@YA?AV?$vector@M$02@@II_N@Z", scope: !1, file: !1, line: 85, type: !62, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!24, !23, !23, !64}
!64 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!65 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !51, file: !51, line: 74, type: !66, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!14, !23, !14}
!68 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !51, file: !51, line: 91, type: !69, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!64, !14, !4, !14}
!71 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !51, file: !51, line: 124, type: !72, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!64, !14, !14, !74}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!75 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !51, file: !51, line: 102, type: !76, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!64, !23, !74}
!78 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 35, type: !79, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!33, !14, !14}
!81 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 113, type: !82, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!64, !23, !84}
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 26, size: 32, align: 32, elements: !2)
!85 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 130, type: !82, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !58, file: !58, line: 125, type: !87, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!23, !40}
!89 = !{!90, !93, !95, !96, !97, !99, !101, !103, !104, !105, !151, !163, !164, !167, !168, !169, !170, !173, !174, !178, !179, !181, !183, !184, !185, !187, !188, !189, !191, !193}
!90 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !91, line: 87, type: !92, isLocal: true, isDefinition: true)
!91 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!93 = !DIGlobalVariable(name: "PI", scope: !0, file: !91, line: 105, type: !94, isLocal: true, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!95 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !91, line: 106, type: !94, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !91, line: 107, type: !94, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !58, line: 45, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!99 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !58, line: 46, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!101 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!103 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !94, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !94, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !107)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "T", type: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !110, line: 26, size: 1792, align: 32, elements: !111)
!110 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!111 = !{!112, !113, !114, !117, !118, !119, !121, !122, !123, !124, !125, !126, !127, !150}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !109, file: !110, line: 28, baseType: !14, size: 96, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !109, file: !110, line: 29, baseType: !28, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !109, file: !110, line: 31, baseType: !115, size: 96, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !116, line: 4, baseType: !24)
!116 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !109, file: !110, line: 32, baseType: !28, size: 32, align: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !109, file: !110, line: 34, baseType: !115, size: 96, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !109, file: !110, line: 35, baseType: !120, size: 32, align: 32, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !116, line: 8, baseType: !23)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !109, file: !110, line: 37, baseType: !115, size: 96, align: 32, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !109, file: !110, line: 38, baseType: !120, size: 32, align: 32, offset: 480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !109, file: !110, line: 40, baseType: !115, size: 96, align: 32, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !109, file: !110, line: 41, baseType: !120, size: 32, align: 32, offset: 608)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !109, file: !110, line: 43, baseType: !115, size: 96, align: 32, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !109, file: !110, line: 44, baseType: !28, size: 32, align: 32, offset: 736)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !109, file: !110, line: 46, baseType: !128, size: 512, align: 32, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !130, templateParams: !147)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !129, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!147 = !{!32, !148, !149}
!148 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!149 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !109, file: !110, line: 47, baseType: !128, size: 512, align: 32, offset: 1280)
!151 = !DIGlobalVariable(name: "cbGaussianFilter", linkageName: "\01?cbGaussianFilter@@3U?$ConstantBuffer@UConstantBufferGaussianFilter@@@@A", scope: !0, file: !1, line: 4, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferGaussianFilter>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "T", type: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferGaussianFilter", file: !110, line: 221, size: 256, align: 32, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !155, file: !110, line: 223, baseType: !115, size: 96, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !155, file: !110, line: 224, baseType: !120, size: 32, align: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !155, file: !110, line: 226, baseType: !120, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "KernelSize", scope: !155, file: !110, line: 227, baseType: !120, size: 32, align: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !155, file: !110, line: 228, baseType: !120, size: 32, align: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !155, file: !110, line: 229, baseType: !120, size: 32, align: 32, offset: 224)
!163 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !74, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !166)
!166 = !{!22}
!167 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !165, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !165, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !165, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 14, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !172)
!172 = !{!32}
!173 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 15, type: !171, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gFaceRadianceReadBuffer", linkageName: "\01?gFaceRadianceReadBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 17, type: !175, isLocal: false, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !176)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "element", type: !34)
!178 = !DIGlobalVariable(name: "gReadFinalRadianceBuffer", linkageName: "\01?gReadFinalRadianceBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 19, type: !175, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 21, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !176)
!181 = !DIGlobalVariable(name: "gGaussianPrecomputedDataBuffer", linkageName: "\01?gGaussianPrecomputedDataBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 22, type: !182, isLocal: false, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 22, size: 32, align: 32, elements: !2, templateParams: !172)
!183 = !DIGlobalVariable(name: "gWriteFinalRadianceBuffer", linkageName: "\01?gWriteFinalRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 24, type: !180, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !84, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariable(name: "gGaussianFaceIndices", linkageName: "\01?gGaussianFaceIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !186, isLocal: false, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !166)
!187 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 28, type: !84, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 29, type: !84, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !91, line: 87, type: !190, isLocal: false, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !92, size: 32, align: 4, offset: 64)
!191 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !91, line: 87, type: !192, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !92, size: 32, align: 4)
!193 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !91, line: 87, type: !194, isLocal: false, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !92, size: 32, align: 4, offset: 32)
!195 = !{i32 2, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
