#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2f1faf4ae44248c083e47aa9e6b6d7cf.pdb
; shader hash: 2f1faf4ae44248c083e47aa9e6b6d7cf
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           float pad1;                               ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           float pad2;                               ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !87)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CGaussianFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !30, !38, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 189, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 189, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 189, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 189, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 189, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 188, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 188, size: 64, align: 32, elements: !17, templateParams: !21)
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 188, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 188, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !19)
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 196, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 196, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 196, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 196, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !23}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 107, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 107, size: 96, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 107, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 107, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 107, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!37, !13}
!37 = !DITemplateTypeParameter(name: "element", type: !14)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!22, !13}
!45 = !{!46, !49, !54, !61, !65, !68, !72, !75, !78, !81, !84}
!46 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 175, type: !47, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !38}
!49 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !50, file: !50, line: 117, type: !51, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!51 = !DISubroutineType(types: !52)
!52 = !{!24, !53}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 177, baseType: !19)
!54 = !DISubprogram(name: "filterFace", linkageName: "\01?filterFace@@YA?AV?$vector@M$02@@HV?$RWStructuredBuffer@V?$vector@I$01@@@@_N@Z", scope: !1, file: !1, line: 79, type: !55, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!4, !14, !57, !60}
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 23, size: 64, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "element", type: !16)
!60 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!61 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !62, file: !62, line: 74, type: !63, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!38, !53, !38}
!65 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !62, file: !62, line: 91, type: !66, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!60, !38, !30, !38}
!68 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !62, file: !62, line: 124, type: !69, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!60, !38, !38, !71}
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!72 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !62, file: !62, line: 83, type: !73, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!53, !38, !38}
!75 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !62, file: !62, line: 102, type: !76, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!60, !53, !71}
!78 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 29, type: !79, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!15, !38, !38}
!81 = !DISubprogram(name: "gaussianDistribution", linkageName: "\01?gaussianDistribution@@YAMMMMM@Z", scope: !1, file: !1, line: 69, type: !82, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!8, !8, !8, !8, !8}
!84 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !50, file: !50, line: 125, type: !85, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!53, !24}
!87 = !{!88, !91, !93, !94, !95, !97, !99, !101, !102, !103, !149, !159, !160, !163, !164, !165, !166, !168, !169, !172, !173, !174, !175, !176, !177, !179, !181}
!88 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !89, line: 86, type: !90, isLocal: true, isDefinition: true)
!89 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!91 = !DIGlobalVariable(name: "PI", scope: !0, file: !89, line: 104, type: !92, isLocal: true, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!93 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !89, line: 105, type: !92, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !89, line: 106, type: !92, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !50, line: 45, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!97 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !50, line: 46, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!99 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !62, line: 15, type: !100, isLocal: true, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!101 = !DIGlobalVariable(name: "cos30", scope: !0, file: !62, line: 16, type: !92, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariable(name: "cos25", scope: !0, file: !62, line: 17, type: !92, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !105)
!105 = !{!106}
!106 = !DITemplateTypeParameter(name: "T", type: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !108, line: 26, size: 1792, align: 32, elements: !109)
!108 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!109 = !{!110, !111, !112, !115, !116, !117, !119, !120, !121, !122, !123, !124, !125, !148}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !107, file: !108, line: 28, baseType: !38, size: 96, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !107, file: !108, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !107, file: !108, line: 31, baseType: !113, size: 96, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !114, line: 4, baseType: !4)
!114 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !107, file: !108, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !107, file: !108, line: 34, baseType: !113, size: 96, align: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !107, file: !108, line: 35, baseType: !118, size: 32, align: 32, offset: 352)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !114, line: 8, baseType: !53)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !107, file: !108, line: 37, baseType: !113, size: 96, align: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !107, file: !108, line: 38, baseType: !8, size: 32, align: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !107, file: !108, line: 40, baseType: !113, size: 96, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !107, file: !108, line: 41, baseType: !8, size: 32, align: 32, offset: 608)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !107, file: !108, line: 43, baseType: !113, size: 96, align: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !107, file: !108, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !107, file: !108, line: 46, baseType: !126, size: 512, align: 32, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !128, templateParams: !145)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !127, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!145 = !{!12, !146, !147}
!146 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!147 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !107, file: !108, line: 47, baseType: !126, size: 512, align: 32, offset: 1280)
!149 = !DIGlobalVariable(name: "cbGaussianFilter", linkageName: "\01?cbGaussianFilter@@3U?$ConstantBuffer@UConstantBufferGaussianFilter@@@@A", scope: !0, file: !1, line: 4, type: !150, isLocal: false, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferGaussianFilter>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !151)
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferGaussianFilter", file: !108, line: 204, size: 128, align: 32, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !153, file: !108, line: 206, baseType: !118, size: 32, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "KernelSize", scope: !153, file: !108, line: 207, baseType: !118, size: 32, align: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !153, file: !108, line: 208, baseType: !118, size: 32, align: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !153, file: !108, line: 209, baseType: !118, size: 32, align: 32, offset: 96)
!159 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !71, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !162)
!162 = !{!22}
!163 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !161, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !161, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !161, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "gVoxelFaceDataBuffer", linkageName: "\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 13, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 13, size: 64, align: 32, elements: !2, templateParams: !58)
!168 = !DIGlobalVariable(name: "gVoxelFaceStartCountBuffer", linkageName: "\01?gVoxelFaceStartCountBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 15, type: !167, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 17, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !171)
!171 = !{!12}
!172 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 18, type: !170, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 20, type: !71, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gVisibleFaceIndices", linkageName: "\01?gVisibleFaceIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 21, type: !161, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 23, type: !57, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "gFaceFilteredRadianceBuffer", linkageName: "\01?gFaceFilteredRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 24, type: !57, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !89, line: 86, type: !178, isLocal: false, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !90, size: 32, align: 4, offset: 32)
!179 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !89, line: 86, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !90, size: 32, align: 4)
!181 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !89, line: 86, type: !182, isLocal: false, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !90, size: 32, align: 4, offset: 64)
!183 = !{i32 2, !"Dwarf Version", i32 4}
!184 = !{i32 2, !"Debug Info Version", i32 3}
!185 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
