#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 0b42812f41ef3fc0b4842b9a855224c1.pdb
; shader hash: 0b42812f41ef3fc0b4842b9a855224c1
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbLerpRadiance
; {
;
;   struct cbLerpRadiance
;   {
;
;       struct struct.ConstantBufferLerpRadiance
;       {
;
;           uint CurrentPhase;                        ; Offset:    0
;           float accumulatedTime;                    ; Offset:    4
;           float maxTime;                            ; Offset:    8
;           uint FaceCount;                           ; Offset:   12
;       
;       } cbLerpRadiance;                             ; Offset:    0
;
;   
;   } cbLerpRadiance;                                 ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gGaussianReadBuffer
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gOldRadiance
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gNewRadiance
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !30, globals: !49)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLerpRadiance_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 44, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 44, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 32, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 32, size: 64, align: 32, elements: !17, templateParams: !21)
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 32, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 32, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !19)
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 59, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 59, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 59, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 59, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !23}
!30 = !{!31, !41, !46}
!31 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 24, type: !32, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!22, !13}
!41 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !42, file: !42, line: 117, type: !43, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!24, !45}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !19)
!46 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !42, file: !42, line: 125, type: !47, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!45, !24}
!49 = !{!50, !53, !55, !56, !57, !59, !61, !64, !65, !66, !112, !122, !126, !127, !128, !130, !132}
!50 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !51, line: 87, type: !52, isLocal: true, isDefinition: true)
!51 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!53 = !DIGlobalVariable(name: "PI", scope: !0, file: !51, line: 105, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!55 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !51, line: 106, type: !54, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !51, line: 107, type: !54, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !42, line: 45, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!59 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !42, line: 46, type: !60, isLocal: false, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !62, line: 15, type: !63, isLocal: true, isDefinition: true)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!64 = !DIGlobalVariable(name: "cos30", scope: !0, file: !62, line: 16, type: !54, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariable(name: "cos25", scope: !0, file: !62, line: 17, type: !54, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "cbCommons", linkageName: "\01?cbCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "T", type: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !71, line: 26, size: 1792, align: 32, elements: !72)
!71 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!72 = !{!73, !74, !75, !78, !79, !80, !82, !83, !84, !85, !86, !87, !88, !111}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !70, file: !71, line: 28, baseType: !34, size: 96, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !70, file: !71, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !70, file: !71, line: 31, baseType: !76, size: 96, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !77, line: 4, baseType: !4)
!77 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !70, file: !71, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !70, file: !71, line: 34, baseType: !76, size: 96, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !70, file: !71, line: 35, baseType: !81, size: 32, align: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !77, line: 8, baseType: !45)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !70, file: !71, line: 37, baseType: !76, size: 96, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !70, file: !71, line: 38, baseType: !81, size: 32, align: 32, offset: 480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !70, file: !71, line: 40, baseType: !76, size: 96, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !70, file: !71, line: 41, baseType: !81, size: 32, align: 32, offset: 608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !70, file: !71, line: 43, baseType: !76, size: 96, align: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !70, file: !71, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !70, file: !71, line: 46, baseType: !89, size: 512, align: 32, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !91, templateParams: !108)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !90, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!108 = !{!12, !109, !110}
!109 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!110 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !70, file: !71, line: 47, baseType: !89, size: 512, align: 32, offset: 1280)
!112 = !DIGlobalVariable(name: "cbLerpRadiance", linkageName: "\01?cbLerpRadiance@@3U?$ConstantBuffer@UConstantBufferLerpRadiance@@@@A", scope: !0, file: !1, line: 4, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferLerpRadiance>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !114)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !116)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferLerpRadiance", file: !71, line: 185, size: 128, align: 32, elements: !117)
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !116, file: !71, line: 187, baseType: !81, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "accumulatedTime", scope: !116, file: !71, line: 188, baseType: !8, size: 32, align: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !116, file: !71, line: 189, baseType: !8, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !116, file: !71, line: 190, baseType: !81, size: 32, align: 32, offset: 96)
!122 = !DIGlobalVariable(name: "gGaussianReadBuffer", linkageName: "\01?gGaussianReadBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 6, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 6, size: 64, align: 32, elements: !2, templateParams: !124)
!124 = !{!125}
!125 = !DITemplateTypeParameter(name: "element", type: !16)
!126 = !DIGlobalVariable(name: "gOldRadiance", linkageName: "\01?gOldRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 8, type: !123, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "gNewRadiance", linkageName: "\01?gNewRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 9, type: !123, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !51, line: 87, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !52, size: 32, align: 4)
!130 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !51, line: 87, type: !131, isLocal: false, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !52, size: 32, align: 4, offset: 32)
!132 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !51, line: 87, type: !133, isLocal: false, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !52, size: 32, align: 4, offset: 64)
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!137 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLerpRadiance_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferLerpRadiance> cbLerpRadiance : register(b1);\0D\0A\0D\0ARWStructuredBuffer<uint2> gGaussianReadBuffer : register(u0, space0);\0D\0A\0D\0ARWStructuredBuffer<uint2> gOldRadiance : register(u0, space1);\0D\0ARWStructuredBuffer<uint2> gNewRadiance : register(u1, space1);\0D\0A\0D\0Afloat3 easeOutInterpolation(float3 colorA, float3 colorB, float t)\0D\0A{\0D\0A    // Clamp t to the range [0, 1] to avoid unexpected results\0D\0A    t = saturate(t);\0D\0A\0D\0A    // Apply the ease-out cubic formula: 1 - (1 - t)^4\0D\0A    float easeT = 1.0 - pow(1.0 - t, 3.0);\0D\0A\0D\0A    // Interpolate between the two colors using the eased t value\0D\0A    return lerp(colorA, colorB, easeT);\0D\0A}\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    if (DTid.x >= cbLerpRadiance.FaceCount)\0D\0A        return;\0D\0A    \0D\0A    if (cbLerpRadiance.accumulatedTime > cbLerpRadiance.maxTime)\0D\0A        return;\0D\0A    \0D\0A    uint2 oldRadiancePacked = gOldRadiance[DTid.x];\0D\0A    uint2 newRadiancePacked = gNewRadiance[DTid.x];\0D\0A    \0D\0A    if (cbLerpRadiance.CurrentPhase == 1)\0D\0A    {\0D\0A        oldRadiancePacked = newRadiancePacked;\0D\0A        newRadiancePacked = gGaussianReadBuffer[DTid.x];\0D\0A        \0D\0A        gOldRadiance[DTid.x] = oldRadiancePacked;\0D\0A        gNewRadiance[DTid.x] = newRadiancePacked;\0D\0A    }\0D\0A        \0D\0A    float3 oldRadiance = float3(0.0f, 0.0f, 0.0f);\0D\0A    float3 newRadiance = float3(0.0f, 0.0f, 0.0f);\0D\0A    \0D\0A    oldRadiance.xy = UnpackFloats16(oldRadiancePacked.x);\0D\0A    oldRadiance.z = UnpackFloats16(oldRadiancePacked.y).x;\0D\0A    \0D\0A    newRadiance.xy = UnpackFloats16(newRadiancePacked.x);\0D\0A    newRadiance.z = UnpackFloats16(newRadiancePacked.y).x;\0D\0A        \0D\0A    float lerpFactor = cbLerpRadiance.accumulatedTime / cbLerpRadiance.maxTime;\0D\0A    \0D\0A    float3 lerpRadiance = lerp(oldRadiance, newRadiance, lerpFactor);\0D\0A    \0D\0A    uint2 packedRadiance = uint2(0, 0);\0D\0A    packedRadiance.x = PackFloats16(lerpRadiance.xy);\0D\0A    packedRadiance.y = PackFloats16(float2(lerpRadiance.z, 0.0f));\0D\0A    \0D\0A    gGaussianReadBuffer[DTid.x] = packedRadiance;\0D\0A    \0D\0A}"}
