#if 0
;
; Note: shader requires additional functionality:
;       Raytracing tier 1.1 features
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 3def0711f21b5903f8df9c203c66afaa.pdb
; shader hash: 3def0711f21b5903f8df9c203c66afaa
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           float pad1;                               ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           float pad2;                               ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !37)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 50, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 50, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 50, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 91, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 91, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 91, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 91, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 91, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !15)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 110, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 110, size: 128, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 110, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 110, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 110, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !1, line: 110, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !{!34}
!34 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 53, type: !35, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !4, !4, !4}
!37 = !{!38, !40, !41, !42, !45, !47, !48, !49, !52, !53, !54, !55, !58, !60, !61, !62, !63, !109, !126, !144, !147, !148, !149, !150, !158, !168, !169, !171, !173, !174, !176, !180, !183, !184, !186, !188}
!38 = !DIGlobalVariable(name: "gsIsOutsideFrustum", linkageName: "\01?gsIsOutsideFrustum@@3IA", scope: !0, file: !1, line: 48, type: !39, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOutsideFrustum@@3IA")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 48, baseType: !8)
!40 = !DIGlobalVariable(name: "gsIsOccluded", linkageName: "\01?gsIsOccluded@@3IA", scope: !0, file: !1, line: 49, type: !39, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOccluded@@3IA")
!41 = !DIGlobalVariable(name: "gsStartAddress", linkageName: "\01?gsStartAddress@@3IA", scope: !0, file: !1, line: 50, type: !39, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsStartAddress@@3IA")
!42 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !43, line: 8, type: !44, isLocal: true, isDefinition: true, variable: i32 -1)
!43 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!45 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 46, type: !46, isLocal: true, isDefinition: true, variable: float 0x3FF6A09E60000000)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!47 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 186, type: !44, isLocal: true, isDefinition: true, variable: i32 0)
!48 = !DIGlobalVariable(name: "CANDIDATE_PROCEDURAL_PRIMITIVE", scope: !0, file: !1, line: 190, type: !44, isLocal: true, isDefinition: true, variable: i32 1)
!49 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !50, line: 86, type: !51, isLocal: true, isDefinition: true)
!50 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!52 = !DIGlobalVariable(name: "PI", scope: !0, file: !50, line: 104, type: !46, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !50, line: 105, type: !46, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !50, line: 106, type: !46, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !56, line: 47, type: !57, isLocal: false, isDefinition: true)
!56 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 47, size: 32, align: 32, elements: !2)
!58 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !56, line: 48, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!60 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !43, line: 8, type: !44, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariable(name: "cos30", scope: !0, file: !43, line: 9, type: !46, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariable(name: "cos25", scope: !0, file: !43, line: 10, type: !46, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 23, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 23, size: 32, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "T", type: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !68, line: 26, size: 1792, align: 32, elements: !69)
!68 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!69 = !{!70, !71, !72, !75, !76, !77, !79, !80, !81, !82, !83, !84, !85, !108}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !67, file: !68, line: 28, baseType: !4, size: 96, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !67, file: !68, line: 29, baseType: !15, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !67, file: !68, line: 31, baseType: !73, size: 96, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !74, line: 4, baseType: !16)
!74 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !67, file: !68, line: 32, baseType: !15, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !67, file: !68, line: 34, baseType: !73, size: 96, align: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !67, file: !68, line: 35, baseType: !78, size: 32, align: 32, offset: 352)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !74, line: 8, baseType: !39)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !67, file: !68, line: 37, baseType: !73, size: 96, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !67, file: !68, line: 38, baseType: !15, size: 32, align: 32, offset: 480)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !67, file: !68, line: 40, baseType: !73, size: 96, align: 32, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !67, file: !68, line: 41, baseType: !15, size: 32, align: 32, offset: 608)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !67, file: !68, line: 43, baseType: !73, size: 96, align: 32, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !67, file: !68, line: 44, baseType: !15, size: 32, align: 32, offset: 736)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !67, file: !68, line: 46, baseType: !86, size: 512, align: 32, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !88, templateParams: !105)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !87, file: !1, line: 23, baseType: !15, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!105 = !{!23, !106, !107}
!106 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!107 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !67, file: !68, line: 47, baseType: !86, size: 512, align: 32, offset: 1280)
!109 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 24, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !111)
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "T", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !68, line: 124, size: 1024, align: 32, elements: !114)
!114 = !{!115, !120, !121, !122, !123, !124, !125}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !113, file: !68, line: 126, baseType: !116, size: 768, align: 32)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 768, align: 32, elements: !118)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !74, line: 5, baseType: !24)
!118 = !{!119}
!119 = !DISubrange(count: 6)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !113, file: !68, line: 128, baseType: !73, size: 96, align: 32, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !113, file: !68, line: 129, baseType: !78, size: 32, align: 32, offset: 864)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !113, file: !68, line: 131, baseType: !78, size: 32, align: 32, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !113, file: !68, line: 132, baseType: !78, size: 32, align: 32, offset: 928)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !113, file: !68, line: 133, baseType: !15, size: 32, align: 32, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !113, file: !68, line: 134, baseType: !15, size: 32, align: 32, offset: 992)
!126 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@UConstantBufferCamera@@@@A", scope: !0, file: !1, line: 25, type: !127, isLocal: false, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferCamera>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !128)
!128 = !{!129}
!129 = !DITemplateTypeParameter(name: "T", type: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferCamera", file: !1, line: 4, size: 3328, align: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !130, file: !1, line: 6, baseType: !86, size: 512, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "invView", scope: !130, file: !1, line: 7, baseType: !86, size: 512, align: 32, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !130, file: !1, line: 8, baseType: !86, size: 512, align: 32, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "invProjection", scope: !130, file: !1, line: 9, baseType: !86, size: 512, align: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjection", scope: !130, file: !1, line: 10, baseType: !86, size: 512, align: 32, offset: 2048)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjection", scope: !130, file: !1, line: 11, baseType: !86, size: 512, align: 32, offset: 2560)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "eyePosition", scope: !130, file: !1, line: 14, baseType: !73, size: 96, align: 32, offset: 3072)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nearPlane", scope: !130, file: !1, line: 15, baseType: !15, size: 32, align: 32, offset: 3168)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "farPlane", scope: !130, file: !1, line: 17, baseType: !15, size: 32, align: 32, offset: 3200)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !130, file: !1, line: 18, baseType: !15, size: 32, align: 32, offset: 3232)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !130, file: !1, line: 19, baseType: !15, size: 32, align: 32, offset: 3264)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !130, file: !1, line: 20, baseType: !15, size: 32, align: 32, offset: 3296)
!144 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !145, isLocal: false, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !146)
!146 = !{!12}
!147 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !145, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 29, type: !145, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !145, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 32, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 32, size: 192, align: 32, elements: !2, templateParams: !152)
!152 = !{!153}
!153 = !DITemplateTypeParameter(name: "element", type: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !68, line: 12, size: 192, align: 32, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !154, file: !68, line: 14, baseType: !16, size: 96, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !154, file: !68, line: 15, baseType: !16, size: 96, align: 32, offset: 96)
!158 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 33, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 33, size: 256, align: 32, elements: !2, templateParams: !160)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "element", type: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !68, line: 145, size: 256, align: 32, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !162, file: !68, line: 147, baseType: !73, size: 96, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !162, file: !68, line: 148, baseType: !78, size: 32, align: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !162, file: !68, line: 149, baseType: !73, size: 96, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !162, file: !68, line: 150, baseType: !78, size: 32, align: 32, offset: 224)
!168 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !145, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 37, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 37, size: 32, align: 32, elements: !2)
!171 = !DIGlobalVariable(name: "gVisibleVoxels", linkageName: "\01?gVisibleVoxels@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 39, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 39, size: 32, align: 32, elements: !2)
!173 = !DIGlobalVariable(name: "gVisibleVoxelCounter", linkageName: "\01?gVisibleVoxelCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 40, type: !172, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gVisibleVoxelIndices", linkageName: "\01?gVisibleVoxelIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 41, type: !175, isLocal: false, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 41, size: 32, align: 32, elements: !2, templateParams: !146)
!176 = !DIGlobalVariable(name: "gDispatchIndirectBuffer", linkageName: "\01?gDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 42, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 42, size: 96, align: 32, elements: !2, templateParams: !178)
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "element", type: !5)
!180 = !DIGlobalVariable(name: "gVoxelRadiance", linkageName: "\01?gVoxelRadiance@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 44, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 44, size: 32, align: 32, elements: !2, templateParams: !182)
!182 = !{!23}
!183 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 46, type: !46, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !50, line: 86, type: !185, isLocal: false, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !51, size: 32, align: 4, offset: 32)
!186 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !50, line: 86, type: !187, isLocal: false, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !51, size: 32, align: 4)
!188 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !50, line: 86, type: !189, isLocal: false, isDefinition: true)
!189 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !51, size: 32, align: 4, offset: 64)
!190 = !{i32 2, !"Dwarf Version", i32 4}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!193 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0Astruct ConstantBufferCamera\0D\0A{\0D\0A    XMFLOAT4X4 view;\0D\0A\09XMFLOAT4X4 invView;\0D\0A\09XMFLOAT4X4 projection;\0D\0A\09XMFLOAT4X4 invProjection;\0D\0A\09XMFLOAT4X4 viewProjection;\0D\0A\09XMFLOAT4X4 invViewProjection;\0D\0A    \0D\0A    // Use by shadow cameras only.\0D\0A    XMFLOAT3 eyePosition;\0D\0A    float nearPlane;\0D\0A\0D\0A    float farPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferFrustumCulling> cbFrustumCulling : register(b1);\0D\0AConstantBuffer<ConstantBufferCamera> cbCamera : register(b2);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space0);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space0);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space0);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space0);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space1);\0D\0AStructuredBuffer<ClusterAABBInfo> gClusterAABBInfoBuffer : register(t1, space1);\0D\0A// Map from aabbVoxelIndices to gVoxelIndicesCompactBuffer.\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space1);\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space2);\0D\0A\0D\0ARWByteAddressBuffer gVisibleVoxels : register(u0);\0D\0ARWByteAddressBuffer gVisibleVoxelCounter : register(u1);\0D\0ARWStructuredBuffer<uint> gVisibleVoxelIndices : register(u2);\0D\0ARWStructuredBuffer<uint3> gDispatchIndirectBuffer : register(u3);\0D\0A\0D\0ARWStructuredBuffer<float> gVoxelRadiance : register(u0, space1);\0D\0A\0D\0Astatic const float SQRT_2 = 1.41421356237f;\0D\0A\0D\0Agroupshared uint gsIsOutsideFrustum;\0D\0Agroupshared uint gsIsOccluded;\0D\0Agroupshared uint gsStartAddress;\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS(uint3 DTid : SV_DispatchThreadID, uint3 groupId : SV_GroupID, uint3 threadIdx : SV_GroupThreadID)\0D\0A{\0D\0A    uint threadLinearIndex = DTid.x;\0D\0A    \0D\0A    if (cbFrustumCulling.CurrentStep == 0)\0D\0A    {\0D\0A        if (threadLinearIndex >= cbFrustumCulling.VoxelCount)\0D\0A            return;\0D\0A        \0D\0A        if (threadLinearIndex == 0)\0D\0A        {\0D\0A            gVisibleVoxelCounter.Store(0, 0);\0D\0A            gDispatchIndirectBuffer[0] = uint3(0, 1, 1);\0D\0A        }\0D\0A        \0D\0A        gVoxelRadiance[threadLinearIndex] = 0.0f;\0D\0A        \0D\0A        uint bit = threadLinearIndex & 31u;\0D\0A        \0D\0A        //if (bit == 0)\0D\0A        //{\0D\0A        uint index = threadLinearIndex >> 5u;\0D\0A        index = index * 4;\0D\0A        uint outval;\0D\0A        gVisibleVoxels.InterlockedAnd(index, (1u << bit), outval);\0D\0A        //}\0D\0A\0D\0A        \0D\0A        gVisibleVoxelIndices[threadLinearIndex] = UINT_MAX;\0D\0A    }\0D\0A\0D\0A    else if (cbFrustumCulling.CurrentStep == 1)\0D\0A    {\0D\0A        if (groupId.x >= cbFrustumCulling.AABBGroupCount)\0D\0A            return;\0D\0A        \0D\0A\0D\0A        \0D\0A        ClusterAABBInfo aabbInfo = gClusterAABBInfoBuffer[groupId.x];\0D\0A        uint aabbsPerThread = ceil((float) aabbInfo.ClusterElementCount / 128.0f);\0D\0A        uint aabbStart = aabbInfo.ClusterStartIndex + threadIdx.x * aabbsPerThread;\0D\0A        uint aabbEnd = min(aabbStart + aabbsPerThread, aabbInfo.ClusterStartIndex + aabbInfo.ClusterElementCount);\0D\0A        \0D\0A\0D\0A        if (threadIdx.x == 0)\0D\0A        {\0D\0A            gsIsOutsideFrustum = 0;\0D\0A            gsIsOccluded = 1;\0D\0A            gsStartAddress = 0;\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        if (threadIdx.x < 6)\0D\0A        {\0D\0A\0D\0A            // Get the normal and distance (D) from the plane\0D\0A            float4 frustumPlane = cbFrustumCulling.FrustumPlanes[threadIdx.x];\0D\0A        \0D\0A            float3 normal = frustumPlane.xyz;\0D\0A            float d = frustumPlane.w;\0D\0A            \0D\0A            float3 aabbMin = aabbInfo.Min;\0D\0A            float3 aabbMax = aabbInfo.Max;\0D\0A        \0D\0A            // Compute the positive vertex of the AABB for this plane\0D\0A            float3 positiveVertex = float3(\0D\0A            (normal.x > 0) ? aabbMax.x : aabbMin.x,\0D\0A            (normal.y > 0) ? aabbMax.y : aabbMin.y,\0D\0A            (normal.z > 0) ? aabbMax.z : aabbMin.z);\0D\0A        \0D\0A\0D\0A            // If the positive vertex is outside the plane, the AABB is outside the frustum\0D\0A            if (dot(normal, positiveVertex) + d < 0)\0D\0A            {\0D\0A                InterlockedOr(gsIsOutsideFrustum, 1);\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        \0D\0A        if (gsIsOutsideFrustum == 0)\0D\0A        {\0D\0A            float3 facesAndCorners[14] =\0D\0A            {\0D\0A                // 4 edge midpoints\0D\0A                float3(0.0f, 0.0f, -2.0f),\0D\0A                float3(0.0f, 0.0f, 2.0f),\0D\0A                float3(0.0f, -2.0f, 0.0f),\0D\0A                float3(0.0f, 2.0f, 0.0f),\0D\0A                float3(-2.0f, 0.0f, 0.0f),\0D\0A                float3(2.0f, 0.0f, 0.0f),\0D\0A                \0D\0A                float3(-SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, SQRT_2)\0D\0A            };\0D\0A            \0D\0A           \0D\0A            float3 eyePos = mul(float4(cbCamera.eyePosition, 1.0f), cbVoxelCommons.WorldToVoxel).xyz;\0D\0A\0D\0A            RayQuery < RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH | RAY_FLAG_SKIP_TRIANGLES > q;\0D\0A            \0D\0A\0D\0A            bool isOccluded = (gsIsOccluded == 1);\0D\0A            \0D\0A            for (uint v = aabbStart; v < aabbEnd && isOccluded; v++)\0D\0A            {\0D\0A\0D\0A                AABB voxelAABB = gVoxelAABBBuffer[v];\0D\0A                float3 aabbCenter = (voxelAABB.Min + voxelAABB.Max) * 0.5f;\0D\0A                \0D\0A                for (uint f = 0; f < 14 && isOccluded; f++)\0D\0A                {\0D\0A                    isOccluded = (gsIsOccluded == 1);\0D\0A\0D\0A                    bool hitSomething = false;\0D\0A                    float3 origin = aabbCenter + facesAndCorners[f];\0D\0A                    float3 direction = eyePos - origin;\0D\0A                    float distance = length(direction);\0D\0A                \0D\0A                    RayDesc ray;\0D\0A                    ray.Origin = origin;\0D\0A                    ray.Direction = direction / distance;\0D\0A                    ray.TMin = 0.1f;\0D\0A                    ray.TMax = distance;\0D\0A                \0D\0A                    q.TraceRayInline(Scene, RAY_FLAG_NONE, ~0, ray);\0D\0A                    \0D\0A                    while (q.Proceed())\0D\0A                    {\0D\0A                        if (q.CandidateType() == CANDIDATE_PROCEDURAL_PRIMITIVE)\0D\0A                        {\0D\0A                            q.CommitProceduralPrimitiveHit(1.0f);\0D\0A                            hitSomething = true;\0D\0A                            break;\0D\0A                        }\0D\0A                        \0D\0A                    }\0D\0A                    \0D\0A                    if (!hitSomething)\0D\0A                    {\0D\0A                        isOccluded = false;\0D\0A                        gsIsOccluded = 0;\0D\0A                    }\0D\0A                }\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A            \0D\0A        if (gsIsOccluded == 0)\0D\0A        {\0D\0A            if (threadIdx.x == 0)\0D\0A            {\0D\0A                gVisibleVoxelCounter.InterlockedAdd(0, aabbInfo.ClusterElementCount, gsStartAddress);\0D\0A            }\0D\0A\0D\0A            GroupMemoryBarrierWithGroupSync();\0D\0A    \0D\0A            uint startAddr = gsStartAddress;\0D\0A                \0D\0A            for (uint i = aabbStart; i < aabbEnd; i++)\0D\0A            {\0D\0A                gVisibleVoxelIndices[startAddr + i - aabbInfo.ClusterStartIndex] = gAABBVoxelIndices[i];\0D\0A            }\0D\0A        \0D\0A            // We will use this buffer to dispatch the indirect draw call with a number of thread groups equal to\0D\0A            // visibileVoxels / 128.\0D\0A               \0D\0A            if (threadIdx.x == 0)\0D\0A            {\0D\0A                InterlockedMax(gDispatchIndirectBuffer[0].x, ceil((startAddr + aabbInfo.ClusterElementCount) / 128.0f));\0D\0A            }\0D\0A\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A"}
!194 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}"}
!195 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A"}
!196 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!197 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!198 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09float pad2;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09XMUINT3 DispatchSize;\0D\0A\09UINT NumberOfFaces;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!199 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A    uint3 Center;\0D\0A    uint VoxelCount;\0D\0A    \0D\0A    float3 Normal;\0D\0A    uint FirstDataIndex;\0D\0A};\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A        return false;\0D\0A    \0D\0A    uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A    return all(result < gridDimension);\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!200 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl"}
!201 = !{!"-E", !"CS", !"-T", !"cs_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CData\5CShadersLightTransport_CS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!202 = !{i32 1, i32 5}
!203 = !{i32 1, i32 6}
!204 = !{!"cs", i32 6, i32 5}
!205 = !{!206, !215, !222, null}
!206 = !{!207, !209, !211, !213}
!207 = !{i32 0, %"class.StructuredBuffer<AABB>"* undef, !"gVoxelAABBBuffer", i32 1, i32 0, i32 1, i32 12, i32 0, !208}
!208 = !{i32 1, i32 24}
!209 = !{i32 1, %"class.StructuredBuffer<ClusterAABBInfo>"* undef, !"gClusterAABBInfoBuffer", i32 1, i32 1, i32 1, i32 12, i32 0, !210}
!210 = !{i32 1, i32 32}
!211 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* undef, !"gAABBVoxelIndices", i32 1, i32 2, i32 1, i32 12, i32 0, !212}
!212 = !{i32 1, i32 4}
!213 = !{i32 3, %struct.RaytracingAccelerationStructure* undef, !"Scene", i32 2, i32 0, i32 1, i32 16, i32 0, !214}
!214 = !{i32 0, i32 4}
!215 = !{!216, !217, !218, !219, !221}
!216 = !{i32 0, %struct.RWByteAddressBuffer* undef, !"gVisibleVoxels", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!217 = !{i32 1, %struct.RWByteAddressBuffer* undef, !"gVisibleVoxelCounter", i32 0, i32 1, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!218 = !{i32 2, %"class.RWStructuredBuffer<unsigned int>"* undef, !"gVisibleVoxelIndices", i32 0, i32 2, i32 1, i32 12, i1 false, i1 false, i1 false, !212}
!219 = !{i32 3, %"class.RWStructuredBuffer<vector<unsigned int, 3> >"* undef, !"gDispatchIndirectBuffer", i32 0, i32 3, i32 1, i32 12, i1 false, i1 false, i1 false, !220}
!220 = !{i32 1, i32 12}
!221 = !{i32 4, %"class.RWStructuredBuffer<float>"* undef, !"gVoxelRadiance", i32 1, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !212}
!222 = !{!223, !224, !225}
!223 = !{i32 0, %hostlayout.cbVoxelCommons* undef, !"cbVoxelCommons", i32 0, i32 0, i32 1, i32 224, null}
!224 = !{i32 1, %cbFrustumCulling* undef, !"cbFrustumCulling", i32 0, i32 1, i32 1, i32 128, null}
!225 = !{i32 2, %hostlayout.cbCamera* undef, !"cbCamera", i32 0, i32 2, i32 1, i32 416, null}
!226 = !{i32 0, %struct.ConstantBufferFrustumCulling undef, !227, %"class.StructuredBuffer<unsigned int>" undef, !235, %"class.StructuredBuffer<AABB>" undef, !240, %struct.AABB undef, !245, %"class.StructuredBuffer<ClusterAABBInfo>" undef, !248, %struct.ClusterAABBInfo undef, !252, %"class.RWStructuredBuffer<unsigned int>" undef, !235, %"class.RWStructuredBuffer<vector<unsigned int, 3> >" undef, !255, %"class.RWStructuredBuffer<float>" undef, !259, %cbFrustumCulling undef, !264, %hostlayout.struct.ConstantBufferVoxelCommons undef, !266, %hostlayout.cbVoxelCommons undef, !282, %hostlayout.struct.ConstantBufferCamera undef, !284, %hostlayout.cbCamera undef, !297}
!227 = !{i32 128, !228, !229, !230, !231, !232, !233, !234}
!228 = !{i32 6, !"FrustumPlanes", i32 3, i32 0, i32 7, i32 9}
!229 = !{i32 6, !"CameraPosition", i32 3, i32 96, i32 7, i32 9}
!230 = !{i32 6, !"AABBGroupCount", i32 3, i32 108, i32 7, i32 5}
!231 = !{i32 6, !"CurrentStep", i32 3, i32 112, i32 7, i32 5}
!232 = !{i32 6, !"VoxelCount", i32 3, i32 116, i32 7, i32 5}
!233 = !{i32 6, !"pad0", i32 3, i32 120, i32 7, i32 9}
!234 = !{i32 6, !"pad1", i32 3, i32 124, i32 7, i32 9}
!235 = !{i32 4, !236, !237}
!236 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!237 = !{i32 0, !238}
!238 = !{!239}
!239 = !{i32 0, i32 undef}
!240 = !{i32 28, !241, !242}
!241 = !{i32 6, !"h", i32 3, i32 0}
!242 = !{i32 0, !243}
!243 = !{!244}
!244 = !{i32 0, %struct.AABB undef}
!245 = !{i32 28, !246, !247}
!246 = !{i32 6, !"Min", i32 3, i32 0, i32 7, i32 9}
!247 = !{i32 6, !"Max", i32 3, i32 16, i32 7, i32 9}
!248 = !{i32 32, !241, !249}
!249 = !{i32 0, !250}
!250 = !{!251}
!251 = !{i32 0, %struct.ClusterAABBInfo undef}
!252 = !{i32 32, !246, !253, !247, !254}
!253 = !{i32 6, !"ClusterStartIndex", i32 3, i32 12, i32 7, i32 5}
!254 = !{i32 6, !"ClusterElementCount", i32 3, i32 28, i32 7, i32 5}
!255 = !{i32 12, !236, !256}
!256 = !{i32 0, !257}
!257 = !{!258}
!258 = !{i32 0, <3 x i32> undef}
!259 = !{i32 4, !260, !261}
!260 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!261 = !{i32 0, !262}
!262 = !{!263}
!263 = !{i32 0, float undef}
!264 = !{i32 128, !265}
!265 = !{i32 6, !"cbFrustumCulling", i32 3, i32 0}
!266 = !{i32 224, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !281}
!267 = !{i32 6, !"voxelTextureDimensions", i32 3, i32 0, i32 7, i32 5}
!268 = !{i32 6, !"totalTime", i32 3, i32 12, i32 7, i32 9}
!269 = !{i32 6, !"voxelCellSize", i32 3, i32 16, i32 7, i32 9}
!270 = !{i32 6, !"deltaTime", i32 3, i32 28, i32 7, i32 9}
!271 = !{i32 6, !"invVoxelTextureDimensions", i32 3, i32 32, i32 7, i32 9}
!272 = !{i32 6, !"StoreData", i32 3, i32 44, i32 7, i32 5}
!273 = !{i32 6, !"invVoxelCellSize", i32 3, i32 48, i32 7, i32 9}
!274 = !{i32 6, !"pad1", i32 3, i32 60, i32 7, i32 9}
!275 = !{i32 6, !"SceneAABBMin", i32 3, i32 64, i32 7, i32 9}
!276 = !{i32 6, !"pad2", i32 3, i32 76, i32 7, i32 9}
!277 = !{i32 6, !"SceneAABBMax", i32 3, i32 80, i32 7, i32 9}
!278 = !{i32 6, !"pad3", i32 3, i32 92, i32 7, i32 9}
!279 = !{i32 6, !"VoxelToWorld", i32 2, !280, i32 3, i32 96, i32 7, i32 9}
!280 = !{i32 4, i32 4, i32 2}
!281 = !{i32 6, !"WorldToVoxel", i32 2, !280, i32 3, i32 160, i32 7, i32 9}
!282 = !{i32 224, !283}
!283 = !{i32 6, !"cbVoxelCommons", i32 3, i32 0}
!284 = !{i32 416, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!285 = !{i32 6, !"view", i32 2, !280, i32 3, i32 0, i32 7, i32 9}
!286 = !{i32 6, !"invView", i32 2, !280, i32 3, i32 64, i32 7, i32 9}
!287 = !{i32 6, !"projection", i32 2, !280, i32 3, i32 128, i32 7, i32 9}
!288 = !{i32 6, !"invProjection", i32 2, !280, i32 3, i32 192, i32 7, i32 9}
!289 = !{i32 6, !"viewProjection", i32 2, !280, i32 3, i32 256, i32 7, i32 9}
!290 = !{i32 6, !"invViewProjection", i32 2, !280, i32 3, i32 320, i32 7, i32 9}
!291 = !{i32 6, !"eyePosition", i32 3, i32 384, i32 7, i32 9}
!292 = !{i32 6, !"nearPlane", i32 3, i32 396, i32 7, i32 9}
!293 = !{i32 6, !"farPlane", i32 3, i32 400, i32 7, i32 9}
!294 = !{i32 6, !"_pad0", i32 3, i32 404, i32 7, i32 9}
!295 = !{i32 6, !"_pad1", i32 3, i32 408, i32 7, i32 9}
!296 = !{i32 6, !"_pad2", i32 3, i32 412, i32 7, i32 9}
!297 = !{i32 416, !298}
!298 = !{i32 6, !"cbCamera", i32 3, i32 0}
!299 = !{i32 1, void ()* @CS, !300}
!300 = !{!301}
!301 = !{i32 0, !2, !2}
!302 = !{void ()* @CS, !"CS", null, !205, !303}
!303 = !{i32 0, i64 33554449, i32 4, !304}
!304 = !{i32 128, i32 1, i32 1}
!305 = !DILocation(line: 186, column: 21, scope: !306)
!306 = distinct !DILexicalBlock(scope: !307, file: !1, line: 172, column: 17)
!307 = distinct !DILexicalBlock(scope: !308, file: !1, line: 171, column: 17)
!308 = distinct !DILexicalBlock(scope: !309, file: !1, line: 171, column: 17)
!309 = distinct !DILexicalBlock(scope: !310, file: !1, line: 166, column: 13)
!310 = distinct !DILexicalBlock(scope: !311, file: !1, line: 165, column: 13)
!311 = distinct !DILexicalBlock(scope: !312, file: !1, line: 165, column: 13)
!312 = distinct !DILexicalBlock(scope: !313, file: !1, line: 136, column: 9)
!313 = distinct !DILexicalBlock(scope: !314, file: !1, line: 135, column: 13)
!314 = distinct !DILexicalBlock(scope: !315, file: !1, line: 85, column: 5)
!315 = distinct !DILexicalBlock(scope: !316, file: !1, line: 84, column: 14)
!316 = distinct !DILexicalBlock(scope: !34, file: !1, line: 57, column: 9)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threadIdx", arg: 3, scope: !34, file: !1, line: 53, type: !4)
!318 = !DIExpression(DW_OP_bit_piece, 0, 32)
!319 = !DILocation(line: 53, column: 77, scope: !34)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupId", arg: 2, scope: !34, file: !1, line: 53, type: !4)
!321 = !DILocation(line: 53, column: 49, scope: !34)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !34, file: !1, line: 53, type: !4)
!323 = !DILocation(line: 53, column: 15, scope: !34)
!324 = !DILocation(line: 55, column: 10, scope: !34)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadLinearIndex", scope: !34, file: !1, line: 55, type: !39)
!326 = !DIExpression()
!327 = !DILocation(line: 57, column: 26, scope: !316)
!328 = !DILocation(line: 57, column: 38, scope: !316)
!329 = !DILocation(line: 57, column: 9, scope: !34)
!330 = !DILocation(line: 59, column: 51, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !1, line: 59, column: 13)
!332 = distinct !DILexicalBlock(scope: !316, file: !1, line: 58, column: 5)
!333 = !DILocation(line: 59, column: 31, scope: !331)
!334 = !DILocation(line: 59, column: 13, scope: !332)
!335 = !DILocation(line: 60, column: 13, scope: !331)
!336 = !DILocation(line: 62, column: 31, scope: !337)
!337 = distinct !DILexicalBlock(scope: !332, file: !1, line: 62, column: 13)
!338 = !DILocation(line: 62, column: 13, scope: !332)
!339 = !DILocation(line: 64, column: 13, scope: !340)
!340 = distinct !DILexicalBlock(scope: !337, file: !1, line: 63, column: 9)
!341 = !DILocation(line: 65, column: 40, scope: !340)
!342 = !DILocation(line: 66, column: 9, scope: !340)
!343 = !DILocation(line: 68, column: 43, scope: !332)
!344 = !DILocation(line: 70, column: 38, scope: !332)
!345 = !DILocation(line: 70, column: 14, scope: !332)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit", scope: !332, file: !1, line: 70, type: !39)
!347 = !DILocation(line: 74, column: 40, scope: !332)
!348 = !DILocation(line: 74, column: 14, scope: !332)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !332, file: !1, line: 74, type: !39)
!350 = !DILocation(line: 75, column: 23, scope: !332)
!351 = !DILocation(line: 75, column: 15, scope: !332)
!352 = !DILocation(line: 77, column: 50, scope: !332)
!353 = !DILocation(line: 77, column: 9, scope: !332)
!354 = !DILocation(line: 81, column: 49, scope: !332)
!355 = !DILocation(line: 82, column: 5, scope: !332)
!356 = !DILocation(line: 84, column: 31, scope: !315)
!357 = !DILocation(line: 84, column: 43, scope: !315)
!358 = !DILocation(line: 84, column: 14, scope: !316)
!359 = !DILocation(line: 86, column: 43, scope: !360)
!360 = distinct !DILexicalBlock(scope: !314, file: !1, line: 86, column: 13)
!361 = !DILocation(line: 86, column: 23, scope: !360)
!362 = !DILocation(line: 86, column: 13, scope: !314)
!363 = !DILocation(line: 87, column: 13, scope: !360)
!364 = !DILocation(line: 91, column: 36, scope: !314)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbInfo", scope: !314, file: !1, line: 91, type: !162)
!366 = !DILocation(line: 91, column: 25, scope: !314)
!367 = !DIExpression(DW_OP_bit_piece, 32, 32)
!368 = !DIExpression(DW_OP_bit_piece, 64, 32)
!369 = !DIExpression(DW_OP_bit_piece, 96, 32)
!370 = !DIExpression(DW_OP_bit_piece, 128, 32)
!371 = !DIExpression(DW_OP_bit_piece, 160, 32)
!372 = !DIExpression(DW_OP_bit_piece, 192, 32)
!373 = !DIExpression(DW_OP_bit_piece, 224, 32)
!374 = !DILocation(line: 92, column: 44, scope: !314)
!375 = !DILocation(line: 92, column: 73, scope: !314)
!376 = !DILocation(line: 92, column: 31, scope: !314)
!377 = !DILocation(line: 92, column: 14, scope: !314)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbsPerThread", scope: !314, file: !1, line: 92, type: !39)
!379 = !DILocation(line: 93, column: 67, scope: !314)
!380 = !DILocation(line: 93, column: 53, scope: !314)
!381 = !DILocation(line: 93, column: 14, scope: !314)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbStart", scope: !314, file: !1, line: 93, type: !39)
!383 = !DILocation(line: 94, column: 83, scope: !314)
!384 = !DILocation(line: 94, column: 38, scope: !314)
!385 = !DILocation(line: 94, column: 24, scope: !314)
!386 = !DILocation(line: 94, column: 14, scope: !314)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbEnd", scope: !314, file: !1, line: 94, type: !39)
!388 = !DILocation(line: 97, column: 25, scope: !389)
!389 = distinct !DILexicalBlock(scope: !314, file: !1, line: 97, column: 13)
!390 = !DILocation(line: 97, column: 13, scope: !314)
!391 = !DILocation(line: 99, column: 32, scope: !392)
!392 = distinct !DILexicalBlock(scope: !389, file: !1, line: 98, column: 9)
!393 = !DILocation(line: 100, column: 26, scope: !392)
!394 = !DILocation(line: 101, column: 28, scope: !392)
!395 = !DILocation(line: 102, column: 9, scope: !392)
!396 = !DILocation(line: 104, column: 9, scope: !314)
!397 = !DILocation(line: 106, column: 25, scope: !398)
!398 = distinct !DILexicalBlock(scope: !314, file: !1, line: 106, column: 13)
!399 = !DILocation(line: 106, column: 13, scope: !314)
!400 = !DILocation(line: 110, column: 35, scope: !401)
!401 = distinct !DILexicalBlock(scope: !398, file: !1, line: 107, column: 9)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frustumPlane", scope: !401, file: !1, line: 110, type: !24)
!403 = !DILocation(line: 110, column: 20, scope: !401)
!404 = !DILocation(line: 112, column: 20, scope: !401)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !401, file: !1, line: 112, type: !16)
!406 = !DILocation(line: 113, column: 19, scope: !401)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !401, file: !1, line: 113, type: !15)
!408 = !DILocation(line: 115, column: 20, scope: !401)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMin", scope: !401, file: !1, line: 115, type: !16)
!410 = !DILocation(line: 116, column: 20, scope: !401)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMax", scope: !401, file: !1, line: 116, type: !16)
!412 = !DILocation(line: 120, column: 23, scope: !401)
!413 = !DILocation(line: 120, column: 13, scope: !401)
!414 = !DILocation(line: 121, column: 23, scope: !401)
!415 = !DILocation(line: 121, column: 13, scope: !401)
!416 = !DILocation(line: 122, column: 23, scope: !401)
!417 = !DILocation(line: 122, column: 13, scope: !401)
!418 = !DILocation(line: 119, column: 20, scope: !401)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "positiveVertex", scope: !401, file: !1, line: 119, type: !16)
!420 = !DILocation(line: 126, column: 17, scope: !421)
!421 = distinct !DILexicalBlock(scope: !401, file: !1, line: 126, column: 17)
!422 = !DILocation(line: 126, column: 45, scope: !421)
!423 = !DILocation(line: 126, column: 49, scope: !421)
!424 = !DILocation(line: 126, column: 17, scope: !401)
!425 = !DILocation(line: 128, column: 17, scope: !426)
!426 = distinct !DILexicalBlock(scope: !421, file: !1, line: 127, column: 13)
!427 = !DILocation(line: 129, column: 13, scope: !426)
!428 = !DILocation(line: 130, column: 9, scope: !401)
!429 = !DILocation(line: 132, column: 9, scope: !314)
!430 = !DILocation(line: 135, column: 13, scope: !313)
!431 = !DILocation(line: 135, column: 32, scope: !313)
!432 = !DILocation(line: 135, column: 13, scope: !314)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "facesAndCorners", scope: !312, file: !1, line: 137, type: !434)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1344, align: 32, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 14)
!437 = !DILocation(line: 137, column: 20, scope: !312)
!438 = !{i32 0, i32 96, i32 14}
!439 = !{i32 32, i32 96, i32 14}
!440 = !{i32 64, i32 96, i32 14}
!441 = !DILocation(line: 138, column: 13, scope: !312)
!442 = !DILocation(line: 158, column: 84, scope: !312)
!443 = !DILocation(line: 158, column: 49, scope: !312)
!444 = !DILocation(line: 158, column: 29, scope: !312)
!445 = !DILocation(line: 158, column: 20, scope: !312)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eyePos", scope: !312, file: !1, line: 158, type: !16)
!447 = !DILocation(line: 160, column: 93, scope: !312)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !312, file: !1, line: 160, type: !449)
!449 = !DICompositeType(tag: DW_TAG_class_type, name: "RayQuery<260>", file: !1, line: 160, size: 32, align: 32, elements: !450, templateParams: !456)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !449, file: !1, line: 160, baseType: !8, size: 32, align: 32)
!452 = !DISubprogram(name: "RayQuery", scope: !449, file: !1, line: 160, type: !453, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!456 = !{!457}
!457 = !DITemplateValueParameter(name: "flags", type: !8, value: i32 260)
!458 = !DILocation(line: 163, column: 32, scope: !312)
!459 = !DILocation(line: 163, column: 45, scope: !312)
!460 = !DILocation(line: 163, column: 18, scope: !312)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isOccluded", scope: !312, file: !1, line: 163, type: !462)
!462 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!463 = !DILocation(line: 165, column: 23, scope: !311)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !311, file: !1, line: 165, type: !39)
!465 = !DILocation(line: 165, column: 40, scope: !310)
!466 = !DILocation(line: 165, column: 53, scope: !310)
!467 = !DILocation(line: 165, column: 50, scope: !310)
!468 = !DILocation(line: 165, column: 13, scope: !311)
!469 = !DILocation(line: 168, column: 34, scope: !309)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelAABB", scope: !309, file: !1, line: 168, type: !154)
!471 = !DILocation(line: 168, column: 22, scope: !309)
!472 = !DILocation(line: 169, column: 52, scope: !309)
!473 = !DILocation(line: 169, column: 69, scope: !309)
!474 = !DILocation(line: 169, column: 24, scope: !309)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbCenter", scope: !309, file: !1, line: 169, type: !16)
!476 = !DILocation(line: 171, column: 27, scope: !308)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !308, file: !1, line: 171, type: !39)
!478 = !DILocation(line: 171, column: 44, scope: !307)
!479 = !DILocation(line: 171, column: 41, scope: !307)
!480 = !DILocation(line: 171, column: 17, scope: !308)
!481 = !DILocation(line: 173, column: 35, scope: !306)
!482 = !DILocation(line: 173, column: 48, scope: !306)
!483 = !DILocation(line: 173, column: 32, scope: !306)
!484 = !DILocation(line: 175, column: 26, scope: !306)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitSomething", scope: !306, file: !1, line: 175, type: !462)
!486 = !DILocation(line: 176, column: 50, scope: !306)
!487 = !DILocation(line: 176, column: 48, scope: !306)
!488 = !DILocation(line: 176, column: 28, scope: !306)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !306, file: !1, line: 176, type: !16)
!490 = !DILocation(line: 177, column: 47, scope: !306)
!491 = !DILocation(line: 177, column: 28, scope: !306)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !306, file: !1, line: 177, type: !16)
!493 = !DILocation(line: 178, column: 38, scope: !306)
!494 = !DILocation(line: 178, column: 27, scope: !306)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distance", scope: !306, file: !1, line: 178, type: !15)
!496 = !DILocation(line: 181, column: 32, scope: !306)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !306, file: !1, line: 180, type: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 180, size: 256, align: 32, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !498, file: !1, line: 180, baseType: !17, size: 96, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !498, file: !1, line: 180, baseType: !15, size: 32, align: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !498, file: !1, line: 180, baseType: !17, size: 96, align: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !498, file: !1, line: 180, baseType: !15, size: 32, align: 32, offset: 224)
!504 = !DILocation(line: 180, column: 29, scope: !306)
!505 = !DILocation(line: 182, column: 47, scope: !306)
!506 = !DILocation(line: 182, column: 35, scope: !306)
!507 = !DILocation(line: 183, column: 30, scope: !306)
!508 = !DILocation(line: 184, column: 30, scope: !306)
!509 = !DILocation(line: 188, column: 28, scope: !306)
!510 = !DILocation(line: 188, column: 21, scope: !306)
!511 = !DILocation(line: 190, column: 29, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 190, column: 29)
!513 = distinct !DILexicalBlock(scope: !306, file: !1, line: 189, column: 21)
!514 = !DILocation(line: 190, column: 47, scope: !512)
!515 = !DILocation(line: 190, column: 29, scope: !513)
!516 = !DILocation(line: 192, column: 29, scope: !517)
!517 = distinct !DILexicalBlock(scope: !512, file: !1, line: 191, column: 25)
!518 = !DILocation(line: 193, column: 42, scope: !517)
!519 = !DILocation(line: 194, column: 29, scope: !517)
!520 = !DILocation(line: 199, column: 26, scope: !521)
!521 = distinct !DILexicalBlock(scope: !306, file: !1, line: 199, column: 25)
!522 = !DILocation(line: 199, column: 25, scope: !306)
!523 = !DILocation(line: 201, column: 36, scope: !524)
!524 = distinct !DILexicalBlock(scope: !521, file: !1, line: 200, column: 21)
!525 = !DILocation(line: 202, column: 38, scope: !524)
!526 = !DILocation(line: 203, column: 21, scope: !524)
!527 = !DILocation(line: 204, column: 17, scope: !306)
!528 = !DILocation(line: 171, column: 57, scope: !307)
!529 = !DILocation(line: 171, column: 36, scope: !307)
!530 = !DILocation(line: 205, column: 13, scope: !309)
!531 = !DILocation(line: 165, column: 66, scope: !310)
!532 = !DILocation(line: 206, column: 9, scope: !312)
!533 = !DILocation(line: 208, column: 9, scope: !314)
!534 = !DILocation(line: 210, column: 13, scope: !535)
!535 = distinct !DILexicalBlock(scope: !314, file: !1, line: 210, column: 13)
!536 = !DILocation(line: 210, column: 26, scope: !535)
!537 = !DILocation(line: 210, column: 13, scope: !314)
!538 = !DILocation(line: 212, column: 29, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !1, line: 212, column: 17)
!540 = distinct !DILexicalBlock(scope: !535, file: !1, line: 211, column: 9)
!541 = !DILocation(line: 212, column: 17, scope: !540)
!542 = !DILocation(line: 214, column: 17, scope: !543)
!543 = distinct !DILexicalBlock(scope: !539, file: !1, line: 213, column: 13)
!544 = !DILocation(line: 215, column: 13, scope: !543)
!545 = !DILocation(line: 217, column: 13, scope: !540)
!546 = !DILocation(line: 219, column: 30, scope: !540)
!547 = !DILocation(line: 219, column: 18, scope: !540)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startAddr", scope: !540, file: !1, line: 219, type: !39)
!549 = !DILocation(line: 221, column: 23, scope: !550)
!550 = distinct !DILexicalBlock(scope: !540, file: !1, line: 221, column: 13)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !550, file: !1, line: 221, type: !39)
!552 = !DILocation(line: 221, column: 40, scope: !553)
!553 = distinct !DILexicalBlock(scope: !550, file: !1, line: 221, column: 13)
!554 = !DILocation(line: 221, column: 13, scope: !550)
!555 = !DILocation(line: 223, column: 84, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !1, line: 222, column: 13)
!557 = !DILocation(line: 223, column: 48, scope: !556)
!558 = !DILocation(line: 223, column: 52, scope: !556)
!559 = !DILocation(line: 223, column: 82, scope: !556)
!560 = !DILocation(line: 224, column: 13, scope: !556)
!561 = !DILocation(line: 221, column: 52, scope: !553)
!562 = !DILocation(line: 229, column: 29, scope: !563)
!563 = distinct !DILexicalBlock(scope: !540, file: !1, line: 229, column: 17)
!564 = !DILocation(line: 229, column: 17, scope: !540)
!565 = !DILocation(line: 231, column: 78, scope: !566)
