#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 81a72d759d79fe6c1685204f93a717bc.pdb
; shader hash: 81a72d759d79fe6c1685204f93a717bc
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           float pad1;                               ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           float pad2;                               ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !40, globals: !92)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransportIndirect_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !17, !10, !26, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 173, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 38, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 38, size: 96, align: 32, elements: !8, templateParams: !13)
!8 = !{!9, !11, !12}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 38, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 38, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 38, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !10)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 3)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 186, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 186, size: 128, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 186, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 186, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 186, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !18, file: !1, line: 186, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!24 = !{!14, !25}
!25 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 294, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 294, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 294, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 294, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!14, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 193, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 193, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 193, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 193, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!39, !32}
!39 = !DITemplateTypeParameter(name: "element", type: !5)
!40 = !{!41, !51, !55, !58, !81, !84, !85, !88}
!41 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 171, type: !42, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !44}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 38, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 38, size: 96, align: 32, elements: !46, templateParams: !50)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !45, file: !1, line: 38, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !45, file: !1, line: 38, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !45, file: !1, line: 38, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!50 = !{!39, !15}
!51 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !52, file: !52, line: 74, type: !53, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!44, !4, !44}
!55 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !52, file: !52, line: 152, type: !56, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!10, !6, !6, !6, !6, !10}
!58 = !DISubprogram(name: "clusterToVoxelIrradiancePerVoxelArrayVoxel", linkageName: "\01?clusterToVoxelIrradiancePerVoxelArrayVoxel@@YA?AV?$vector@M$02@@UClusterData@@IV1@1@Z", scope: !1, file: !1, line: 40, type: !59, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!6, !61, !4, !6, !6}
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !62, line: 181, size: 2688, align: 32, elements: !63)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!63 = !{!64, !65, !68, !70, !71, !72, !73, !74, !75, !76, !77}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !61, file: !62, line: 183, baseType: !44, size: 96, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !61, file: !62, line: 184, baseType: !66, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !67, line: 8, baseType: !4)
!67 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !61, file: !62, line: 186, baseType: !69, size: 96, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !67, line: 4, baseType: !6)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !61, file: !62, line: 187, baseType: !66, size: 32, align: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !61, file: !62, line: 189, baseType: !69, size: 96, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !61, file: !62, line: 190, baseType: !66, size: 32, align: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !61, file: !62, line: 192, baseType: !69, size: 96, align: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !61, file: !62, line: 193, baseType: !66, size: 32, align: 32, offset: 480)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !61, file: !62, line: 195, baseType: !69, size: 96, align: 32, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !61, file: !62, line: 196, baseType: !10, size: 32, align: 32, offset: 608)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !61, file: !62, line: 198, baseType: !78, size: 2048, align: 32, offset: 640)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !52, file: !52, line: 179, type: !82, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !6, !6}
!84 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !52, file: !52, line: 167, type: !82, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubprogram(name: "gatherIrradianceFromNeighbour", linkageName: "\01?gatherIrradianceFromNeighbour@@YA?AV?$vector@M$02@@IV1@@Z", scope: !1, file: !1, line: 137, type: !86, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!6, !4, !6}
!88 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !89, file: !89, line: 125, type: !90, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!90 = !DISubroutineType(types: !91)
!91 = !{!4, !26}
!92 = !{!93, !96, !98, !99, !100, !102, !104, !106, !107, !108, !150, !162, !165, !166, !167, !168, !172, !173, !174, !178, !179, !187, !197, !198, !202, !203, !206, !207, !208, !219, !221, !222, !224, !225, !227, !229, !231}
!93 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !94, line: 86, type: !95, isLocal: true, isDefinition: true)
!94 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!96 = !DIGlobalVariable(name: "PI", scope: !0, file: !94, line: 104, type: !97, isLocal: true, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!98 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !94, line: 105, type: !97, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !94, line: 106, type: !97, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !89, line: 45, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!102 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !89, line: 46, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!104 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !52, line: 15, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!106 = !DIGlobalVariable(name: "cos30", scope: !0, file: !52, line: 16, type: !97, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariable(name: "cos25", scope: !0, file: !52, line: 17, type: !97, isLocal: true, isDefinition: true)
!108 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !109, isLocal: false, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "T", type: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !62, line: 26, size: 1792, align: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !149}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !112, file: !62, line: 28, baseType: !44, size: 96, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !112, file: !62, line: 29, baseType: !10, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !112, file: !62, line: 31, baseType: !69, size: 96, align: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !112, file: !62, line: 32, baseType: !10, size: 32, align: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !112, file: !62, line: 34, baseType: !69, size: 96, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !112, file: !62, line: 35, baseType: !66, size: 32, align: 32, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !112, file: !62, line: 37, baseType: !69, size: 96, align: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !112, file: !62, line: 38, baseType: !10, size: 32, align: 32, offset: 480)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !112, file: !62, line: 40, baseType: !69, size: 96, align: 32, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !112, file: !62, line: 41, baseType: !10, size: 32, align: 32, offset: 608)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !112, file: !62, line: 43, baseType: !69, size: 96, align: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !112, file: !62, line: 44, baseType: !10, size: 32, align: 32, offset: 736)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !112, file: !62, line: 46, baseType: !127, size: 512, align: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !129, templateParams: !146)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !128, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!146 = !{!14, !147, !148}
!147 = !DITemplateValueParameter(name: "row_count", type: !16, value: i32 4)
!148 = !DITemplateValueParameter(name: "col_count", type: !16, value: i32 4)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !112, file: !62, line: 47, baseType: !127, size: 512, align: 32, offset: 1280)
!150 = !DIGlobalVariable(name: "cbIndirectLight", linkageName: "\01?cbIndirectLight@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !152)
!152 = !{!153}
!153 = !DITemplateTypeParameter(name: "T", type: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !62, line: 152, size: 384, align: 32, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !154, file: !62, line: 154, baseType: !69, size: 96, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !154, file: !62, line: 155, baseType: !66, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "LightPosition", scope: !154, file: !62, line: 157, baseType: !69, size: 96, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "LightIntensity", scope: !154, file: !62, line: 158, baseType: !10, size: 32, align: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !154, file: !62, line: 160, baseType: !69, size: 96, align: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !154, file: !62, line: 161, baseType: !10, size: 32, align: 32, offset: 352)
!162 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 6, type: !163, isLocal: false, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !164)
!164 = !{!39}
!165 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !163, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !163, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !163, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 11, type: !169, isLocal: false, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 11, size: 2688, align: 32, elements: !2, templateParams: !170)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "element", type: !61)
!172 = !DIGlobalVariable(name: "gVoxelsInCluster", linkageName: "\01?gVoxelsInCluster@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !163, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !163, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 14, type: !175, isLocal: false, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 14, size: 96, align: 32, elements: !2, templateParams: !176)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "element", type: !7)
!178 = !DIGlobalVariable(name: "gVoxelNormalBuffer", linkageName: "\01?gVoxelNormalBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 15, type: !175, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 17, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 17, size: 192, align: 32, elements: !2, templateParams: !181)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "element", type: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !62, line: 12, size: 192, align: 32, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !183, file: !62, line: 14, baseType: !6, size: 96, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !183, file: !62, line: 15, baseType: !6, size: 96, align: 32, offset: 96)
!187 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 18, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 18, size: 256, align: 32, elements: !2, templateParams: !189)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "element", type: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !62, line: 172, size: 256, align: 32, elements: !192)
!192 = !{!193, !194, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !191, file: !62, line: 174, baseType: !69, size: 96, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !191, file: !62, line: 175, baseType: !66, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !191, file: !62, line: 176, baseType: !69, size: 96, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !191, file: !62, line: 177, baseType: !66, size: 32, align: 32, offset: 224)
!197 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !163, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 22, type: !199, isLocal: false, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 22, size: 64, align: 32, elements: !2, templateParams: !200)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "element", type: !34)
!202 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !163, isLocal: false, isDefinition: true)
!203 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 26, type: !204, isLocal: false, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !205)
!205 = !{!14}
!206 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 27, type: !204, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariable(name: "gLitVoxels", linkageName: "\01?gLitVoxels@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 29, type: !175, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariable(name: "gLitClusters", linkageName: "\01?gLitClusters@@3V?$StructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 30, type: !209, isLocal: false, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 30, size: 128, align: 32, elements: !2, templateParams: !210)
!210 = !{!211}
!211 = !DITemplateTypeParameter(name: "element", type: !212)
!212 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 216, size: 128, align: 32, elements: !213, templateParams: !218)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !212, file: !1, line: 216, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !212, file: !1, line: 216, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !212, file: !1, line: 216, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !212, file: !1, line: 216, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!218 = !{!39, !25}
!219 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 32, type: !220, isLocal: false, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 32, size: 32, align: 32, elements: !2)
!221 = !DIGlobalVariable(name: "gVisibleFaceIndices", linkageName: "\01?gVisibleFaceIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 33, type: !163, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 35, type: !223, isLocal: false, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 35, size: 64, align: 32, elements: !2, templateParams: !200)
!224 = !DIGlobalVariable(name: "gFaceFilteredRadianceBuffer", linkageName: "\01?gFaceFilteredRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 36, type: !223, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !94, line: 86, type: !226, isLocal: false, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !95, size: 32, align: 4, offset: 64)
!227 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !94, line: 86, type: !228, isLocal: false, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !95, size: 32, align: 4)
!229 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !94, line: 86, type: !230, isLocal: false, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !95, size: 32, align: 4, offset: 32)
!231 = !DIGlobalVariable(name: "gsRadiancePerWave", linkageName: "\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim", scope: !0, file: !1, line: 38, type: !232, isLocal: false, isDefinition: true, variable: [6 x float] addrspace(3)* @"\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim")
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, align: 32, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 2)
!235 = !{i32 2, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
