#if 0
;
; Note: shader requires additional functionality:
;       64 UAV slots
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 93abdf01663e354c809397a5c17db17d.pdb
; shader hash: 93abdf01663e354c809397a5c17db17d
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !41, globals: !55)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransportDepth_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !31, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 58, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 58, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 58, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 96, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 96, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 96, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 96, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 96, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !21}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 101, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 101, size: 128, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 101, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 101, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 101, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 101, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 43, baseType: !8)
!41 = !{!42, !45, !49, !54}
!42 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 41, type: !43, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !14}
!45 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !46, file: !46, line: 74, type: !47, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!14, !40, !14}
!49 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !46, file: !46, line: 113, type: !50, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !40, !53}
!52 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 23, size: 32, align: 32, elements: !2)
!54 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !46, file: !46, line: 130, type: !50, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!55 = !{!56, !58, !61, !63, !64, !65, !68, !70, !71, !72, !73, !119, !136, !154, !157, !158, !159, !160, !168, !178, !179, !183, !187, !188, !190, !191, !192, !193, !197, !198, !199, !200, !201, !203, !205}
!56 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !46, line: 15, type: !57, isLocal: true, isDefinition: true, variable: i32 -1)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!58 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !59, line: 87, type: !60, isLocal: true, isDefinition: true)
!59 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!61 = !DIGlobalVariable(name: "PI", scope: !0, file: !59, line: 105, type: !62, isLocal: true, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!63 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !59, line: 106, type: !62, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !59, line: 107, type: !62, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !66, line: 45, type: !67, isLocal: false, isDefinition: true)
!66 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!68 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !66, line: 46, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!70 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !46, line: 15, type: !57, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariable(name: "cos30", scope: !0, file: !46, line: 16, type: !62, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariable(name: "cos25", scope: !0, file: !46, line: 17, type: !62, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 5, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 5, size: 32, align: 32, elements: !2, templateParams: !75)
!75 = !{!76}
!76 = !DITemplateTypeParameter(name: "T", type: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !78, line: 26, size: 1792, align: 32, elements: !79)
!78 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!79 = !{!80, !81, !82, !85, !86, !87, !89, !90, !91, !92, !93, !94, !95, !118}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !77, file: !78, line: 28, baseType: !14, size: 96, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !77, file: !78, line: 29, baseType: !26, size: 32, align: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !77, file: !78, line: 31, baseType: !83, size: 96, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !84, line: 4, baseType: !22)
!84 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !77, file: !78, line: 32, baseType: !26, size: 32, align: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !77, file: !78, line: 34, baseType: !83, size: 96, align: 32, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !77, file: !78, line: 35, baseType: !88, size: 32, align: 32, offset: 352)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !84, line: 8, baseType: !40)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !77, file: !78, line: 37, baseType: !83, size: 96, align: 32, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !77, file: !78, line: 38, baseType: !88, size: 32, align: 32, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !77, file: !78, line: 40, baseType: !83, size: 96, align: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !77, file: !78, line: 41, baseType: !88, size: 32, align: 32, offset: 608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !77, file: !78, line: 43, baseType: !83, size: 96, align: 32, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !77, file: !78, line: 44, baseType: !26, size: 32, align: 32, offset: 736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !77, file: !78, line: 46, baseType: !96, size: 512, align: 32, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !98, templateParams: !115)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !97, file: !1, line: 5, baseType: !26, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!115 = !{!30, !116, !117}
!116 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!117 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !77, file: !78, line: 47, baseType: !96, size: 512, align: 32, offset: 1280)
!119 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 6, type: !120, isLocal: false, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "T", type: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !78, line: 139, size: 1024, align: 32, elements: !124)
!124 = !{!125, !130, !131, !132, !133, !134, !135}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !123, file: !78, line: 141, baseType: !126, size: 768, align: 32)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 768, align: 32, elements: !128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !84, line: 5, baseType: !31)
!128 = !{!129}
!129 = !DISubrange(count: 6)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !123, file: !78, line: 143, baseType: !83, size: 96, align: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !123, file: !78, line: 144, baseType: !88, size: 32, align: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !123, file: !78, line: 146, baseType: !88, size: 32, align: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !123, file: !78, line: 147, baseType: !88, size: 32, align: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !123, file: !78, line: 148, baseType: !88, size: 32, align: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ResetRadianceBuffers", scope: !123, file: !78, line: 149, baseType: !88, size: 32, align: 32, offset: 992)
!136 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@ULight@@@@A", scope: !0, file: !1, line: 7, type: !137, isLocal: false, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Light>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !138)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !59, line: 3, size: 1536, align: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !140, file: !59, line: 5, baseType: !22, size: 96, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !140, file: !59, line: 6, baseType: !26, size: 32, align: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !140, file: !59, line: 7, baseType: !22, size: 96, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !140, file: !59, line: 8, baseType: !26, size: 32, align: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !140, file: !59, line: 9, baseType: !22, size: 96, align: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !140, file: !59, line: 10, baseType: !26, size: 32, align: 32, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !140, file: !59, line: 11, baseType: !96, size: 512, align: 32, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !140, file: !59, line: 12, baseType: !96, size: 512, align: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !140, file: !59, line: 13, baseType: !13, size: 32, align: 32, offset: 1408)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !140, file: !59, line: 14, baseType: !26, size: 32, align: 32, offset: 1440)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !140, file: !59, line: 15, baseType: !26, size: 32, align: 32, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !140, file: !59, line: 16, baseType: !26, size: 32, align: 32, offset: 1504)
!154 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 9, size: 32, align: 32, elements: !2, templateParams: !156)
!156 = !{!11}
!157 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !155, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !155, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !155, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 14, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 14, size: 192, align: 32, elements: !2, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "element", type: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !78, line: 12, size: 192, align: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !164, file: !78, line: 14, baseType: !22, size: 96, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !164, file: !78, line: 15, baseType: !22, size: 96, align: 32, offset: 96)
!168 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 15, type: !169, isLocal: false, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 15, size: 256, align: 32, elements: !2, templateParams: !170)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "element", type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !78, line: 177, size: 256, align: 32, elements: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !172, file: !78, line: 179, baseType: !83, size: 96, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !172, file: !78, line: 180, baseType: !88, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !172, file: !78, line: 181, baseType: !83, size: 96, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !172, file: !78, line: 182, baseType: !88, size: 32, align: 32, offset: 224)
!178 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !155, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gCameraDepth", linkageName: "\01?gCameraDepth@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 19, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 19, size: 160, align: 32, elements: !2, templateParams: !181)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "element", type: !32)
!183 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 21, type: !184, isLocal: false, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !185)
!185 = !{!186}
!186 = !DITemplateTypeParameter(name: "element", type: !5)
!187 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 23, type: !53, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !156)
!190 = !DIGlobalVariable(name: "gGaussianVisibleFacesIndices", linkageName: "\01?gGaussianVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !189, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !53, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 27, type: !53, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariable(name: "gGaussianDispatchIndirectBuffer", linkageName: "\01?gGaussianDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 28, type: !194, isLocal: false, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 28, size: 96, align: 32, elements: !2, templateParams: !195)
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "element", type: !15)
!197 = !DIGlobalVariable(name: "gIndirectLightDispatchIndirectBuffer", linkageName: "\01?gIndirectLightDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 29, type: !194, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 33, type: !184, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariable(name: "gGaussianFinalWriteBuffer", linkageName: "\01?gGaussianFinalWriteBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 35, type: !184, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 37, type: !62, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !59, line: 87, type: !202, isLocal: false, isDefinition: true)
!202 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !60, size: 32, align: 4, offset: 64)
!203 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !59, line: 87, type: !204, isLocal: false, isDefinition: true)
!204 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !60, size: 32, align: 4, offset: 32)
!205 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !59, line: 87, type: !206, isLocal: false, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !60, size: 32, align: 4)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
