#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f5c26b2b3bd39dd9418664395d8b0f7e.pdb
; shader hash: f5c26b2b3bd39dd9418664395d8b0f7e
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           float pad1;                               ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           float pad2;                               ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !89)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransportIndirect_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !19, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 42, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 201, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 201, size: 96, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 201, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 201, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 201, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !19)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 202, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 202, size: 128, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 202, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 202, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 202, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !1, line: 202, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 301, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 301, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 301, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 301, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!23, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 196, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 196, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 196, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 196, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!12, !39}
!46 = !{!47, !50, !55, !58, !81, !84, !85}
!47 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 178, type: !48, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !4, !4}
!50 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !51, file: !51, line: 74, type: !52, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!4, !54, !4}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 180, baseType: !8)
!55 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !51, file: !51, line: 152, type: !56, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!19, !15, !15, !15, !15, !19}
!58 = !DISubprogram(name: "clusterToVoxelIrradiancePerVoxelArrayVoxel", linkageName: "\01?clusterToVoxelIrradiancePerVoxelArrayVoxel@@YA?AV?$vector@M$02@@UClusterData@@IV1@1@Z", scope: !1, file: !1, line: 44, type: !59, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!15, !61, !54, !15, !15}
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !62, line: 176, size: 2688, align: 32, elements: !63)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!63 = !{!64, !65, !68, !70, !71, !72, !73, !74, !75, !76, !77}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !61, file: !62, line: 178, baseType: !4, size: 96, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !61, file: !62, line: 179, baseType: !66, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !67, line: 8, baseType: !54)
!67 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !61, file: !62, line: 181, baseType: !69, size: 96, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !67, line: 4, baseType: !15)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !61, file: !62, line: 182, baseType: !66, size: 32, align: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !61, file: !62, line: 184, baseType: !69, size: 96, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !61, file: !62, line: 185, baseType: !66, size: 32, align: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !61, file: !62, line: 187, baseType: !69, size: 96, align: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !61, file: !62, line: 188, baseType: !66, size: 32, align: 32, offset: 480)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !61, file: !62, line: 190, baseType: !69, size: 96, align: 32, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !61, file: !62, line: 191, baseType: !19, size: 32, align: 32, offset: 608)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !61, file: !62, line: 193, baseType: !78, size: 2048, align: 32, offset: 640)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !51, file: !51, line: 179, type: !82, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!19, !15, !15}
!84 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !51, file: !51, line: 167, type: !82, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !86, file: !86, line: 125, type: !87, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!87 = !DISubroutineType(types: !88)
!88 = !{!54, !33}
!89 = !{!90, !91, !94, !96, !97, !98, !100, !102, !104, !105, !106, !148, !158, !161, !162, !163, !164, !168, !169, !170, !174, !175, !179, !180, !188, !198, !199, !200, !201, !204, !205, !206, !217, !219, !220, !222, !223, !225, !227, !229, !231, !233}
!90 = !DIGlobalVariable(name: "gsRadiance", linkageName: "\01?gsRadiance@@3V?$vector@I$02@@A", scope: !0, file: !1, line: 42, type: !4, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !92, line: 86, type: !93, isLocal: true, isDefinition: true)
!92 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!94 = !DIGlobalVariable(name: "PI", scope: !0, file: !92, line: 104, type: !95, isLocal: true, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!96 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !92, line: 105, type: !95, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !92, line: 106, type: !95, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !86, line: 45, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!100 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !86, line: 46, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!102 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !103, isLocal: true, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!104 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !95, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !95, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !62, line: 26, size: 1792, align: 32, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !147}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !110, file: !62, line: 28, baseType: !4, size: 96, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !110, file: !62, line: 29, baseType: !19, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !110, file: !62, line: 31, baseType: !69, size: 96, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !110, file: !62, line: 32, baseType: !19, size: 32, align: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !110, file: !62, line: 34, baseType: !69, size: 96, align: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !110, file: !62, line: 35, baseType: !66, size: 32, align: 32, offset: 352)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !110, file: !62, line: 37, baseType: !69, size: 96, align: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !110, file: !62, line: 38, baseType: !19, size: 32, align: 32, offset: 480)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !110, file: !62, line: 40, baseType: !69, size: 96, align: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !110, file: !62, line: 41, baseType: !19, size: 32, align: 32, offset: 608)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !110, file: !62, line: 43, baseType: !69, size: 96, align: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !110, file: !62, line: 44, baseType: !19, size: 32, align: 32, offset: 736)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !110, file: !62, line: 46, baseType: !125, size: 512, align: 32, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !127, templateParams: !144)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !126, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!144 = !{!23, !145, !146}
!145 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!146 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !110, file: !62, line: 47, baseType: !125, size: 512, align: 32, offset: 1280)
!148 = !DIGlobalVariable(name: "cbIndirectLight", linkageName: "\01?cbIndirectLight@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !149, isLocal: false, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !150)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "T", type: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !62, line: 150, size: 256, align: 32, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !152, file: !62, line: 152, baseType: !69, size: 96, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !152, file: !62, line: 153, baseType: !66, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "LightPosition", scope: !152, file: !62, line: 155, baseType: !69, size: 96, align: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "LightIntensity", scope: !152, file: !62, line: 156, baseType: !19, size: 32, align: 32, offset: 224)
!158 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 6, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !160)
!160 = !{!12}
!161 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !159, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !159, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !159, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 11, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 11, size: 2688, align: 32, elements: !2, templateParams: !166)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "element", type: !61)
!168 = !DIGlobalVariable(name: "gVoxelsInCluster", linkageName: "\01?gVoxelsInCluster@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !159, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !159, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 14, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 14, size: 96, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "element", type: !16)
!174 = !DIGlobalVariable(name: "gVoxelNormalBuffer", linkageName: "\01?gVoxelNormalBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 15, type: !171, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "gVoxelFaceDataBuffer", linkageName: "\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 17, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "element", type: !41)
!179 = !DIGlobalVariable(name: "gVoxelFaceStartCountBuffer", linkageName: "\01?gVoxelFaceStartCountBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 19, type: !176, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 21, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 21, size: 192, align: 32, elements: !2, templateParams: !182)
!182 = !{!183}
!183 = !DITemplateTypeParameter(name: "element", type: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !62, line: 12, size: 192, align: 32, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !184, file: !62, line: 14, baseType: !15, size: 96, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !184, file: !62, line: 15, baseType: !15, size: 96, align: 32, offset: 96)
!188 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 22, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 22, size: 256, align: 32, elements: !2, templateParams: !190)
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "element", type: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !62, line: 167, size: 256, align: 32, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !192, file: !62, line: 169, baseType: !69, size: 96, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !192, file: !62, line: 170, baseType: !66, size: 32, align: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !192, file: !62, line: 171, baseType: !69, size: 96, align: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !192, file: !62, line: 172, baseType: !66, size: 32, align: 32, offset: 224)
!198 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !159, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 26, type: !176, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !159, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 30, type: !202, isLocal: false, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 30, size: 32, align: 32, elements: !2, templateParams: !203)
!203 = !{!23}
!204 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 31, type: !202, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariable(name: "gLitVoxels", linkageName: "\01?gLitVoxels@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 33, type: !171, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariable(name: "gLitClusters", linkageName: "\01?gLitClusters@@3V?$StructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 34, type: !207, isLocal: false, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 34, size: 128, align: 32, elements: !2, templateParams: !208)
!208 = !{!209}
!209 = !DITemplateTypeParameter(name: "element", type: !210)
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 232, size: 128, align: 32, elements: !211, templateParams: !216)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !210, file: !1, line: 232, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !210, file: !1, line: 232, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !210, file: !1, line: 232, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !210, file: !1, line: 232, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!216 = !{!12, !32}
!217 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 36, type: !218, isLocal: false, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 36, size: 32, align: 32, elements: !2)
!219 = !DIGlobalVariable(name: "gVisibleFaceIndices", linkageName: "\01?gVisibleFaceIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 37, type: !159, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 39, type: !221, isLocal: false, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 39, size: 64, align: 32, elements: !2, templateParams: !177)
!222 = !DIGlobalVariable(name: "gFaceFilteredRadianceBuffer", linkageName: "\01?gFaceFilteredRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 40, type: !221, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !92, line: 86, type: !224, isLocal: false, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !93, size: 32, align: 4, offset: 64)
!225 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !92, line: 86, type: !226, isLocal: false, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !93, size: 32, align: 4, offset: 32)
!227 = !DIGlobalVariable(name: "gsRadiance.0", linkageName: "\01?gsRadiance@@3V?$vector@I$02@@A.0", scope: !0, file: !1, line: 42, type: !228, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsRadiance@@3V?$vector@I$02@@A.0")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.0", file: !1, line: 42, baseType: !4, size: 32, align: 4)
!229 = !DIGlobalVariable(name: "gsRadiance.2", linkageName: "\01?gsRadiance@@3V?$vector@I$02@@A.2", scope: !0, file: !1, line: 42, type: !230, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsRadiance@@3V?$vector@I$02@@A.2")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.2", file: !1, line: 42, baseType: !4, size: 32, align: 4, offset: 64)
!231 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !92, line: 86, type: !232, isLocal: false, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !93, size: 32, align: 4)
!233 = !DIGlobalVariable(name: "gsRadiance.1", linkageName: "\01?gsRadiance@@3V?$vector@I$02@@A.1", scope: !0, file: !1, line: 42, type: !234, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsRadiance@@3V?$vector@I$02@@A.1")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.1", file: !1, line: 42, baseType: !4, size: 32, align: 4, offset: 32)
!235 = !{i32 2, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
