#if 0
;
; Note: shader requires additional functionality:
;       64 UAV slots
;       Raytracing tier 1.1 features
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f9dbb7ae4ca5183bf3fd30d552faa3a7.pdb
; shader hash: f9dbb7ae4ca5183bf3fd30d552faa3a7
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !41, globals: !52)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !23, !31, !32}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 79, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 79, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 79, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 79, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 60, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 60, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 60, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 115, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 115, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 115, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 115, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 115, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !21}
!30 = !DITemplateTypeParameter(name: "element", type: !22)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 55, baseType: !8)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 136, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 136, size: 128, align: 32, elements: !34, templateParams: !39)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 136, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 136, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, line: 136, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !33, file: !1, line: 136, baseType: !22, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!39 = !{!30, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!41 = !{!42, !45, !51}
!42 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 63, type: !43, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !14, !14, !14}
!45 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !46, file: !46, line: 113, type: !47, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !31, !50}
!49 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 41, size: 32, align: 32, elements: !2)
!51 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !46, file: !46, line: 130, type: !47, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!52 = !{!53, !54, !55, !56, !57, !59, !61, !62, !63, !66, !67, !68, !69, !72, !74, !75, !76, !77, !123, !140, !158, !161, !162, !163, !164, !172, !182, !183, !185, !189, !190, !192, !193, !197, !198, !199, !200, !201, !202, !204, !206}
!53 = !DIGlobalVariable(name: "gsIsOutsideFrustum", linkageName: "\01?gsIsOutsideFrustum@@3IA", scope: !0, file: !1, line: 55, type: !31, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOutsideFrustum@@3IA")
!54 = !DIGlobalVariable(name: "gsIsOccluded", linkageName: "\01?gsIsOccluded@@3IA", scope: !0, file: !1, line: 56, type: !31, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOccluded@@3IA")
!55 = !DIGlobalVariable(name: "gsMaxFaces", linkageName: "\01?gsMaxFaces@@3IA", scope: !0, file: !1, line: 58, type: !31, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "gsIsAtEdgeOfCamera", linkageName: "\01?gsIsAtEdgeOfCamera@@3IA", scope: !0, file: !1, line: 60, type: !31, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsAtEdgeOfCamera@@3IA")
!57 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !46, line: 15, type: !58, isLocal: true, isDefinition: true, variable: i32 -1)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!59 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 53, type: !60, isLocal: true, isDefinition: true, variable: float 0x3FF6A09E60000000)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!61 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 215, type: !58, isLocal: true, isDefinition: true, variable: i32 0)
!62 = !DIGlobalVariable(name: "CANDIDATE_PROCEDURAL_PRIMITIVE", scope: !0, file: !1, line: 219, type: !58, isLocal: true, isDefinition: true, variable: i32 1)
!63 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !64, line: 87, type: !65, isLocal: true, isDefinition: true)
!64 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!66 = !DIGlobalVariable(name: "PI", scope: !0, file: !64, line: 105, type: !60, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !64, line: 106, type: !60, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !64, line: 107, type: !60, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !70, line: 45, type: !71, isLocal: false, isDefinition: true)
!70 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!72 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !70, line: 46, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!74 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !46, line: 15, type: !58, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariable(name: "cos30", scope: !0, file: !46, line: 16, type: !60, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariable(name: "cos25", scope: !0, file: !46, line: 17, type: !60, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 23, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 23, size: 32, align: 32, elements: !2, templateParams: !79)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "T", type: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !82, line: 26, size: 1792, align: 32, elements: !83)
!82 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!83 = !{!84, !85, !86, !89, !90, !91, !93, !94, !95, !96, !97, !98, !99, !122}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !81, file: !82, line: 28, baseType: !14, size: 96, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !81, file: !82, line: 29, baseType: !22, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !81, file: !82, line: 31, baseType: !87, size: 96, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !88, line: 4, baseType: !23)
!88 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !81, file: !82, line: 32, baseType: !22, size: 32, align: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !81, file: !82, line: 34, baseType: !87, size: 96, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !81, file: !82, line: 35, baseType: !92, size: 32, align: 32, offset: 352)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !88, line: 8, baseType: !31)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !81, file: !82, line: 37, baseType: !87, size: 96, align: 32, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !81, file: !82, line: 38, baseType: !92, size: 32, align: 32, offset: 480)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !81, file: !82, line: 40, baseType: !87, size: 96, align: 32, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !81, file: !82, line: 41, baseType: !92, size: 32, align: 32, offset: 608)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !81, file: !82, line: 43, baseType: !87, size: 96, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !81, file: !82, line: 44, baseType: !22, size: 32, align: 32, offset: 736)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !81, file: !82, line: 46, baseType: !100, size: 512, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !102, templateParams: !119)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !101, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!119 = !{!30, !120, !121}
!120 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!121 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !81, file: !82, line: 47, baseType: !100, size: 512, align: 32, offset: 1280)
!123 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 24, type: !124, isLocal: false, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !125)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "T", type: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !82, line: 139, size: 1024, align: 32, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !139}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !127, file: !82, line: 141, baseType: !130, size: 768, align: 32)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 768, align: 32, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !88, line: 5, baseType: !32)
!132 = !{!133}
!133 = !DISubrange(count: 6)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !127, file: !82, line: 143, baseType: !87, size: 96, align: 32, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !127, file: !82, line: 144, baseType: !92, size: 32, align: 32, offset: 864)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !127, file: !82, line: 146, baseType: !92, size: 32, align: 32, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !127, file: !82, line: 147, baseType: !92, size: 32, align: 32, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !127, file: !82, line: 148, baseType: !92, size: 32, align: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ResetRadianceBuffers", scope: !127, file: !82, line: 149, baseType: !92, size: 32, align: 32, offset: 992)
!140 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@UConstantBufferCamera@@@@A", scope: !0, file: !1, line: 25, type: !141, isLocal: false, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferCamera>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !142)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "T", type: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferCamera", file: !1, line: 4, size: 3328, align: 32, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !144, file: !1, line: 6, baseType: !100, size: 512, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "invView", scope: !144, file: !1, line: 7, baseType: !100, size: 512, align: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !144, file: !1, line: 8, baseType: !100, size: 512, align: 32, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "invProjection", scope: !144, file: !1, line: 9, baseType: !100, size: 512, align: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjection", scope: !144, file: !1, line: 10, baseType: !100, size: 512, align: 32, offset: 2048)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjection", scope: !144, file: !1, line: 11, baseType: !100, size: 512, align: 32, offset: 2560)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "eyePosition", scope: !144, file: !1, line: 14, baseType: !87, size: 96, align: 32, offset: 3072)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nearPlane", scope: !144, file: !1, line: 15, baseType: !22, size: 32, align: 32, offset: 3168)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "farPlane", scope: !144, file: !1, line: 17, baseType: !22, size: 32, align: 32, offset: 3200)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !144, file: !1, line: 18, baseType: !22, size: 32, align: 32, offset: 3232)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !144, file: !1, line: 19, baseType: !22, size: 32, align: 32, offset: 3264)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !144, file: !1, line: 20, baseType: !22, size: 32, align: 32, offset: 3296)
!158 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !160)
!160 = !{!11}
!161 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !159, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 29, type: !159, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !159, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 32, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 32, size: 192, align: 32, elements: !2, templateParams: !166)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "element", type: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !82, line: 12, size: 192, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !168, file: !82, line: 14, baseType: !23, size: 96, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !168, file: !82, line: 15, baseType: !23, size: 96, align: 32, offset: 96)
!172 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 33, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 33, size: 256, align: 32, elements: !2, templateParams: !174)
!174 = !{!175}
!175 = !DITemplateTypeParameter(name: "element", type: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !82, line: 177, size: 256, align: 32, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !176, file: !82, line: 179, baseType: !87, size: 96, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !176, file: !82, line: 180, baseType: !92, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !176, file: !82, line: 181, baseType: !87, size: 96, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !176, file: !82, line: 182, baseType: !92, size: 32, align: 32, offset: 224)
!182 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !159, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 37, type: !184, isLocal: false, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 37, size: 32, align: 32, elements: !2)
!185 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 39, type: !186, isLocal: false, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 39, size: 64, align: 32, elements: !2, templateParams: !187)
!187 = !{!188}
!188 = !DITemplateTypeParameter(name: "element", type: !5)
!189 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 41, type: !50, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 42, type: !191, isLocal: false, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 42, size: 32, align: 32, elements: !2, templateParams: !160)
!192 = !DIGlobalVariable(name: "gGaussianVisibleFacesIndices", linkageName: "\01?gGaussianVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 43, type: !191, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariable(name: "gDispatchIndirectBuffer", linkageName: "\01?gDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 44, type: !194, isLocal: false, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 44, size: 96, align: 32, elements: !2, templateParams: !195)
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "element", type: !15)
!197 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 45, type: !50, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 46, type: !50, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 49, type: !186, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariable(name: "gGaussianFinalWriteBuffer", linkageName: "\01?gGaussianFinalWriteBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 51, type: !186, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 53, type: !60, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !64, line: 87, type: !203, isLocal: false, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !65, size: 32, align: 4, offset: 32)
!204 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !64, line: 87, type: !205, isLocal: false, isDefinition: true)
!205 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !65, size: 32, align: 4, offset: 64)
!206 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !64, line: 87, type: !207, isLocal: false, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !65, size: 32, align: 4)
!208 = !{i32 2, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!211 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0Astruct ConstantBufferCamera\0D\0A{\0D\0A    XMFLOAT4X4 view;\0D\0A\09XMFLOAT4X4 invView;\0D\0A\09XMFLOAT4X4 projection;\0D\0A\09XMFLOAT4X4 invProjection;\0D\0A\09XMFLOAT4X4 viewProjection;\0D\0A\09XMFLOAT4X4 invViewProjection;\0D\0A    \0D\0A    // Use by shadow cameras only.\0D\0A    XMFLOAT3 eyePosition;\0D\0A    float nearPlane;\0D\0A\0D\0A    float farPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferFrustumCulling> cbFrustumCulling : register(b1);\0D\0AConstantBuffer<ConstantBufferCamera> cbCamera : register(b2);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space0);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space0);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space0);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space0);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space1);\0D\0AStructuredBuffer<ClusterAABBInfo> gClusterAABBInfoBuffer : register(t1, space1);\0D\0A// Map from aabbVoxelIndices to gVoxelIndicesCompactBuffer.\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space1);\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space2);\0D\0A\0D\0ARWStructuredBuffer<uint2> gFaceRadianceBuffer : register(u0);\0D\0A\0D\0ARWByteAddressBuffer gVisibleFacesCounter : register(u0, space1);\0D\0ARWStructuredBuffer<uint> gIndirectLightVisibleFacesIndices : register(u1, space1);\0D\0ARWStructuredBuffer<uint> gGaussianVisibleFacesIndices : register(u2, space1);\0D\0ARWStructuredBuffer<uint3> gDispatchIndirectBuffer : register(u3, space1);\0D\0ARWByteAddressBuffer gIndirectLightUpdatedVoxelsBitmap : register(u4, space1);\0D\0ARWByteAddressBuffer gGaussianUpdatedVoxelsBitmap : register(u5, space1);\0D\0A\0D\0A\0D\0ARWStructuredBuffer<uint2> gGaussianFirstFilterBuffer : register(u0, space2);\0D\0A\0D\0ARWStructuredBuffer<uint2> gGaussianFinalWriteBuffer : register(u0, space3);\0D\0A\0D\0Astatic const float SQRT_2 = 1.41421356237f;\0D\0A\0D\0Agroupshared uint gsIsOutsideFrustum;\0D\0Agroupshared uint gsIsOccluded;\0D\0A\0D\0Agroupshared uint gsMaxFaces;\0D\0A\0D\0Agroupshared uint gsIsAtEdgeOfCamera;\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS(uint3 DTid : SV_DispatchThreadID, uint3 groupId : SV_GroupID, uint3 threadIdx : SV_GroupThreadID)\0D\0A{\0D\0A    uint threadLinearIndex = DTid.x;\0D\0A    \0D\0A    if (cbFrustumCulling.CurrentStep == 0)\0D\0A    {\0D\0A        \0D\0A        if (threadLinearIndex >= cbFrustumCulling.FaceCount)\0D\0A            return;\0D\0A\0D\0A        if (cbFrustumCulling.ResetRadianceBuffers == 1)\0D\0A        {\0D\0A\0D\0A            if (threadLinearIndex >= cbFrustumCulling.FaceCount)\0D\0A                return;\0D\0A        \0D\0A            gFaceRadianceBuffer[threadLinearIndex] = uint2(0, 0);\0D\0A            gGaussianFinalWriteBuffer[threadLinearIndex] = uint2(0, 0);\0D\0A            gGaussianFirstFilterBuffer[threadLinearIndex] = uint2(0, 0);\0D\0A        }\0D\0A        \0D\0A        gIndirectLightVisibleFacesIndices[threadLinearIndex] = UINT_MAX;\0D\0A        gGaussianVisibleFacesIndices[threadLinearIndex] = UINT_MAX;\0D\0A        \0D\0A        if (threadLinearIndex >= cbFrustumCulling.VoxelCount)\0D\0A            return;\0D\0A        \0D\0A        if (cbFrustumCulling.ResetRadianceBuffers == 1)\0D\0A        {\0D\0A            uint idx = threadLinearIndex >> 5u;\0D\0A            idx = idx * 4;\0D\0A            gIndirectLightUpdatedVoxelsBitmap.Store(idx, 0);\0D\0A            gGaussianUpdatedVoxelsBitmap.Store(idx, 0);\0D\0A        }\0D\0A        \0D\0A        if (threadLinearIndex == 0)\0D\0A        {\0D\0A            gVisibleFacesCounter.Store(0, 0);\0D\0A            gVisibleFacesCounter.Store(4, 0);\0D\0A            \0D\0A            gDispatchIndirectBuffer[0] = uint3(0, 1, 1);\0D\0A            gDispatchIndirectBuffer[1] = uint3(0, 1, 1);\0D\0A        }\0D\0A\0D\0A    }\0D\0A    else if (cbFrustumCulling.CurrentStep == 1)\0D\0A    {\0D\0A        if (groupId.x >= cbFrustumCulling.AABBGroupCount)\0D\0A            return;\0D\0A        \0D\0A\0D\0A        \0D\0A        ClusterAABBInfo aabbInfo = gClusterAABBInfoBuffer[groupId.x];\0D\0A        uint aabbsPerThread = ceil((float) aabbInfo.ClusterElementCount / 128.0f);\0D\0A        uint aabbStart = aabbInfo.ClusterStartIndex + threadIdx.x * aabbsPerThread;\0D\0A        uint aabbEnd = min(aabbStart + aabbsPerThread, aabbInfo.ClusterStartIndex + aabbInfo.ClusterElementCount);\0D\0A        \0D\0A        float margin = 20.0f;\0D\0A\0D\0A        if (threadIdx.x == 0)\0D\0A        {\0D\0A            gsIsOutsideFrustum = 0;\0D\0A            gsIsOccluded = 1;\0D\0A            gsMaxFaces = 0;\0D\0A            gsIsAtEdgeOfCamera = 0;\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        if (threadIdx.x < 6)\0D\0A        {\0D\0A\0D\0A            // Get the normal and distance (D) from the plane\0D\0A            float4 frustumPlane = cbFrustumCulling.FrustumPlanes[threadIdx.x];\0D\0A        \0D\0A            float3 normal = frustumPlane.xyz;\0D\0A            float d = frustumPlane.w;\0D\0A            \0D\0A            float3 aabbMin = aabbInfo.Min;\0D\0A            float3 aabbMax = aabbInfo.Max;\0D\0A        \0D\0A            // Compute the positive vertex of the AABB for this plane\0D\0A            float3 positiveVertex = float3(\0D\0A            (normal.x > 0) ? aabbMax.x : aabbMin.x,\0D\0A            (normal.y > 0) ? aabbMax.y : aabbMin.y,\0D\0A            (normal.z > 0) ? aabbMax.z : aabbMin.z);\0D\0A        \0D\0A            float aabbDistance = dot(normal, positiveVertex) + d;\0D\0A            \0D\0A            // If the positive vertex is outside the plane, the AABB is outside the frustum\0D\0A            if (aabbDistance + margin < 0)\0D\0A            {\0D\0A                InterlockedOr(gsIsOutsideFrustum, 1);\0D\0A            }\0D\0A            \0D\0A            InterlockedOr(gsIsAtEdgeOfCamera, (uint) (aabbDistance < 0));\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        float3 eyePos = mul(float4(cbCamera.eyePosition, 1.0f), cbVoxelCommons.WorldToVoxel).xyz;\0D\0A        \0D\0A        \0D\0A        \0D\0A        if (gsIsOutsideFrustum == 0)\0D\0A        {\0D\0A            float3 facesAndCorners[14] =\0D\0A            {\0D\0A                // 4 edge midpoints\0D\0A                float3(0.0f, 0.0f, -2.0f),\0D\0A                float3(0.0f, 0.0f, 2.0f),\0D\0A                float3(0.0f, -2.0f, 0.0f),\0D\0A                float3(0.0f, 2.0f, 0.0f),\0D\0A                float3(-2.0f, 0.0f, 0.0f),\0D\0A                float3(2.0f, 0.0f, 0.0f),\0D\0A                \0D\0A                float3(-SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, SQRT_2)\0D\0A            };\0D\0A\0D\0A            RayQuery < RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH | RAY_FLAG_SKIP_TRIANGLES > q;\0D\0A            \0D\0A\0D\0A            bool isOccluded = (gsIsOccluded == 1);\0D\0A            \0D\0A            for (uint v = aabbStart; v < aabbEnd && isOccluded; v++)\0D\0A            {\0D\0A\0D\0A                AABB voxelAABB = gVoxelAABBBuffer[v];\0D\0A                float3 aabbCenter = (voxelAABB.Min + voxelAABB.Max) * 0.5f;\0D\0A                \0D\0A                for (uint f = 0; f < 14 && isOccluded; f++)\0D\0A                {\0D\0A                    isOccluded = (gsIsOccluded == 1);\0D\0A\0D\0A                    bool hitSomething = false;\0D\0A                    float3 origin = aabbCenter + facesAndCorners[f];\0D\0A                    float3 direction = eyePos - origin;\0D\0A                    float distance = length(direction);\0D\0A                \0D\0A                    RayDesc ray;\0D\0A                    ray.Origin = origin;\0D\0A                    ray.Direction = direction / distance;\0D\0A                    ray.TMin = 0.1f;\0D\0A                    ray.TMax = distance;\0D\0A                \0D\0A                    q.TraceRayInline(Scene, RAY_FLAG_NONE, ~0, ray);\0D\0A                    \0D\0A                    while (q.Proceed())\0D\0A                    {\0D\0A                        if (q.CandidateType() == CANDIDATE_PROCEDURAL_PRIMITIVE)\0D\0A                        {\0D\0A                            q.CommitProceduralPrimitiveHit(1.0f);\0D\0A                            hitSomething = true;\0D\0A                            break;\0D\0A                        }\0D\0A                        \0D\0A                    }\0D\0A                    \0D\0A                    if (!hitSomething)\0D\0A                    {\0D\0A                        isOccluded = false;\0D\0A                        gsIsOccluded = 0;\0D\0A                    }\0D\0A                }\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A            \0D\0A        if (gsIsOccluded == 0 && (aabbEnd > aabbStart))\0D\0A        {\0D\0A            uint nIndirectLightFaces = 0;\0D\0A            uint nGaussianFaces = 0;\0D\0A            \0D\0A            uint indirectLightStartAddress = 0;\0D\0A            uint gaussianStartAddress = 0;\0D\0A            \0D\0A            for (uint i = aabbStart; i < aabbEnd; i++)\0D\0A            {\0D\0A                uint voxIdx = gAABBVoxelIndices[i];\0D\0A\0D\0A                if (!IsVoxelPresent(voxIdx, gGaussianUpdatedVoxelsBitmap))\0D\0A                {\0D\0A                    nGaussianFaces += 6;\0D\0A                }\0D\0A                if (!IsVoxelPresent(voxIdx, gIndirectLightUpdatedVoxelsBitmap))\0D\0A                {\0D\0A                    nIndirectLightFaces += 6;\0D\0A                }\0D\0A            }\0D\0A\0D\0A            gVisibleFacesCounter.InterlockedAdd(0, nIndirectLightFaces, indirectLightStartAddress);\0D\0A            gVisibleFacesCounter.InterlockedAdd(4, nGaussianFaces, gaussianStartAddress);\0D\0A\0D\0A            uint nIndirectLightVoxelAdded = 0;\0D\0A            uint nGaussianVoxelAdded = 0;\0D\0A            \0D\0A            for (i = aabbStart; i < aabbEnd; i++)\0D\0A            {\0D\0A                uint voxIdx = gAABBVoxelIndices[i];\0D\0A\0D\0A                bool wasSet = SetVoxelPresence(voxIdx, gIndirectLightUpdatedVoxelsBitmap);\0D\0A                if (!wasSet)\0D\0A                {\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 0] = voxIdx * 6 + 0;\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 1] = voxIdx * 6 + 1;\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 2] = voxIdx * 6 + 2;\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 3] = voxIdx * 6 + 3;\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 4] = voxIdx * 6 + 4;\0D\0A                    gIndirectLightVisibleFacesIndices[indirectLightStartAddress + nIndirectLightVoxelAdded * 6 + 5] = voxIdx * 6 + 5;\0D\0A                    \0D\0A                    nIndirectLightVoxelAdded++;\0D\0A                }\0D\0A                \0D\0A                wasSet = false;\0D\0A                if (gsIsAtEdgeOfCamera == 0)\0D\0A                {\0D\0A                    wasSet = SetVoxelPresence(voxIdx, gGaussianUpdatedVoxelsBitmap);\0D\0A                }\0D\0A                \0D\0A                if (!wasSet)\0D\0A                {\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 0] = voxIdx * 6 + 0;\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 1] = voxIdx * 6 + 1;\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 2] = voxIdx * 6 + 2;\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 3] = voxIdx * 6 + 3;\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 4] = voxIdx * 6 + 4;\0D\0A                    gGaussianVisibleFacesIndices[gaussianStartAddress + nGaussianVoxelAdded * 6 + 5] = voxIdx * 6 + 5;\0D\0A                    \0D\0A                    nGaussianVoxelAdded++;\0D\0A                }\0D\0A                \0D\0A            }\0D\0A\0D\0A            uint buffer0Max = (uint) ceil((indirectLightStartAddress + nIndirectLightFaces) / 16.0f);\0D\0A            uint buffer1Max = (uint) ceil((gaussianStartAddress + nGaussianFaces) / (128.0f * 16.0f));\0D\0A            InterlockedMax(gDispatchIndirectBuffer[0].x, buffer0Max);\0D\0A            InterlockedMax(gDispatchIndirectBuffer[1].x, buffer1Max);\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A"}
!212 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    uint UseRTGI;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}\0D\0A\0D\0Afloat2 UnpackFloats16(uint packedUint)\0D\0A{\0D\0A    uint packedX = packedUint.x & 0xFFFF;\0D\0A    uint packedY = ((packedUint.x >> 16) & 0xFFFF);\0D\0A    \0D\0A    return float2(f16tof32(packedX), f16tof32(packedY));\0D\0A}\0D\0A\0D\0Auint PackFloats16(float2 floatsToPack)\0D\0A{\0D\0A    uint radX16 = f32tof16(floatsToPack.x);\0D\0A    uint radY16 = f32tof16(floatsToPack.y);\0D\0A        \0D\0A    uint packedRadX = (radY16 << 16) | radX16;\0D\0A    \0D\0A    return packedRadX;\0D\0A}\0D\0A"}
!213 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    float4x4 invShadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A"}
!214 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!215 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!216 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09UINT ClusterCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT ClusterCount;\0D\0A\09UINT FrameCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFacePenalty\0D\0A{\0D\0A\09UINT FaceCount;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\09UINT ResetRadianceBuffers;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 LightPosition;\0D\0A\09float LightIntensity;\0D\0A\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT DispatchNumber;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClearBuffers\0D\0A{\0D\0A\09UINT ValueCount0;\0D\0A\09UINT ValueCount1;\0D\0A\09UINT ValueCount2;\0D\0A\09UINT ValueCount3;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLitVoxels\0D\0A{\0D\0A\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLerpRadiance\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09float accumulatedTime;\0D\0A\09float maxTime;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A\09XMUINT3 Center;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 Normal;\0D\0A\09UINT FirstDataIndex;\0D\0A\0D\0A\09XMFLOAT3 Color;\0D\0A\09UINT FragmentCount;\0D\0A\0D\0A\09XMFLOAT3 MinAABB;\0D\0A\09UINT NeighbourCount;\0D\0A\0D\0A\09XMFLOAT3 MaxAABB;\0D\0A\09float pad0;\0D\0A\0D\0A\09UINT ClusterNeighbours[64];\0D\0A};\0D\0A\0D\0Astruct ConstantBufferComputeNeighbour\0D\0A{\0D\0A\09UINT ClusterCount;\0D\0A\09UINT ElementsPerThread;\0D\0A\09UINT TotalComputationCount;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferGaussianFilter\0D\0A{\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT BlockNum;\0D\0A\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT KernelSize;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!217 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0A#define IRRADIANCE_FIELD_MULTIPLIER 100000.0f\0D\0A#define MAX_DISTANCE_VOXEL_OFFSET 2.5f\0D\0A#define MINIMUM_ANGLE_VOXEL_OFFSET 0.342f\0D\0A\0D\0A#define CLUSTER_TO_VOXEL_FORM_FACTOR_ADD 14860\0D\0A#define VOXEL_TO_VOXEL_FORM_FACTOR_ADD 3\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A        return false;\0D\0A    \0D\0A    uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A    return all(result < gridDimension);\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 positionDA, float3 normalDB, float3 positionDB, float nSamples)\0D\0A{\0D\0A    float3 dAtoDiskDirection = positionDB - positionDA;\0D\0A    float distanceSq = dot(dAtoDiskDirection, dAtoDiskDirection);\0D\0A    dAtoDiskDirection = normalize(dAtoDiskDirection);\0D\0A    \0D\0A    float cosTheta1 = dot(normalDA, dAtoDiskDirection);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A    \0D\0A    float cosTheta2 = dot(normalDB, -dAtoDiskDirection);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    return (cosTheta1 * cosTheta2) / (PI * distanceSq + nSamples);\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 normalDB)\0D\0A{\0D\0A    float cosTheta1 = dot(normalDA, -normalDB);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A\0D\0A    float cosTheta2 = dot(normalDB, normalDB);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    // Avoid using distanceSq for directional lights as it is theoretically infinite\0D\0A    return (cosTheta1 * cosTheta2) / (PI * 1.0f);\0D\0A}\0D\0A\0D\0Afloat distanceSq(float3 a, float3 b)\0D\0A{\0D\0A    return dot(a - b, a - b);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!218 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl"}
!219 = !{!"-E", !"CS", !"-T", !"cs_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CData\5CShadersLightTransport_CS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!220 = !{i32 1, i32 5}
!221 = !{i32 1, i32 6}
!222 = !{!"cs", i32 6, i32 5}
!223 = !{!224, !233, !245, null}
!224 = !{!225, !227, !229, !231}
!225 = !{i32 0, %"class.StructuredBuffer<AABB>"* undef, !"gVoxelAABBBuffer", i32 1, i32 0, i32 1, i32 12, i32 0, !226}
!226 = !{i32 1, i32 24}
!227 = !{i32 1, %"class.StructuredBuffer<ClusterAABBInfo>"* undef, !"gClusterAABBInfoBuffer", i32 1, i32 1, i32 1, i32 12, i32 0, !228}
!228 = !{i32 1, i32 32}
!229 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* undef, !"gAABBVoxelIndices", i32 1, i32 2, i32 1, i32 12, i32 0, !230}
!230 = !{i32 1, i32 4}
!231 = !{i32 3, %struct.RaytracingAccelerationStructure* undef, !"Scene", i32 2, i32 0, i32 1, i32 16, i32 0, !232}
!232 = !{i32 0, i32 4}
!233 = !{!234, !236, !237, !238, !239, !241, !242, !243, !244}
!234 = !{i32 0, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* undef, !"gFaceRadianceBuffer", i32 0, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !235}
!235 = !{i32 1, i32 8}
!236 = !{i32 1, %struct.RWByteAddressBuffer* undef, !"gVisibleFacesCounter", i32 1, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!237 = !{i32 2, %"class.RWStructuredBuffer<unsigned int>"* undef, !"gIndirectLightVisibleFacesIndices", i32 1, i32 1, i32 1, i32 12, i1 false, i1 false, i1 false, !230}
!238 = !{i32 3, %"class.RWStructuredBuffer<unsigned int>"* undef, !"gGaussianVisibleFacesIndices", i32 1, i32 2, i32 1, i32 12, i1 false, i1 false, i1 false, !230}
!239 = !{i32 4, %"class.RWStructuredBuffer<vector<unsigned int, 3> >"* undef, !"gDispatchIndirectBuffer", i32 1, i32 3, i32 1, i32 12, i1 false, i1 false, i1 false, !240}
!240 = !{i32 1, i32 12}
!241 = !{i32 5, %struct.RWByteAddressBuffer* undef, !"gIndirectLightUpdatedVoxelsBitmap", i32 1, i32 4, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!242 = !{i32 6, %struct.RWByteAddressBuffer* undef, !"gGaussianUpdatedVoxelsBitmap", i32 1, i32 5, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!243 = !{i32 7, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* undef, !"gGaussianFirstFilterBuffer", i32 2, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !235}
!244 = !{i32 8, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* undef, !"gGaussianFinalWriteBuffer", i32 3, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !235}
!245 = !{!246, !247, !248}
!246 = !{i32 0, %hostlayout.cbVoxelCommons* undef, !"cbVoxelCommons", i32 0, i32 0, i32 1, i32 224, null}
!247 = !{i32 1, %cbFrustumCulling* undef, !"cbFrustumCulling", i32 0, i32 1, i32 1, i32 128, null}
!248 = !{i32 2, %hostlayout.cbCamera* undef, !"cbCamera", i32 0, i32 2, i32 1, i32 416, null}
!249 = !{i32 0, %struct.ConstantBufferFrustumCulling undef, !250, %"class.StructuredBuffer<unsigned int>" undef, !258, %"class.StructuredBuffer<AABB>" undef, !263, %struct.AABB undef, !268, %"class.StructuredBuffer<ClusterAABBInfo>" undef, !271, %struct.ClusterAABBInfo undef, !275, %"class.RWStructuredBuffer<vector<unsigned int, 2> >" undef, !278, %"class.RWStructuredBuffer<unsigned int>" undef, !258, %"class.RWStructuredBuffer<vector<unsigned int, 3> >" undef, !282, %cbFrustumCulling undef, !286, %hostlayout.struct.ConstantBufferVoxelCommons undef, !288, %hostlayout.cbVoxelCommons undef, !304, %hostlayout.struct.ConstantBufferCamera undef, !306, %hostlayout.cbCamera undef, !319}
!250 = !{i32 128, !251, !252, !253, !254, !255, !256, !257}
!251 = !{i32 6, !"FrustumPlanes", i32 3, i32 0, i32 7, i32 9}
!252 = !{i32 6, !"CameraPosition", i32 3, i32 96, i32 7, i32 9}
!253 = !{i32 6, !"AABBGroupCount", i32 3, i32 108, i32 7, i32 5}
!254 = !{i32 6, !"CurrentStep", i32 3, i32 112, i32 7, i32 5}
!255 = !{i32 6, !"VoxelCount", i32 3, i32 116, i32 7, i32 5}
!256 = !{i32 6, !"FaceCount", i32 3, i32 120, i32 7, i32 5}
!257 = !{i32 6, !"ResetRadianceBuffers", i32 3, i32 124, i32 7, i32 5}
!258 = !{i32 4, !259, !260}
!259 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!260 = !{i32 0, !261}
!261 = !{!262}
!262 = !{i32 0, i32 undef}
!263 = !{i32 28, !264, !265}
!264 = !{i32 6, !"h", i32 3, i32 0}
!265 = !{i32 0, !266}
!266 = !{!267}
!267 = !{i32 0, %struct.AABB undef}
!268 = !{i32 28, !269, !270}
!269 = !{i32 6, !"Min", i32 3, i32 0, i32 7, i32 9}
!270 = !{i32 6, !"Max", i32 3, i32 16, i32 7, i32 9}
!271 = !{i32 32, !264, !272}
!272 = !{i32 0, !273}
!273 = !{!274}
!274 = !{i32 0, %struct.ClusterAABBInfo undef}
!275 = !{i32 32, !269, !276, !270, !277}
!276 = !{i32 6, !"ClusterStartIndex", i32 3, i32 12, i32 7, i32 5}
!277 = !{i32 6, !"ClusterElementCount", i32 3, i32 28, i32 7, i32 5}
!278 = !{i32 8, !259, !279}
!279 = !{i32 0, !280}
!280 = !{!281}
!281 = !{i32 0, <2 x i32> undef}
!282 = !{i32 12, !259, !283}
!283 = !{i32 0, !284}
!284 = !{!285}
!285 = !{i32 0, <3 x i32> undef}
!286 = !{i32 128, !287}
!287 = !{i32 6, !"cbFrustumCulling", i32 3, i32 0}
!288 = !{i32 224, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !303}
!289 = !{i32 6, !"voxelTextureDimensions", i32 3, i32 0, i32 7, i32 5}
!290 = !{i32 6, !"totalTime", i32 3, i32 12, i32 7, i32 9}
!291 = !{i32 6, !"voxelCellSize", i32 3, i32 16, i32 7, i32 9}
!292 = !{i32 6, !"deltaTime", i32 3, i32 28, i32 7, i32 9}
!293 = !{i32 6, !"invVoxelTextureDimensions", i32 3, i32 32, i32 7, i32 9}
!294 = !{i32 6, !"StoreData", i32 3, i32 44, i32 7, i32 5}
!295 = !{i32 6, !"invVoxelCellSize", i32 3, i32 48, i32 7, i32 9}
!296 = !{i32 6, !"VoxelCount", i32 3, i32 60, i32 7, i32 5}
!297 = !{i32 6, !"SceneAABBMin", i32 3, i32 64, i32 7, i32 9}
!298 = !{i32 6, !"ClusterCount", i32 3, i32 76, i32 7, i32 5}
!299 = !{i32 6, !"SceneAABBMax", i32 3, i32 80, i32 7, i32 9}
!300 = !{i32 6, !"pad3", i32 3, i32 92, i32 7, i32 9}
!301 = !{i32 6, !"VoxelToWorld", i32 2, !302, i32 3, i32 96, i32 7, i32 9}
!302 = !{i32 4, i32 4, i32 2}
!303 = !{i32 6, !"WorldToVoxel", i32 2, !302, i32 3, i32 160, i32 7, i32 9}
!304 = !{i32 224, !305}
!305 = !{i32 6, !"cbVoxelCommons", i32 3, i32 0}
!306 = !{i32 416, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!307 = !{i32 6, !"view", i32 2, !302, i32 3, i32 0, i32 7, i32 9}
!308 = !{i32 6, !"invView", i32 2, !302, i32 3, i32 64, i32 7, i32 9}
!309 = !{i32 6, !"projection", i32 2, !302, i32 3, i32 128, i32 7, i32 9}
!310 = !{i32 6, !"invProjection", i32 2, !302, i32 3, i32 192, i32 7, i32 9}
!311 = !{i32 6, !"viewProjection", i32 2, !302, i32 3, i32 256, i32 7, i32 9}
!312 = !{i32 6, !"invViewProjection", i32 2, !302, i32 3, i32 320, i32 7, i32 9}
!313 = !{i32 6, !"eyePosition", i32 3, i32 384, i32 7, i32 9}
!314 = !{i32 6, !"nearPlane", i32 3, i32 396, i32 7, i32 9}
!315 = !{i32 6, !"farPlane", i32 3, i32 400, i32 7, i32 9}
!316 = !{i32 6, !"_pad0", i32 3, i32 404, i32 7, i32 9}
!317 = !{i32 6, !"_pad1", i32 3, i32 408, i32 7, i32 9}
!318 = !{i32 6, !"_pad2", i32 3, i32 412, i32 7, i32 9}
!319 = !{i32 416, !320}
!320 = !{i32 6, !"cbCamera", i32 3, i32 0}
!321 = !{i32 1, void ()* @CS, !322}
!322 = !{!323}
!323 = !{i32 0, !2, !2}
!324 = !{void ()* @CS, !"CS", null, !223, !325}
!325 = !{i32 0, i64 33587217, i32 4, !326}
!326 = !{i32 128, i32 1, i32 1}
!327 = !DILocation(line: 215, column: 21, scope: !328)
!328 = distinct !DILexicalBlock(scope: !329, file: !1, line: 201, column: 17)
!329 = distinct !DILexicalBlock(scope: !330, file: !1, line: 200, column: 17)
!330 = distinct !DILexicalBlock(scope: !331, file: !1, line: 200, column: 17)
!331 = distinct !DILexicalBlock(scope: !332, file: !1, line: 195, column: 13)
!332 = distinct !DILexicalBlock(scope: !333, file: !1, line: 194, column: 13)
!333 = distinct !DILexicalBlock(scope: !334, file: !1, line: 194, column: 13)
!334 = distinct !DILexicalBlock(scope: !335, file: !1, line: 168, column: 9)
!335 = distinct !DILexicalBlock(scope: !336, file: !1, line: 167, column: 13)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 109, column: 5)
!337 = distinct !DILexicalBlock(scope: !338, file: !1, line: 108, column: 14)
!338 = distinct !DILexicalBlock(scope: !42, file: !1, line: 67, column: 9)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threadIdx", arg: 3, scope: !42, file: !1, line: 63, type: !14)
!340 = !DIExpression(DW_OP_bit_piece, 0, 32)
!341 = !DILocation(line: 63, column: 77, scope: !42)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupId", arg: 2, scope: !42, file: !1, line: 63, type: !14)
!343 = !DILocation(line: 63, column: 49, scope: !42)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !42, file: !1, line: 63, type: !14)
!345 = !DILocation(line: 63, column: 15, scope: !42)
!346 = !DILocation(line: 65, column: 10, scope: !42)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadLinearIndex", scope: !42, file: !1, line: 65, type: !31)
!348 = !DIExpression()
!349 = !DILocation(line: 67, column: 26, scope: !338)
!350 = !DILocation(line: 67, column: 38, scope: !338)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outVal", scope: !51, file: !46, line: 137, type: !31)
!352 = !DILocation(line: 137, column: 10, scope: !51, inlinedAt: !353)
!353 = distinct !DILocation(line: 271, column: 31, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !1, line: 268, column: 13)
!355 = distinct !DILexicalBlock(scope: !356, file: !1, line: 267, column: 13)
!356 = distinct !DILexicalBlock(scope: !357, file: !1, line: 267, column: 13)
!357 = distinct !DILexicalBlock(scope: !358, file: !1, line: 240, column: 9)
!358 = distinct !DILexicalBlock(scope: !336, file: !1, line: 239, column: 13)
!359 = !DILocation(line: 137, column: 10, scope: !51, inlinedAt: !360)
!360 = distinct !DILocation(line: 287, column: 30, scope: !361)
!361 = distinct !DILexicalBlock(scope: !362, file: !1, line: 286, column: 17)
!362 = distinct !DILexicalBlock(scope: !354, file: !1, line: 285, column: 21)
!363 = !DILocation(line: 67, column: 9, scope: !42)
!364 = !DILocation(line: 70, column: 51, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !1, line: 70, column: 13)
!366 = distinct !DILexicalBlock(scope: !338, file: !1, line: 68, column: 5)
!367 = !DILocation(line: 70, column: 31, scope: !365)
!368 = !DILocation(line: 70, column: 13, scope: !366)
!369 = !DILocation(line: 71, column: 13, scope: !365)
!370 = !DILocation(line: 73, column: 30, scope: !371)
!371 = distinct !DILexicalBlock(scope: !366, file: !1, line: 73, column: 13)
!372 = !DILocation(line: 73, column: 51, scope: !371)
!373 = !DILocation(line: 73, column: 13, scope: !366)
!374 = !DILocation(line: 76, column: 55, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !1, line: 76, column: 17)
!376 = distinct !DILexicalBlock(scope: !371, file: !1, line: 74, column: 9)
!377 = !DILocation(line: 76, column: 35, scope: !375)
!378 = !DILocation(line: 76, column: 17, scope: !376)
!379 = !DILocation(line: 77, column: 17, scope: !375)
!380 = !DILocation(line: 79, column: 52, scope: !376)
!381 = !DILocation(line: 80, column: 58, scope: !376)
!382 = !DILocation(line: 81, column: 59, scope: !376)
!383 = !DILocation(line: 82, column: 9, scope: !376)
!384 = !DILocation(line: 84, column: 62, scope: !366)
!385 = !DILocation(line: 85, column: 57, scope: !366)
!386 = !DILocation(line: 87, column: 51, scope: !387)
!387 = distinct !DILexicalBlock(scope: !366, file: !1, line: 87, column: 13)
!388 = !DILocation(line: 87, column: 31, scope: !387)
!389 = !DILocation(line: 87, column: 13, scope: !366)
!390 = !DILocation(line: 88, column: 13, scope: !387)
!391 = !DILocation(line: 90, column: 30, scope: !392)
!392 = distinct !DILexicalBlock(scope: !366, file: !1, line: 90, column: 13)
!393 = !DILocation(line: 90, column: 51, scope: !392)
!394 = !DILocation(line: 90, column: 13, scope: !366)
!395 = !DILocation(line: 92, column: 42, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !1, line: 91, column: 9)
!397 = !DILocation(line: 92, column: 18, scope: !396)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !396, file: !1, line: 92, type: !31)
!399 = !DILocation(line: 93, column: 23, scope: !396)
!400 = !DILocation(line: 93, column: 17, scope: !396)
!401 = !DILocation(line: 94, column: 13, scope: !396)
!402 = !DILocation(line: 95, column: 13, scope: !396)
!403 = !DILocation(line: 96, column: 9, scope: !396)
!404 = !DILocation(line: 98, column: 31, scope: !405)
!405 = distinct !DILexicalBlock(scope: !366, file: !1, line: 98, column: 13)
!406 = !DILocation(line: 98, column: 13, scope: !366)
!407 = !DILocation(line: 100, column: 13, scope: !408)
!408 = distinct !DILexicalBlock(scope: !405, file: !1, line: 99, column: 9)
!409 = !DILocation(line: 101, column: 13, scope: !408)
!410 = !DILocation(line: 103, column: 40, scope: !408)
!411 = !DILocation(line: 104, column: 40, scope: !408)
!412 = !DILocation(line: 105, column: 9, scope: !408)
!413 = !DILocation(line: 107, column: 5, scope: !366)
!414 = !DILocation(line: 108, column: 31, scope: !337)
!415 = !DILocation(line: 108, column: 43, scope: !337)
!416 = !DILocation(line: 108, column: 14, scope: !338)
!417 = !DILocation(line: 110, column: 43, scope: !418)
!418 = distinct !DILexicalBlock(scope: !336, file: !1, line: 110, column: 13)
!419 = !DILocation(line: 110, column: 23, scope: !418)
!420 = !DILocation(line: 110, column: 13, scope: !336)
!421 = !DILocation(line: 111, column: 13, scope: !418)
!422 = !DILocation(line: 115, column: 36, scope: !336)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbInfo", scope: !336, file: !1, line: 115, type: !176)
!424 = !DILocation(line: 115, column: 25, scope: !336)
!425 = !DIExpression(DW_OP_bit_piece, 32, 32)
!426 = !DIExpression(DW_OP_bit_piece, 64, 32)
!427 = !DIExpression(DW_OP_bit_piece, 96, 32)
!428 = !DIExpression(DW_OP_bit_piece, 128, 32)
!429 = !DIExpression(DW_OP_bit_piece, 160, 32)
!430 = !DIExpression(DW_OP_bit_piece, 192, 32)
!431 = !DIExpression(DW_OP_bit_piece, 224, 32)
!432 = !DILocation(line: 116, column: 44, scope: !336)
!433 = !DILocation(line: 116, column: 73, scope: !336)
!434 = !DILocation(line: 116, column: 31, scope: !336)
!435 = !DILocation(line: 116, column: 14, scope: !336)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbsPerThread", scope: !336, file: !1, line: 116, type: !31)
!437 = !DILocation(line: 117, column: 67, scope: !336)
!438 = !DILocation(line: 117, column: 53, scope: !336)
!439 = !DILocation(line: 117, column: 14, scope: !336)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbStart", scope: !336, file: !1, line: 117, type: !31)
!441 = !DILocation(line: 118, column: 83, scope: !336)
!442 = !DILocation(line: 118, column: 38, scope: !336)
!443 = !DILocation(line: 118, column: 24, scope: !336)
!444 = !DILocation(line: 118, column: 14, scope: !336)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbEnd", scope: !336, file: !1, line: 118, type: !31)
!446 = !DILocation(line: 120, column: 15, scope: !336)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin", scope: !336, file: !1, line: 120, type: !22)
!448 = !DILocation(line: 122, column: 25, scope: !449)
!449 = distinct !DILexicalBlock(scope: !336, file: !1, line: 122, column: 13)
!450 = !DILocation(line: 122, column: 13, scope: !336)
!451 = !DILocation(line: 124, column: 32, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 123, column: 9)
!453 = !DILocation(line: 125, column: 26, scope: !452)
!454 = !DILocation(line: 127, column: 32, scope: !452)
!455 = !DILocation(line: 128, column: 9, scope: !452)
!456 = !DILocation(line: 130, column: 9, scope: !336)
!457 = !DILocation(line: 132, column: 25, scope: !458)
!458 = distinct !DILexicalBlock(scope: !336, file: !1, line: 132, column: 13)
!459 = !DILocation(line: 132, column: 13, scope: !336)
!460 = !DILocation(line: 136, column: 35, scope: !461)
!461 = distinct !DILexicalBlock(scope: !458, file: !1, line: 133, column: 9)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frustumPlane", scope: !461, file: !1, line: 136, type: !32)
!463 = !DILocation(line: 136, column: 20, scope: !461)
!464 = !DILocation(line: 138, column: 20, scope: !461)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !461, file: !1, line: 138, type: !23)
!466 = !DILocation(line: 139, column: 19, scope: !461)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !461, file: !1, line: 139, type: !22)
!468 = !DILocation(line: 141, column: 20, scope: !461)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMin", scope: !461, file: !1, line: 141, type: !23)
!470 = !DILocation(line: 142, column: 20, scope: !461)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMax", scope: !461, file: !1, line: 142, type: !23)
!472 = !DILocation(line: 146, column: 23, scope: !461)
!473 = !DILocation(line: 146, column: 13, scope: !461)
!474 = !DILocation(line: 147, column: 23, scope: !461)
!475 = !DILocation(line: 147, column: 13, scope: !461)
!476 = !DILocation(line: 148, column: 23, scope: !461)
!477 = !DILocation(line: 148, column: 13, scope: !461)
!478 = !DILocation(line: 145, column: 20, scope: !461)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "positiveVertex", scope: !461, file: !1, line: 145, type: !23)
!480 = !DILocation(line: 150, column: 34, scope: !461)
!481 = !DILocation(line: 150, column: 62, scope: !461)
!482 = !DILocation(line: 150, column: 19, scope: !461)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbDistance", scope: !461, file: !1, line: 150, type: !22)
!484 = !DILocation(line: 153, column: 30, scope: !485)
!485 = distinct !DILexicalBlock(scope: !461, file: !1, line: 153, column: 17)
!486 = !DILocation(line: 153, column: 39, scope: !485)
!487 = !DILocation(line: 153, column: 17, scope: !461)
!488 = !DILocation(line: 155, column: 17, scope: !489)
!489 = distinct !DILexicalBlock(scope: !485, file: !1, line: 154, column: 13)
!490 = !DILocation(line: 156, column: 13, scope: !489)
!491 = !DILocation(line: 158, column: 68, scope: !461)
!492 = !DILocation(line: 158, column: 54, scope: !461)
!493 = !DILocation(line: 158, column: 13, scope: !461)
!494 = !DILocation(line: 159, column: 9, scope: !461)
!495 = !DILocation(line: 161, column: 9, scope: !336)
!496 = !DILocation(line: 163, column: 80, scope: !336)
!497 = !DILocation(line: 163, column: 45, scope: !336)
!498 = !DILocation(line: 163, column: 25, scope: !336)
!499 = !DILocation(line: 163, column: 16, scope: !336)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eyePos", scope: !336, file: !1, line: 163, type: !23)
!501 = !DILocation(line: 167, column: 13, scope: !335)
!502 = !DILocation(line: 167, column: 32, scope: !335)
!503 = !DILocation(line: 167, column: 13, scope: !336)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "facesAndCorners", scope: !334, file: !1, line: 169, type: !505)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1344, align: 32, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 14)
!508 = !DILocation(line: 169, column: 20, scope: !334)
!509 = !{i32 0, i32 96, i32 14}
!510 = !{i32 32, i32 96, i32 14}
!511 = !{i32 64, i32 96, i32 14}
!512 = !DILocation(line: 170, column: 13, scope: !334)
!513 = !DILocation(line: 189, column: 93, scope: !334)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !334, file: !1, line: 189, type: !515)
!515 = !DICompositeType(tag: DW_TAG_class_type, name: "RayQuery<260>", file: !1, line: 189, size: 32, align: 32, elements: !516, templateParams: !522)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !515, file: !1, line: 189, baseType: !8, size: 32, align: 32)
!518 = !DISubprogram(name: "RayQuery", scope: !515, file: !1, line: 189, type: !519, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!522 = !{!523}
!523 = !DITemplateValueParameter(name: "flags", type: !8, value: i32 260)
!524 = !DILocation(line: 192, column: 32, scope: !334)
!525 = !DILocation(line: 192, column: 45, scope: !334)
!526 = !DILocation(line: 192, column: 18, scope: !334)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isOccluded", scope: !334, file: !1, line: 192, type: !49)
!528 = !DILocation(line: 194, column: 23, scope: !333)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !333, file: !1, line: 194, type: !31)
!530 = !DILocation(line: 194, column: 40, scope: !332)
!531 = !DILocation(line: 194, column: 53, scope: !332)
!532 = !DILocation(line: 194, column: 50, scope: !332)
!533 = !DILocation(line: 194, column: 13, scope: !333)
!534 = !DILocation(line: 197, column: 34, scope: !331)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelAABB", scope: !331, file: !1, line: 197, type: !168)
!536 = !DILocation(line: 197, column: 22, scope: !331)
!537 = !DILocation(line: 198, column: 52, scope: !331)
!538 = !DILocation(line: 198, column: 69, scope: !331)
!539 = !DILocation(line: 198, column: 24, scope: !331)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbCenter", scope: !331, file: !1, line: 198, type: !23)
!541 = !DILocation(line: 200, column: 27, scope: !330)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !330, file: !1, line: 200, type: !31)
!543 = !DILocation(line: 200, column: 44, scope: !329)
!544 = !DILocation(line: 200, column: 41, scope: !329)
!545 = !DILocation(line: 200, column: 17, scope: !330)
!546 = !DILocation(line: 202, column: 35, scope: !328)
!547 = !DILocation(line: 202, column: 48, scope: !328)
!548 = !DILocation(line: 202, column: 32, scope: !328)
!549 = !DILocation(line: 204, column: 26, scope: !328)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitSomething", scope: !328, file: !1, line: 204, type: !49)
!551 = !DILocation(line: 205, column: 50, scope: !328)
!552 = !DILocation(line: 205, column: 48, scope: !328)
!553 = !DILocation(line: 205, column: 28, scope: !328)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !328, file: !1, line: 205, type: !23)
!555 = !DILocation(line: 206, column: 47, scope: !328)
!556 = !DILocation(line: 206, column: 28, scope: !328)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !328, file: !1, line: 206, type: !23)
!558 = !DILocation(line: 207, column: 38, scope: !328)
!559 = !DILocation(line: 207, column: 27, scope: !328)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distance", scope: !328, file: !1, line: 207, type: !22)
!561 = !DILocation(line: 210, column: 32, scope: !328)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !328, file: !1, line: 209, type: !563)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 209, size: 256, align: 32, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !563, file: !1, line: 209, baseType: !24, size: 96, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !563, file: !1, line: 209, baseType: !22, size: 32, align: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !563, file: !1, line: 209, baseType: !24, size: 96, align: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !563, file: !1, line: 209, baseType: !22, size: 32, align: 32, offset: 224)
!569 = !DILocation(line: 209, column: 29, scope: !328)
!570 = !DILocation(line: 211, column: 47, scope: !328)
!571 = !DILocation(line: 211, column: 35, scope: !328)
!572 = !DILocation(line: 212, column: 30, scope: !328)
!573 = !DILocation(line: 213, column: 30, scope: !328)
!574 = !DILocation(line: 217, column: 28, scope: !328)
!575 = !DILocation(line: 217, column: 21, scope: !328)
!576 = !DILocation(line: 219, column: 29, scope: !577)
!577 = distinct !DILexicalBlock(scope: !578, file: !1, line: 219, column: 29)
!578 = distinct !DILexicalBlock(scope: !328, file: !1, line: 218, column: 21)
!579 = !DILocation(line: 219, column: 47, scope: !577)
!580 = !DILocation(line: 219, column: 29, scope: !578)
!581 = !DILocation(line: 221, column: 29, scope: !582)
!582 = distinct !DILexicalBlock(scope: !577, file: !1, line: 220, column: 25)
!583 = !DILocation(line: 222, column: 42, scope: !582)
!584 = !DILocation(line: 223, column: 29, scope: !582)
!585 = !DILocation(line: 228, column: 26, scope: !586)
!586 = distinct !DILexicalBlock(scope: !328, file: !1, line: 228, column: 25)
!587 = !DILocation(line: 228, column: 25, scope: !328)
!588 = !DILocation(line: 230, column: 36, scope: !589)
!589 = distinct !DILexicalBlock(scope: !586, file: !1, line: 229, column: 21)
!590 = !DILocation(line: 231, column: 38, scope: !589)
!591 = !DILocation(line: 232, column: 21, scope: !589)
!592 = !DILocation(line: 233, column: 17, scope: !328)
!593 = !DILocation(line: 200, column: 57, scope: !329)
!594 = !DILocation(line: 200, column: 36, scope: !329)
!595 = !DILocation(line: 234, column: 13, scope: !331)
!596 = !DILocation(line: 194, column: 66, scope: !332)
!597 = !DILocation(line: 235, column: 9, scope: !334)
!598 = !DILocation(line: 237, column: 9, scope: !336)
!599 = !DILocation(line: 239, column: 13, scope: !358)
!600 = !DILocation(line: 239, column: 26, scope: !358)
!601 = !DILocation(line: 239, column: 43, scope: !358)
!602 = !DILocation(line: 239, column: 31, scope: !358)
!603 = !DILocation(line: 239, column: 13, scope: !336)
!604 = !DILocation(line: 241, column: 18, scope: !357)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nIndirectLightFaces", scope: !357, file: !1, line: 241, type: !31)
!606 = !DILocation(line: 242, column: 18, scope: !357)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nGaussianFaces", scope: !357, file: !1, line: 242, type: !31)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indirectLightStartAddress", scope: !357, file: !1, line: 244, type: !31)
!609 = !DILocation(line: 244, column: 18, scope: !357)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gaussianStartAddress", scope: !357, file: !1, line: 245, type: !31)
!611 = !DILocation(line: 245, column: 18, scope: !357)
!612 = !DILocation(line: 247, column: 23, scope: !613)
!613 = distinct !DILexicalBlock(scope: !357, file: !1, line: 247, column: 13)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !613, file: !1, line: 247, type: !31)
!615 = !DILocation(line: 247, column: 40, scope: !616)
!616 = distinct !DILexicalBlock(scope: !613, file: !1, line: 247, column: 13)
!617 = !DILocation(line: 247, column: 13, scope: !613)
!618 = !DILocation(line: 249, column: 31, scope: !619)
!619 = distinct !DILexicalBlock(scope: !616, file: !1, line: 248, column: 13)
!620 = !DILocation(line: 249, column: 22, scope: !619)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxIdx", scope: !619, file: !1, line: 249, type: !31)
!622 = !DILocation(line: 251, column: 22, scope: !623)
!623 = distinct !DILexicalBlock(scope: !619, file: !1, line: 251, column: 21)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "voxelLinearCoord", arg: 1, scope: !45, file: !46, line: 113, type: !31)
!625 = !DILocation(line: 113, column: 26, scope: !45, inlinedAt: !626)
!626 = distinct !DILocation(line: 251, column: 22, scope: !623)
