#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 4d6d73b0ca807cbf300e230eb0690381.pdb
; shader hash: 4d6d73b0ca807cbf300e230eb0690381
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; Resource bind info for gVoxelFaceStartCountBuffer
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gFaceClusterVisibility
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gVisibleClustersBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gVisibleVoxelIndices
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gVoxelRadiance
; {
;
;   float $Element;                                   ; Offset:    0 Size:     4
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !25)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransportIndirect_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !18}
!4 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 35, type: !5, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !19, file: !19, line: 102, type: !20, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!19 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !24}
!22 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 37, baseType: !11)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 24, size: 32, align: 32, elements: !2)
!25 = !{!26, !38, !40, !41, !42, !45, !47, !49, !50, !51, !97, !107, !110, !111, !112, !113, !123, !124, !132, !142, !143, !144, !145, !146, !147, !148, !149, !150, !153, !155, !157}
!26 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !27, line: 86, type: !28, isLocal: true, isDefinition: true)
!27 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 86, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 86, size: 96, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 86, baseType: !33, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 86, baseType: !33, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 86, baseType: !33, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!37, !16}
!37 = !DITemplateTypeParameter(name: "element", type: !33)
!38 = !DIGlobalVariable(name: "PI", scope: !0, file: !27, line: 104, type: !39, isLocal: true, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!40 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !27, line: 105, type: !39, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !27, line: 106, type: !39, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !43, line: 47, type: !44, isLocal: false, isDefinition: true)
!43 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 47, size: 32, align: 32, elements: !2)
!45 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !43, line: 48, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!47 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !19, line: 8, type: !48, isLocal: true, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!49 = !DIGlobalVariable(name: "cos30", scope: !0, file: !19, line: 9, type: !39, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariable(name: "cos25", scope: !0, file: !19, line: 10, type: !39, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !53)
!53 = !{!54}
!54 = !DITemplateTypeParameter(name: "T", type: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !56, line: 26, size: 1792, align: 32, elements: !57)
!56 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!57 = !{!58, !59, !60, !63, !64, !65, !67, !68, !69, !70, !71, !72, !73, !96}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !55, file: !56, line: 28, baseType: !7, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !55, file: !56, line: 29, baseType: !33, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !55, file: !56, line: 31, baseType: !61, size: 96, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !62, line: 4, baseType: !29)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !55, file: !56, line: 32, baseType: !33, size: 32, align: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !55, file: !56, line: 34, baseType: !61, size: 96, align: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !55, file: !56, line: 35, baseType: !66, size: 32, align: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !62, line: 8, baseType: !23)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !55, file: !56, line: 37, baseType: !61, size: 96, align: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !55, file: !56, line: 38, baseType: !33, size: 32, align: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !55, file: !56, line: 40, baseType: !61, size: 96, align: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !55, file: !56, line: 41, baseType: !33, size: 32, align: 32, offset: 608)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !55, file: !56, line: 43, baseType: !61, size: 96, align: 32, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !55, file: !56, line: 44, baseType: !33, size: 32, align: 32, offset: 736)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !55, file: !56, line: 46, baseType: !74, size: 512, align: 32, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !76, templateParams: !93)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !75, file: !1, line: 3, baseType: !33, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!93 = !{!37, !94, !95}
!94 = !DITemplateValueParameter(name: "row_count", type: !17, value: i32 4)
!95 = !DITemplateValueParameter(name: "col_count", type: !17, value: i32 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !55, file: !56, line: 47, baseType: !74, size: 512, align: 32, offset: 1280)
!97 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !99)
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "T", type: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !56, line: 137, size: 128, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !101, file: !56, line: 139, baseType: !66, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !101, file: !56, line: 140, baseType: !33, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !101, file: !56, line: 141, baseType: !33, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !101, file: !56, line: 142, baseType: !33, size: 32, align: 32, offset: 96)
!107 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 6, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !109)
!109 = !{!15}
!110 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !108, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !108, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !108, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "gVoxelFaceDataBuffer", linkageName: "\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 11, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 11, size: 64, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "element", type: !117)
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 48, size: 64, align: 32, elements: !118, templateParams: !121)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !117, file: !1, line: 48, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !117, file: !1, line: 48, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!121 = !{!15, !122}
!122 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 2)
!123 = !DIGlobalVariable(name: "gVoxelFaceStartCountBuffer", linkageName: "\01?gVoxelFaceStartCountBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 13, type: !114, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 15, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 15, size: 192, align: 32, elements: !2, templateParams: !126)
!126 = !{!127}
!127 = !DITemplateTypeParameter(name: "element", type: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !56, line: 12, size: 192, align: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !128, file: !56, line: 14, baseType: !29, size: 96, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !128, file: !56, line: 15, baseType: !29, size: 96, align: 32, offset: 96)
!132 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 16, type: !133, isLocal: false, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 16, size: 256, align: 32, elements: !2, templateParams: !134)
!134 = !{!135}
!135 = !DITemplateTypeParameter(name: "element", type: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !56, line: 145, size: 256, align: 32, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !136, file: !56, line: 147, baseType: !61, size: 96, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !136, file: !56, line: 148, baseType: !66, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !136, file: !56, line: 149, baseType: !61, size: 96, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !136, file: !56, line: 150, baseType: !66, size: 32, align: 32, offset: 224)
!142 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 18, type: !108, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 20, type: !114, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 22, type: !108, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariable(name: "gLitVoxels", linkageName: "\01?gLitVoxels@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 24, type: !24, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariable(name: "gLitClusters", linkageName: "\01?gLitClusters@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 25, type: !24, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariable(name: "gVisibleVoxels", linkageName: "\01?gVisibleVoxels@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 27, type: !24, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariable(name: "gVisibleVoxelCounter", linkageName: "\01?gVisibleVoxelCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 28, type: !24, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "gVisibleVoxelIndices", linkageName: "\01?gVisibleVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 29, type: !108, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "gVoxelRadiance", linkageName: "\01?gVoxelRadiance@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 31, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 31, size: 32, align: 32, elements: !2, templateParams: !152)
!152 = !{!37}
!153 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !27, line: 86, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !28, size: 32, align: 4, offset: 64)
!155 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !27, line: 86, type: !156, isLocal: false, isDefinition: true)
!156 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !28, size: 32, align: 4)
!157 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !27, line: 86, type: !158, isLocal: false, isDefinition: true)
!158 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !28, size: 32, align: 4, offset: 32)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!162 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransportIndirect_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferIndirectLightTransport> cbFrustumCulling : register(b1);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space0);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space0);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space0);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space0);\0D\0A\0D\0AStructuredBuffer<uint2> gVoxelFaceDataBuffer : register(t0, space1);\0D\0A// The element i contains the start index in gVoxelFaceDataBuffer and the number of the faces for the voxel with index i\0D\0AStructuredBuffer<uint2> gVoxelFaceStartCountBuffer : register(t1, space1);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space2);\0D\0AStructuredBuffer<ClusterAABBInfo> gClusterAABBInfoBuffer : register(t1, space2);\0D\0A// Map from aabbVoxelIndices to gVoxelIndicesCompactBuffer.\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space2);\0D\0A\0D\0AStructuredBuffer<uint2> gFaceClusterVisibility : register(t0, space3);\0D\0A// Stores all the visible clusters for all the faces. Clusters visible from the same faced are stored in sequence.\0D\0AStructuredBuffer<uint> gVisibleClustersBuffer : register(t1, space3);\0D\0A\0D\0AByteAddressBuffer gLitVoxels : register(t0, space4);\0D\0AByteAddressBuffer gLitClusters : register(t1, space4);\0D\0A\0D\0AByteAddressBuffer gVisibleVoxels : register(t0, space5);\0D\0AByteAddressBuffer gVisibleVoxelCounter : register(t1, space5);\0D\0AStructuredBuffer<uint> gVisibleVoxelIndices : register(t2, space5);\0D\0A\0D\0ARWStructuredBuffer<float> gVoxelRadiance : register(u0);\0D\0A\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint threadID = DTid.x;\0D\0A    \0D\0A    uint nVisibleVoxels = gVisibleVoxelCounter.Load(0);\0D\0A    \0D\0A    if (threadID > nVisibleVoxels)\0D\0A        return;\0D\0A    \0D\0A    uint voxelIndex = gVisibleVoxelIndices[threadID];\0D\0A    \0D\0A    uint faceDir[6];\0D\0A    // X field is the start index in gVoxelFaceDataBuffer, Y field is number of elements\0D\0A    uint2 faceStartCount = gVoxelFaceStartCountBuffer[voxelIndex];\0D\0A    \0D\0A    float radiance = 0.0f;\0D\0A    \0D\0A    for (uint i = 0; i < faceStartCount.y; i++)\0D\0A    {\0D\0A        uint faceIdx = faceStartCount.x + i;\0D\0A        faceDir[i] = gVoxelFaceDataBuffer[faceStartCount.x + i].y;\0D\0A        \0D\0A        uint2 clusterStartCount = gFaceClusterVisibility[faceIdx];\0D\0A\0D\0A        for (uint clusterIdx = clusterStartCount.x; clusterIdx < clusterStartCount.x + clusterStartCount.y; clusterIdx++)\0D\0A        {\0D\0A            if (IsVoxelPresent(gVisibleClustersBuffer[clusterIdx], gLitClusters))\0D\0A            {\0D\0A                radiance += 0.005f;\0D\0A            }\0D\0A        }\0D\0A\0D\0A    }\0D\0A    \0D\0A    gVoxelRadiance[voxelIndex] = radiance;\0D\0A    \0D\0A    //gVoxelRadiance[voxelIndex] = 0.5f;\0D\0A}"}
