#if 0
;
; Note: shader requires additional functionality:
;       Raytracing tier 1.1 features
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 4d75b55ba02944fd0cc049ed40052081.pdb
; shader hash: 4d75b55ba02944fd0cc049ed40052081
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !41, globals: !45)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !23, !31, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 65, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 65, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 65, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 51, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 51, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 51, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 92, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 92, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 92, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 92, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 92, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !21}
!30 = !DITemplateTypeParameter(name: "element", type: !22)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 111, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 111, size: 128, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 111, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 111, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 111, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 111, baseType: !22, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 48, baseType: !8)
!41 = !{!42}
!42 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 54, type: !43, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !14, !14, !14}
!45 = !{!46, !47, !48, !49, !52, !54, !55, !56, !59, !60, !61, !62, !65, !67, !68, !69, !70, !116, !133, !151, !154, !155, !156, !157, !165, !175, !176, !178, !180, !182, !186, !190, !191, !192, !194, !196}
!46 = !DIGlobalVariable(name: "gsIsOutsideFrustum", linkageName: "\01?gsIsOutsideFrustum@@3IA", scope: !0, file: !1, line: 48, type: !40, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOutsideFrustum@@3IA")
!47 = !DIGlobalVariable(name: "gsIsOccluded", linkageName: "\01?gsIsOccluded@@3IA", scope: !0, file: !1, line: 49, type: !40, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?gsIsOccluded@@3IA")
!48 = !DIGlobalVariable(name: "gsMaxFaces", linkageName: "\01?gsMaxFaces@@3IA", scope: !0, file: !1, line: 51, type: !40, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !50, line: 15, type: !51, isLocal: true, isDefinition: true, variable: i32 -1)
!50 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!52 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 46, type: !53, isLocal: true, isDefinition: true, variable: float 0x3FF6A09E60000000)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!54 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 187, type: !51, isLocal: true, isDefinition: true, variable: i32 0)
!55 = !DIGlobalVariable(name: "CANDIDATE_PROCEDURAL_PRIMITIVE", scope: !0, file: !1, line: 191, type: !51, isLocal: true, isDefinition: true, variable: i32 1)
!56 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !57, line: 87, type: !58, isLocal: true, isDefinition: true)
!57 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!59 = !DIGlobalVariable(name: "PI", scope: !0, file: !57, line: 105, type: !53, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !57, line: 106, type: !53, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !57, line: 107, type: !53, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !63, line: 45, type: !64, isLocal: false, isDefinition: true)
!63 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!65 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !63, line: 46, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!67 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !50, line: 15, type: !51, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariable(name: "cos30", scope: !0, file: !50, line: 16, type: !53, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariable(name: "cos25", scope: !0, file: !50, line: 17, type: !53, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 23, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 23, size: 32, align: 32, elements: !2, templateParams: !72)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !75, line: 26, size: 1792, align: 32, elements: !76)
!75 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!76 = !{!77, !78, !79, !82, !83, !84, !86, !87, !88, !89, !90, !91, !92, !115}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !74, file: !75, line: 28, baseType: !14, size: 96, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !74, file: !75, line: 29, baseType: !22, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !74, file: !75, line: 31, baseType: !80, size: 96, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !81, line: 4, baseType: !23)
!81 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !74, file: !75, line: 32, baseType: !22, size: 32, align: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !74, file: !75, line: 34, baseType: !80, size: 96, align: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !74, file: !75, line: 35, baseType: !85, size: 32, align: 32, offset: 352)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !81, line: 8, baseType: !40)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !74, file: !75, line: 37, baseType: !80, size: 96, align: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !74, file: !75, line: 38, baseType: !85, size: 32, align: 32, offset: 480)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !74, file: !75, line: 40, baseType: !80, size: 96, align: 32, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !74, file: !75, line: 41, baseType: !85, size: 32, align: 32, offset: 608)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !74, file: !75, line: 43, baseType: !80, size: 96, align: 32, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !74, file: !75, line: 44, baseType: !22, size: 32, align: 32, offset: 736)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !74, file: !75, line: 46, baseType: !93, size: 512, align: 32, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !95, templateParams: !112)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !94, file: !1, line: 23, baseType: !22, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!112 = !{!30, !113, !114}
!113 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!114 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !74, file: !75, line: 47, baseType: !93, size: 512, align: 32, offset: 1280)
!116 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 24, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !118)
!118 = !{!119}
!119 = !DITemplateTypeParameter(name: "T", type: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !75, line: 139, size: 1024, align: 32, elements: !121)
!121 = !{!122, !127, !128, !129, !130, !131, !132}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !120, file: !75, line: 141, baseType: !123, size: 768, align: 32)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 768, align: 32, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !81, line: 5, baseType: !31)
!125 = !{!126}
!126 = !DISubrange(count: 6)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !120, file: !75, line: 143, baseType: !80, size: 96, align: 32, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !120, file: !75, line: 144, baseType: !85, size: 32, align: 32, offset: 864)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !120, file: !75, line: 146, baseType: !85, size: 32, align: 32, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !120, file: !75, line: 147, baseType: !85, size: 32, align: 32, offset: 928)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !120, file: !75, line: 148, baseType: !85, size: 32, align: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !120, file: !75, line: 149, baseType: !22, size: 32, align: 32, offset: 992)
!133 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@UConstantBufferCamera@@@@A", scope: !0, file: !1, line: 25, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferCamera>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !135)
!135 = !{!136}
!136 = !DITemplateTypeParameter(name: "T", type: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferCamera", file: !1, line: 4, size: 3328, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !137, file: !1, line: 6, baseType: !93, size: 512, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "invView", scope: !137, file: !1, line: 7, baseType: !93, size: 512, align: 32, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !137, file: !1, line: 8, baseType: !93, size: 512, align: 32, offset: 1024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "invProjection", scope: !137, file: !1, line: 9, baseType: !93, size: 512, align: 32, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjection", scope: !137, file: !1, line: 10, baseType: !93, size: 512, align: 32, offset: 2048)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjection", scope: !137, file: !1, line: 11, baseType: !93, size: 512, align: 32, offset: 2560)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "eyePosition", scope: !137, file: !1, line: 14, baseType: !80, size: 96, align: 32, offset: 3072)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nearPlane", scope: !137, file: !1, line: 15, baseType: !22, size: 32, align: 32, offset: 3168)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "farPlane", scope: !137, file: !1, line: 17, baseType: !22, size: 32, align: 32, offset: 3200)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !137, file: !1, line: 18, baseType: !22, size: 32, align: 32, offset: 3232)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !137, file: !1, line: 19, baseType: !22, size: 32, align: 32, offset: 3264)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !137, file: !1, line: 20, baseType: !22, size: 32, align: 32, offset: 3296)
!151 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!11}
!154 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !152, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 29, type: !152, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !152, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 32, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 32, size: 192, align: 32, elements: !2, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !75, line: 12, size: 192, align: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !161, file: !75, line: 14, baseType: !23, size: 96, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !161, file: !75, line: 15, baseType: !23, size: 96, align: 32, offset: 96)
!165 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 33, type: !166, isLocal: false, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 33, size: 256, align: 32, elements: !2, templateParams: !167)
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "element", type: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !75, line: 177, size: 256, align: 32, elements: !170)
!170 = !{!171, !172, !173, !174}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !169, file: !75, line: 179, baseType: !80, size: 96, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !169, file: !75, line: 180, baseType: !85, size: 32, align: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !169, file: !75, line: 181, baseType: !80, size: 96, align: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !169, file: !75, line: 182, baseType: !85, size: 32, align: 32, offset: 224)
!175 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !152, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 37, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 37, size: 32, align: 32, elements: !2)
!178 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 39, type: !179, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 39, size: 32, align: 32, elements: !2)
!180 = !DIGlobalVariable(name: "gVisibleFaceIndices", linkageName: "\01?gVisibleFaceIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 40, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 40, size: 32, align: 32, elements: !2, templateParams: !153)
!182 = !DIGlobalVariable(name: "gDispatchIndirectBuffer", linkageName: "\01?gDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 41, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 41, size: 96, align: 32, elements: !2, templateParams: !184)
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "element", type: !15)
!186 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 43, type: !187, isLocal: false, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 43, size: 64, align: 32, elements: !2, templateParams: !188)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "element", type: !5)
!190 = !DIGlobalVariable(name: "gFaceFilteredRadianceBuffer", linkageName: "\01?gFaceFilteredRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 44, type: !187, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 46, type: !53, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !57, line: 87, type: !193, isLocal: false, isDefinition: true)
!193 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !58, size: 32, align: 4, offset: 64)
!194 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !57, line: 87, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !58, size: 32, align: 4)
!196 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !57, line: 87, type: !197, isLocal: false, isDefinition: true)
!197 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !58, size: 32, align: 4, offset: 32)
!198 = !{i32 2, !"Dwarf Version", i32 4}
!199 = !{i32 2, !"Debug Info Version", i32 3}
!200 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!201 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0Astruct ConstantBufferCamera\0D\0A{\0D\0A    XMFLOAT4X4 view;\0D\0A\09XMFLOAT4X4 invView;\0D\0A\09XMFLOAT4X4 projection;\0D\0A\09XMFLOAT4X4 invProjection;\0D\0A\09XMFLOAT4X4 viewProjection;\0D\0A\09XMFLOAT4X4 invViewProjection;\0D\0A    \0D\0A    // Use by shadow cameras only.\0D\0A    XMFLOAT3 eyePosition;\0D\0A    float nearPlane;\0D\0A\0D\0A    float farPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferFrustumCulling> cbFrustumCulling : register(b1);\0D\0AConstantBuffer<ConstantBufferCamera> cbCamera : register(b2);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space0);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space0);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space0);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space0);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space1);\0D\0AStructuredBuffer<ClusterAABBInfo> gClusterAABBInfoBuffer : register(t1, space1);\0D\0A// Map from aabbVoxelIndices to gVoxelIndicesCompactBuffer.\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space1);\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space2);\0D\0A\0D\0ARWByteAddressBuffer gVisibleFaceCounter : register(u0);\0D\0ARWStructuredBuffer<uint> gVisibleFaceIndices : register(u1);\0D\0ARWStructuredBuffer<uint3> gDispatchIndirectBuffer : register(u2);\0D\0A\0D\0ARWStructuredBuffer<uint2> gFaceRadianceBuffer : register(u0, space1);\0D\0ARWStructuredBuffer<uint2> gFaceFilteredRadianceBuffer : register(u1, space1);\0D\0A\0D\0Astatic const float SQRT_2 = 1.41421356237f;\0D\0A\0D\0Agroupshared uint gsIsOutsideFrustum;\0D\0Agroupshared uint gsIsOccluded;\0D\0A\0D\0Agroupshared uint gsMaxFaces;\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS(uint3 DTid : SV_DispatchThreadID, uint3 groupId : SV_GroupID, uint3 threadIdx : SV_GroupThreadID)\0D\0A{\0D\0A    uint threadLinearIndex = DTid.x;\0D\0A    \0D\0A    if (cbFrustumCulling.CurrentStep == 0)\0D\0A    {\0D\0A        \0D\0A        if (threadLinearIndex >= cbFrustumCulling.FaceCount)\0D\0A            return;\0D\0A        \0D\0A        \0D\0A        gFaceRadianceBuffer[threadLinearIndex] = uint2(0, 0);\0D\0A        gFaceFilteredRadianceBuffer[threadLinearIndex] = uint2(0, 0);\0D\0A\0D\0A        if (threadLinearIndex < cbFrustumCulling.FaceCount / 2)\0D\0A        {\0D\0A            gVisibleFaceIndices[threadLinearIndex] = UINT_MAX;\0D\0A        }\0D\0A        \0D\0A        if (threadLinearIndex >= cbFrustumCulling.VoxelCount)\0D\0A            return;\0D\0A        \0D\0A        if (threadLinearIndex == 0)\0D\0A        {\0D\0A            gVisibleFaceCounter.Store(0, 0);\0D\0A            gDispatchIndirectBuffer[0] = uint3(0, 1, 1);\0D\0A            gDispatchIndirectBuffer[1] = uint3(0, 1, 1);\0D\0A        }\0D\0A\0D\0A    }\0D\0A\0D\0A    else if (cbFrustumCulling.CurrentStep == 1)\0D\0A    {\0D\0A        if (groupId.x >= cbFrustumCulling.AABBGroupCount)\0D\0A            return;\0D\0A        \0D\0A\0D\0A        \0D\0A        ClusterAABBInfo aabbInfo = gClusterAABBInfoBuffer[groupId.x];\0D\0A        uint aabbsPerThread = ceil((float) aabbInfo.ClusterElementCount / 128.0f);\0D\0A        uint aabbStart = aabbInfo.ClusterStartIndex + threadIdx.x * aabbsPerThread;\0D\0A        uint aabbEnd = min(aabbStart + aabbsPerThread, aabbInfo.ClusterStartIndex + aabbInfo.ClusterElementCount);\0D\0A        \0D\0A\0D\0A        if (threadIdx.x == 0)\0D\0A        {\0D\0A            gsIsOutsideFrustum = 0;\0D\0A            gsIsOccluded = 1;\0D\0A            gsMaxFaces = 0;\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        if (threadIdx.x < 6)\0D\0A        {\0D\0A\0D\0A            // Get the normal and distance (D) from the plane\0D\0A            float4 frustumPlane = cbFrustumCulling.FrustumPlanes[threadIdx.x];\0D\0A        \0D\0A            float3 normal = frustumPlane.xyz;\0D\0A            float d = frustumPlane.w;\0D\0A            \0D\0A            float3 aabbMin = aabbInfo.Min;\0D\0A            float3 aabbMax = aabbInfo.Max;\0D\0A        \0D\0A            // Compute the positive vertex of the AABB for this plane\0D\0A            float3 positiveVertex = float3(\0D\0A            (normal.x > 0) ? aabbMax.x : aabbMin.x,\0D\0A            (normal.y > 0) ? aabbMax.y : aabbMin.y,\0D\0A            (normal.z > 0) ? aabbMax.z : aabbMin.z);\0D\0A        \0D\0A\0D\0A            // If the positive vertex is outside the plane, the AABB is outside the frustum\0D\0A            if (dot(normal, positiveVertex) + d < 0)\0D\0A            {\0D\0A                InterlockedOr(gsIsOutsideFrustum, 1);\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A        \0D\0A        float3 eyePos = mul(float4(cbCamera.eyePosition, 1.0f), cbVoxelCommons.WorldToVoxel).xyz;\0D\0A        \0D\0A        \0D\0A        \0D\0A        if (gsIsOutsideFrustum == 0)\0D\0A        {\0D\0A            float3 facesAndCorners[14] =\0D\0A            {\0D\0A                // 4 edge midpoints\0D\0A                float3(0.0f, 0.0f, -2.0f),\0D\0A                float3(0.0f, 0.0f, 2.0f),\0D\0A                float3(0.0f, -2.0f, 0.0f),\0D\0A                float3(0.0f, 2.0f, 0.0f),\0D\0A                float3(-2.0f, 0.0f, 0.0f),\0D\0A                float3(2.0f, 0.0f, 0.0f),\0D\0A                \0D\0A                float3(-SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(-SQRT_2, SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, -SQRT_2, SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, -SQRT_2),\0D\0A                float3(SQRT_2, SQRT_2, SQRT_2)\0D\0A            };\0D\0A\0D\0A            RayQuery < RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH | RAY_FLAG_SKIP_TRIANGLES > q;\0D\0A            \0D\0A\0D\0A            bool isOccluded = (gsIsOccluded == 1);\0D\0A            \0D\0A            for (uint v = aabbStart; v < aabbEnd && isOccluded; v++)\0D\0A            {\0D\0A\0D\0A                AABB voxelAABB = gVoxelAABBBuffer[v];\0D\0A                float3 aabbCenter = (voxelAABB.Min + voxelAABB.Max) * 0.5f;\0D\0A                \0D\0A                for (uint f = 0; f < 14 && isOccluded; f++)\0D\0A                {\0D\0A                    isOccluded = (gsIsOccluded == 1);\0D\0A\0D\0A                    bool hitSomething = false;\0D\0A                    float3 origin = aabbCenter + facesAndCorners[f];\0D\0A                    float3 direction = eyePos - origin;\0D\0A                    float distance = length(direction);\0D\0A                \0D\0A                    RayDesc ray;\0D\0A                    ray.Origin = origin;\0D\0A                    ray.Direction = direction / distance;\0D\0A                    ray.TMin = 0.1f;\0D\0A                    ray.TMax = distance;\0D\0A                \0D\0A                    q.TraceRayInline(Scene, RAY_FLAG_NONE, ~0, ray);\0D\0A                    \0D\0A                    while (q.Proceed())\0D\0A                    {\0D\0A                        if (q.CandidateType() == CANDIDATE_PROCEDURAL_PRIMITIVE)\0D\0A                        {\0D\0A                            q.CommitProceduralPrimitiveHit(1.0f);\0D\0A                            hitSomething = true;\0D\0A                            break;\0D\0A                        }\0D\0A                        \0D\0A                    }\0D\0A                    \0D\0A                    if (!hitSomething)\0D\0A                    {\0D\0A                        isOccluded = false;\0D\0A                        gsIsOccluded = 0;\0D\0A                    }\0D\0A                }\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        GroupMemoryBarrierWithGroupSync();\0D\0A            \0D\0A        if (gsIsOccluded == 0 && (aabbEnd > aabbStart))\0D\0A        {\0D\0A            uint nFaces = (aabbEnd - aabbStart) * 3;\0D\0A\0D\0A            uint startAddress = 0;\0D\0A            gVisibleFaceCounter.InterlockedAdd(0, nFaces, startAddress);\0D\0A\0D\0A            uint3 faceIdx = uint3(2, 4, 0);\0D\0A            \0D\0A            float3 faceDirections[6] =\0D\0A            {\0D\0A                float3(0.0f, 0.0f, -1.0f),\0D\0A                float3(0.0f, 0.0f, 1.0f),\0D\0A                float3(-1.0f, 0.0f, 0.0f),\0D\0A                float3(1.0f, 0.0f, 0.0f),\0D\0A                float3(0.0f, -1.0f, 0.0f),\0D\0A                float3(0.0f, 1.0f, 0.0f)\0D\0A            };\0D\0A            \0D\0A            for (uint i = aabbStart; i < aabbEnd; i++)\0D\0A            {\0D\0A                uint voxIdx = gAABBVoxelIndices[i];\0D\0A                \0D\0A                AABB voxAABB = gVoxelAABBBuffer[i];\0D\0A                float3 center = (voxAABB.Min + voxAABB.Max) * 0.5f;\0D\0A                \0D\0A                float3 toCamera = normalize(eyePos - center);\0D\0A                uint visibleFaces[3];\0D\0A                int faceCount = 0;\0D\0A\0D\0A                for (uint faceIdx = 0; faceIdx < 6; ++faceIdx)\0D\0A                {\0D\0A                    float3 normal = faceDirections[faceIdx]; // Get face normal for faceIdx\0D\0A                    if (dot(toCamera, normal) > 0)\0D\0A                    {\0D\0A                        visibleFaces[faceCount++] = faceIdx;\0D\0A                    }\0D\0A                }         \0D\0A                \0D\0A                // Up to 3 faces are visible at a time\0D\0A                gVisibleFaceIndices[startAddress + (i - aabbStart) * 3 + 0] = voxIdx * 6 + visibleFaces[0];\0D\0A                gVisibleFaceIndices[startAddress + (i - aabbStart) * 3 + 1] = voxIdx * 6 + visibleFaces[1];\0D\0A                gVisibleFaceIndices[startAddress + (i - aabbStart) * 3 + 2] = voxIdx * 6 + visibleFaces[2];\0D\0A            }\0D\0A\0D\0A\0D\0A\0D\0A            uint buffer0Max = startAddress + nFaces;\0D\0A            uint buffer1Max = (uint) ceil((buffer0Max) / 128.0f);\0D\0A            InterlockedMax(gDispatchIndirectBuffer[0].x, buffer0Max);\0D\0A            InterlockedMax(gDispatchIndirectBuffer[1].x, buffer1Max);\0D\0A\0D\0A\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A"}
!202 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    uint UseRTGI;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}\0D\0A\0D\0Afloat2 UnpackFloats16(uint packedUint)\0D\0A{\0D\0A    uint packedX = packedUint.x & 0xFFFF;\0D\0A    uint packedY = ((packedUint.x >> 16) & 0xFFFF);\0D\0A    \0D\0A    return float2(f16tof32(packedX), f16tof32(packedY));\0D\0A}\0D\0A\0D\0Auint PackFloats16(float2 floatsToPack)\0D\0A{\0D\0A    uint radX16 = f32tof16(floatsToPack.x);\0D\0A    uint radY16 = f32tof16(floatsToPack.y);\0D\0A        \0D\0A    uint packedRadX = (radY16 << 16) | radX16;\0D\0A    \0D\0A    return packedRadX;\0D\0A}\0D\0A"}
!203 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    float4x4 invShadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A"}
!204 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!205 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!206 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09UINT ClusterCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT ClusterCount;\0D\0A\09UINT FrameCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFacePenalty\0D\0A{\0D\0A\09UINT FaceCount;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 LightPosition;\0D\0A\09float LightIntensity;\0D\0A\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09float pad0;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClearBuffers\0D\0A{\0D\0A\09UINT ValueCount0;\0D\0A\09UINT ValueCount1;\0D\0A\09UINT ValueCount2;\0D\0A\09UINT ValueCount3;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLitVoxels\0D\0A{\0D\0A\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLerpRadiance\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09float accumulatedTime;\0D\0A\09float maxTime;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A\09XMUINT3 Center;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 Normal;\0D\0A\09UINT FirstDataIndex;\0D\0A\0D\0A\09XMFLOAT3 Color;\0D\0A\09UINT FragmentCount;\0D\0A\0D\0A\09XMFLOAT3 MinAABB;\0D\0A\09UINT NeighbourCount;\0D\0A\0D\0A\09XMFLOAT3 MaxAABB;\0D\0A\09float pad0;\0D\0A\0D\0A\09UINT ClusterNeighbours[64];\0D\0A};\0D\0A\0D\0Astruct ConstantBufferComputeNeighbour\0D\0A{\0D\0A\09UINT ClusterCount;\0D\0A\09UINT ElementsPerThread;\0D\0A\09UINT TotalComputationCount;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferGaussianFilter\0D\0A{\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09float pos0;\0D\0A\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT KernelSize;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!207 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0A#define IRRADIANCE_FIELD_MULTIPLIER 100000.0f\0D\0A#define MAX_DISTANCE_VOXEL_OFFSET 2.5f\0D\0A#define MINIMUM_ANGLE_VOXEL_OFFSET 0.342f\0D\0A\0D\0A#define CLUSTER_TO_VOXEL_FORM_FACTOR_ADD 14860\0D\0A#define VOXEL_TO_VOXEL_FORM_FACTOR_ADD 3\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A        return false;\0D\0A    \0D\0A    uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A    return all(result < gridDimension);\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 positionDA, float3 normalDB, float3 positionDB, float nSamples)\0D\0A{\0D\0A    float3 dAtoDiskDirection = positionDB - positionDA;\0D\0A    float distanceSq = dot(dAtoDiskDirection, dAtoDiskDirection);\0D\0A    dAtoDiskDirection = normalize(dAtoDiskDirection);\0D\0A    \0D\0A    float cosTheta1 = dot(normalDA, dAtoDiskDirection);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A    \0D\0A    float cosTheta2 = dot(normalDB, -dAtoDiskDirection);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    return (cosTheta1 * cosTheta2) / (PI * distanceSq + nSamples);\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 normalDB)\0D\0A{\0D\0A    float cosTheta1 = dot(normalDA, -normalDB);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A\0D\0A    float cosTheta2 = dot(normalDB, normalDB);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    // Avoid using distanceSq for directional lights as it is theoretically infinite\0D\0A    return (cosTheta1 * cosTheta2) / (PI * 1.0f);\0D\0A}\0D\0A\0D\0Afloat distanceSq(float3 a, float3 b)\0D\0A{\0D\0A    return dot(a - b, a - b);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!208 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CLightTransport_CS.hlsl"}
!209 = !{!"-E", !"CS", !"-T", !"cs_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CData\5CShadersLightTransport_CS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!210 = !{i32 1, i32 5}
!211 = !{i32 1, i32 6}
!212 = !{!"cs", i32 6, i32 5}
!213 = !{!214, !223, !231, null}
!214 = !{!215, !217, !219, !221}
!215 = !{i32 0, %"class.StructuredBuffer<AABB>"* undef, !"gVoxelAABBBuffer", i32 1, i32 0, i32 1, i32 12, i32 0, !216}
!216 = !{i32 1, i32 24}
!217 = !{i32 1, %"class.StructuredBuffer<ClusterAABBInfo>"* undef, !"gClusterAABBInfoBuffer", i32 1, i32 1, i32 1, i32 12, i32 0, !218}
!218 = !{i32 1, i32 32}
!219 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* undef, !"gAABBVoxelIndices", i32 1, i32 2, i32 1, i32 12, i32 0, !220}
!220 = !{i32 1, i32 4}
!221 = !{i32 3, %struct.RaytracingAccelerationStructure* undef, !"Scene", i32 2, i32 0, i32 1, i32 16, i32 0, !222}
!222 = !{i32 0, i32 4}
!223 = !{!224, !225, !226, !228, !230}
!224 = !{i32 0, %struct.RWByteAddressBuffer* undef, !"gVisibleFaceCounter", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!225 = !{i32 1, %"class.RWStructuredBuffer<unsigned int>"* undef, !"gVisibleFaceIndices", i32 0, i32 1, i32 1, i32 12, i1 false, i1 false, i1 false, !220}
!226 = !{i32 2, %"class.RWStructuredBuffer<vector<unsigned int, 3> >"* undef, !"gDispatchIndirectBuffer", i32 0, i32 2, i32 1, i32 12, i1 false, i1 false, i1 false, !227}
!227 = !{i32 1, i32 12}
!228 = !{i32 3, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* undef, !"gFaceRadianceBuffer", i32 1, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !229}
!229 = !{i32 1, i32 8}
!230 = !{i32 4, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* undef, !"gFaceFilteredRadianceBuffer", i32 1, i32 1, i32 1, i32 12, i1 false, i1 false, i1 false, !229}
!231 = !{!232, !233, !234}
!232 = !{i32 0, %hostlayout.cbVoxelCommons* undef, !"cbVoxelCommons", i32 0, i32 0, i32 1, i32 224, null}
!233 = !{i32 1, %cbFrustumCulling* undef, !"cbFrustumCulling", i32 0, i32 1, i32 1, i32 128, null}
!234 = !{i32 2, %hostlayout.cbCamera* undef, !"cbCamera", i32 0, i32 2, i32 1, i32 416, null}
!235 = !{i32 0, %struct.ConstantBufferFrustumCulling undef, !236, %"class.StructuredBuffer<unsigned int>" undef, !244, %"class.StructuredBuffer<AABB>" undef, !249, %struct.AABB undef, !254, %"class.StructuredBuffer<ClusterAABBInfo>" undef, !257, %struct.ClusterAABBInfo undef, !261, %"class.RWStructuredBuffer<unsigned int>" undef, !244, %"class.RWStructuredBuffer<vector<unsigned int, 3> >" undef, !264, %"class.RWStructuredBuffer<vector<unsigned int, 2> >" undef, !268, %cbFrustumCulling undef, !272, %hostlayout.struct.ConstantBufferVoxelCommons undef, !274, %hostlayout.cbVoxelCommons undef, !290, %hostlayout.struct.ConstantBufferCamera undef, !292, %hostlayout.cbCamera undef, !305}
!236 = !{i32 128, !237, !238, !239, !240, !241, !242, !243}
!237 = !{i32 6, !"FrustumPlanes", i32 3, i32 0, i32 7, i32 9}
!238 = !{i32 6, !"CameraPosition", i32 3, i32 96, i32 7, i32 9}
!239 = !{i32 6, !"AABBGroupCount", i32 3, i32 108, i32 7, i32 5}
!240 = !{i32 6, !"CurrentStep", i32 3, i32 112, i32 7, i32 5}
!241 = !{i32 6, !"VoxelCount", i32 3, i32 116, i32 7, i32 5}
!242 = !{i32 6, !"FaceCount", i32 3, i32 120, i32 7, i32 5}
!243 = !{i32 6, !"pad1", i32 3, i32 124, i32 7, i32 9}
!244 = !{i32 4, !245, !246}
!245 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!246 = !{i32 0, !247}
!247 = !{!248}
!248 = !{i32 0, i32 undef}
!249 = !{i32 28, !250, !251}
!250 = !{i32 6, !"h", i32 3, i32 0}
!251 = !{i32 0, !252}
!252 = !{!253}
!253 = !{i32 0, %struct.AABB undef}
!254 = !{i32 28, !255, !256}
!255 = !{i32 6, !"Min", i32 3, i32 0, i32 7, i32 9}
!256 = !{i32 6, !"Max", i32 3, i32 16, i32 7, i32 9}
!257 = !{i32 32, !250, !258}
!258 = !{i32 0, !259}
!259 = !{!260}
!260 = !{i32 0, %struct.ClusterAABBInfo undef}
!261 = !{i32 32, !255, !262, !256, !263}
!262 = !{i32 6, !"ClusterStartIndex", i32 3, i32 12, i32 7, i32 5}
!263 = !{i32 6, !"ClusterElementCount", i32 3, i32 28, i32 7, i32 5}
!264 = !{i32 12, !245, !265}
!265 = !{i32 0, !266}
!266 = !{!267}
!267 = !{i32 0, <3 x i32> undef}
!268 = !{i32 8, !245, !269}
!269 = !{i32 0, !270}
!270 = !{!271}
!271 = !{i32 0, <2 x i32> undef}
!272 = !{i32 128, !273}
!273 = !{i32 6, !"cbFrustumCulling", i32 3, i32 0}
!274 = !{i32 224, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !289}
!275 = !{i32 6, !"voxelTextureDimensions", i32 3, i32 0, i32 7, i32 5}
!276 = !{i32 6, !"totalTime", i32 3, i32 12, i32 7, i32 9}
!277 = !{i32 6, !"voxelCellSize", i32 3, i32 16, i32 7, i32 9}
!278 = !{i32 6, !"deltaTime", i32 3, i32 28, i32 7, i32 9}
!279 = !{i32 6, !"invVoxelTextureDimensions", i32 3, i32 32, i32 7, i32 9}
!280 = !{i32 6, !"StoreData", i32 3, i32 44, i32 7, i32 5}
!281 = !{i32 6, !"invVoxelCellSize", i32 3, i32 48, i32 7, i32 9}
!282 = !{i32 6, !"VoxelCount", i32 3, i32 60, i32 7, i32 5}
!283 = !{i32 6, !"SceneAABBMin", i32 3, i32 64, i32 7, i32 9}
!284 = !{i32 6, !"ClusterCount", i32 3, i32 76, i32 7, i32 5}
!285 = !{i32 6, !"SceneAABBMax", i32 3, i32 80, i32 7, i32 9}
!286 = !{i32 6, !"pad3", i32 3, i32 92, i32 7, i32 9}
!287 = !{i32 6, !"VoxelToWorld", i32 2, !288, i32 3, i32 96, i32 7, i32 9}
!288 = !{i32 4, i32 4, i32 2}
!289 = !{i32 6, !"WorldToVoxel", i32 2, !288, i32 3, i32 160, i32 7, i32 9}
!290 = !{i32 224, !291}
!291 = !{i32 6, !"cbVoxelCommons", i32 3, i32 0}
!292 = !{i32 416, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!293 = !{i32 6, !"view", i32 2, !288, i32 3, i32 0, i32 7, i32 9}
!294 = !{i32 6, !"invView", i32 2, !288, i32 3, i32 64, i32 7, i32 9}
!295 = !{i32 6, !"projection", i32 2, !288, i32 3, i32 128, i32 7, i32 9}
!296 = !{i32 6, !"invProjection", i32 2, !288, i32 3, i32 192, i32 7, i32 9}
!297 = !{i32 6, !"viewProjection", i32 2, !288, i32 3, i32 256, i32 7, i32 9}
!298 = !{i32 6, !"invViewProjection", i32 2, !288, i32 3, i32 320, i32 7, i32 9}
!299 = !{i32 6, !"eyePosition", i32 3, i32 384, i32 7, i32 9}
!300 = !{i32 6, !"nearPlane", i32 3, i32 396, i32 7, i32 9}
!301 = !{i32 6, !"farPlane", i32 3, i32 400, i32 7, i32 9}
!302 = !{i32 6, !"_pad0", i32 3, i32 404, i32 7, i32 9}
!303 = !{i32 6, !"_pad1", i32 3, i32 408, i32 7, i32 9}
!304 = !{i32 6, !"_pad2", i32 3, i32 412, i32 7, i32 9}
!305 = !{i32 416, !306}
!306 = !{i32 6, !"cbCamera", i32 3, i32 0}
!307 = !{i32 1, void ()* @CS, !308}
!308 = !{!309}
!309 = !{i32 0, !2, !2}
!310 = !{void ()* @CS, !"CS", null, !213, !311}
!311 = !{i32 0, i64 33554449, i32 4, !312}
!312 = !{i32 128, i32 1, i32 1}
!313 = !DILocation(line: 187, column: 21, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !1, line: 173, column: 17)
!315 = distinct !DILexicalBlock(scope: !316, file: !1, line: 172, column: 17)
!316 = distinct !DILexicalBlock(scope: !317, file: !1, line: 172, column: 17)
!317 = distinct !DILexicalBlock(scope: !318, file: !1, line: 167, column: 13)
!318 = distinct !DILexicalBlock(scope: !319, file: !1, line: 166, column: 13)
!319 = distinct !DILexicalBlock(scope: !320, file: !1, line: 166, column: 13)
!320 = distinct !DILexicalBlock(scope: !321, file: !1, line: 140, column: 9)
!321 = distinct !DILexicalBlock(scope: !322, file: !1, line: 139, column: 13)
!322 = distinct !DILexicalBlock(scope: !323, file: !1, line: 86, column: 5)
!323 = distinct !DILexicalBlock(scope: !324, file: !1, line: 85, column: 14)
!324 = distinct !DILexicalBlock(scope: !42, file: !1, line: 58, column: 9)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threadIdx", arg: 3, scope: !42, file: !1, line: 54, type: !14)
!326 = !DIExpression(DW_OP_bit_piece, 0, 32)
!327 = !DILocation(line: 54, column: 77, scope: !42)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupId", arg: 2, scope: !42, file: !1, line: 54, type: !14)
!329 = !DILocation(line: 54, column: 49, scope: !42)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !42, file: !1, line: 54, type: !14)
!331 = !DILocation(line: 54, column: 15, scope: !42)
!332 = !DILocation(line: 56, column: 10, scope: !42)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadLinearIndex", scope: !42, file: !1, line: 56, type: !40)
!334 = !DIExpression()
!335 = !DILocation(line: 58, column: 26, scope: !324)
!336 = !DILocation(line: 58, column: 38, scope: !324)
!337 = !DILocation(line: 58, column: 9, scope: !42)
!338 = !DILocation(line: 61, column: 51, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !1, line: 61, column: 13)
!340 = distinct !DILexicalBlock(scope: !324, file: !1, line: 59, column: 5)
!341 = !DILocation(line: 61, column: 31, scope: !339)
!342 = !DILocation(line: 61, column: 13, scope: !340)
!343 = !DILocation(line: 62, column: 13, scope: !339)
!344 = !DILocation(line: 65, column: 48, scope: !340)
!345 = !DILocation(line: 66, column: 56, scope: !340)
!346 = !DILocation(line: 68, column: 50, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !1, line: 68, column: 13)
!348 = !DILocation(line: 68, column: 60, scope: !347)
!349 = !DILocation(line: 68, column: 31, scope: !347)
!350 = !DILocation(line: 68, column: 13, scope: !340)
!351 = !DILocation(line: 70, column: 52, scope: !352)
!352 = distinct !DILexicalBlock(scope: !347, file: !1, line: 69, column: 9)
!353 = !DILocation(line: 71, column: 9, scope: !352)
!354 = !DILocation(line: 73, column: 51, scope: !355)
!355 = distinct !DILexicalBlock(scope: !340, file: !1, line: 73, column: 13)
!356 = !DILocation(line: 73, column: 31, scope: !355)
!357 = !DILocation(line: 73, column: 13, scope: !340)
!358 = !DILocation(line: 74, column: 13, scope: !355)
!359 = !DILocation(line: 76, column: 31, scope: !360)
!360 = distinct !DILexicalBlock(scope: !340, file: !1, line: 76, column: 13)
!361 = !DILocation(line: 76, column: 13, scope: !340)
!362 = !DILocation(line: 78, column: 13, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !1, line: 77, column: 9)
!364 = !DILocation(line: 79, column: 40, scope: !363)
!365 = !DILocation(line: 80, column: 40, scope: !363)
!366 = !DILocation(line: 81, column: 9, scope: !363)
!367 = !DILocation(line: 83, column: 5, scope: !340)
!368 = !DILocation(line: 85, column: 31, scope: !323)
!369 = !DILocation(line: 85, column: 43, scope: !323)
!370 = !DILocation(line: 85, column: 14, scope: !324)
!371 = !DILocation(line: 87, column: 43, scope: !372)
!372 = distinct !DILexicalBlock(scope: !322, file: !1, line: 87, column: 13)
!373 = !DILocation(line: 87, column: 23, scope: !372)
!374 = !DILocation(line: 87, column: 13, scope: !322)
!375 = !DILocation(line: 88, column: 13, scope: !372)
!376 = !DILocation(line: 92, column: 36, scope: !322)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbInfo", scope: !322, file: !1, line: 92, type: !169)
!378 = !DILocation(line: 92, column: 25, scope: !322)
!379 = !DIExpression(DW_OP_bit_piece, 32, 32)
!380 = !DIExpression(DW_OP_bit_piece, 64, 32)
!381 = !DIExpression(DW_OP_bit_piece, 96, 32)
!382 = !DIExpression(DW_OP_bit_piece, 128, 32)
!383 = !DIExpression(DW_OP_bit_piece, 160, 32)
!384 = !DIExpression(DW_OP_bit_piece, 192, 32)
!385 = !DIExpression(DW_OP_bit_piece, 224, 32)
!386 = !DILocation(line: 93, column: 44, scope: !322)
!387 = !DILocation(line: 93, column: 73, scope: !322)
!388 = !DILocation(line: 93, column: 31, scope: !322)
!389 = !DILocation(line: 93, column: 14, scope: !322)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbsPerThread", scope: !322, file: !1, line: 93, type: !40)
!391 = !DILocation(line: 94, column: 67, scope: !322)
!392 = !DILocation(line: 94, column: 53, scope: !322)
!393 = !DILocation(line: 94, column: 14, scope: !322)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbStart", scope: !322, file: !1, line: 94, type: !40)
!395 = !DILocation(line: 95, column: 83, scope: !322)
!396 = !DILocation(line: 95, column: 38, scope: !322)
!397 = !DILocation(line: 95, column: 24, scope: !322)
!398 = !DILocation(line: 95, column: 14, scope: !322)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbEnd", scope: !322, file: !1, line: 95, type: !40)
!400 = !DILocation(line: 98, column: 25, scope: !401)
!401 = distinct !DILexicalBlock(scope: !322, file: !1, line: 98, column: 13)
!402 = !DILocation(line: 98, column: 13, scope: !322)
!403 = !DILocation(line: 100, column: 32, scope: !404)
!404 = distinct !DILexicalBlock(scope: !401, file: !1, line: 99, column: 9)
!405 = !DILocation(line: 101, column: 26, scope: !404)
!406 = !DILocation(line: 103, column: 9, scope: !404)
!407 = !DILocation(line: 105, column: 9, scope: !322)
!408 = !DILocation(line: 107, column: 25, scope: !409)
!409 = distinct !DILexicalBlock(scope: !322, file: !1, line: 107, column: 13)
!410 = !DILocation(line: 107, column: 13, scope: !322)
!411 = !DILocation(line: 111, column: 35, scope: !412)
!412 = distinct !DILexicalBlock(scope: !409, file: !1, line: 108, column: 9)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frustumPlane", scope: !412, file: !1, line: 111, type: !31)
!414 = !DILocation(line: 111, column: 20, scope: !412)
!415 = !DILocation(line: 113, column: 20, scope: !412)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !412, file: !1, line: 113, type: !23)
!417 = !DILocation(line: 114, column: 19, scope: !412)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !412, file: !1, line: 114, type: !22)
!419 = !DILocation(line: 116, column: 20, scope: !412)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMin", scope: !412, file: !1, line: 116, type: !23)
!421 = !DILocation(line: 117, column: 20, scope: !412)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbMax", scope: !412, file: !1, line: 117, type: !23)
!423 = !DILocation(line: 121, column: 23, scope: !412)
!424 = !DILocation(line: 121, column: 13, scope: !412)
!425 = !DILocation(line: 122, column: 23, scope: !412)
!426 = !DILocation(line: 122, column: 13, scope: !412)
!427 = !DILocation(line: 123, column: 23, scope: !412)
!428 = !DILocation(line: 123, column: 13, scope: !412)
!429 = !DILocation(line: 120, column: 20, scope: !412)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "positiveVertex", scope: !412, file: !1, line: 120, type: !23)
!431 = !DILocation(line: 127, column: 17, scope: !432)
!432 = distinct !DILexicalBlock(scope: !412, file: !1, line: 127, column: 17)
!433 = !DILocation(line: 127, column: 45, scope: !432)
!434 = !DILocation(line: 127, column: 49, scope: !432)
!435 = !DILocation(line: 127, column: 17, scope: !412)
!436 = !DILocation(line: 129, column: 17, scope: !437)
!437 = distinct !DILexicalBlock(scope: !432, file: !1, line: 128, column: 13)
!438 = !DILocation(line: 130, column: 13, scope: !437)
!439 = !DILocation(line: 131, column: 9, scope: !412)
!440 = !DILocation(line: 133, column: 9, scope: !322)
!441 = !DILocation(line: 135, column: 80, scope: !322)
!442 = !DILocation(line: 135, column: 45, scope: !322)
!443 = !DILocation(line: 135, column: 25, scope: !322)
!444 = !DILocation(line: 135, column: 16, scope: !322)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eyePos", scope: !322, file: !1, line: 135, type: !23)
!446 = !DILocation(line: 139, column: 13, scope: !321)
!447 = !DILocation(line: 139, column: 32, scope: !321)
!448 = !DILocation(line: 139, column: 13, scope: !322)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "facesAndCorners", scope: !320, file: !1, line: 141, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1344, align: 32, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 14)
!453 = !DILocation(line: 141, column: 20, scope: !320)
!454 = !{i32 0, i32 96, i32 14}
!455 = !{i32 32, i32 96, i32 14}
!456 = !{i32 64, i32 96, i32 14}
!457 = !DILocation(line: 142, column: 13, scope: !320)
!458 = !DILocation(line: 161, column: 93, scope: !320)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !320, file: !1, line: 161, type: !460)
!460 = !DICompositeType(tag: DW_TAG_class_type, name: "RayQuery<260>", file: !1, line: 161, size: 32, align: 32, elements: !461, templateParams: !467)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !460, file: !1, line: 161, baseType: !8, size: 32, align: 32)
!463 = !DISubprogram(name: "RayQuery", scope: !460, file: !1, line: 161, type: !464, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!467 = !{!468}
!468 = !DITemplateValueParameter(name: "flags", type: !8, value: i32 260)
!469 = !DILocation(line: 164, column: 32, scope: !320)
!470 = !DILocation(line: 164, column: 45, scope: !320)
!471 = !DILocation(line: 164, column: 18, scope: !320)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isOccluded", scope: !320, file: !1, line: 164, type: !473)
!473 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!474 = !DILocation(line: 166, column: 23, scope: !319)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !319, file: !1, line: 166, type: !40)
!476 = !DILocation(line: 166, column: 40, scope: !318)
!477 = !DILocation(line: 166, column: 53, scope: !318)
!478 = !DILocation(line: 166, column: 50, scope: !318)
!479 = !DILocation(line: 166, column: 13, scope: !319)
!480 = !DILocation(line: 169, column: 34, scope: !317)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelAABB", scope: !317, file: !1, line: 169, type: !161)
!482 = !DILocation(line: 169, column: 22, scope: !317)
!483 = !DILocation(line: 170, column: 52, scope: !317)
!484 = !DILocation(line: 170, column: 69, scope: !317)
!485 = !DILocation(line: 170, column: 24, scope: !317)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbCenter", scope: !317, file: !1, line: 170, type: !23)
!487 = !DILocation(line: 172, column: 27, scope: !316)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !316, file: !1, line: 172, type: !40)
!489 = !DILocation(line: 172, column: 44, scope: !315)
!490 = !DILocation(line: 172, column: 41, scope: !315)
!491 = !DILocation(line: 172, column: 17, scope: !316)
!492 = !DILocation(line: 174, column: 35, scope: !314)
!493 = !DILocation(line: 174, column: 48, scope: !314)
!494 = !DILocation(line: 174, column: 32, scope: !314)
!495 = !DILocation(line: 176, column: 26, scope: !314)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitSomething", scope: !314, file: !1, line: 176, type: !473)
!497 = !DILocation(line: 177, column: 50, scope: !314)
!498 = !DILocation(line: 177, column: 48, scope: !314)
!499 = !DILocation(line: 177, column: 28, scope: !314)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !314, file: !1, line: 177, type: !23)
!501 = !DILocation(line: 178, column: 47, scope: !314)
!502 = !DILocation(line: 178, column: 28, scope: !314)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !314, file: !1, line: 178, type: !23)
!504 = !DILocation(line: 179, column: 38, scope: !314)
!505 = !DILocation(line: 179, column: 27, scope: !314)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distance", scope: !314, file: !1, line: 179, type: !22)
!507 = !DILocation(line: 182, column: 32, scope: !314)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !314, file: !1, line: 181, type: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 181, size: 256, align: 32, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !509, file: !1, line: 181, baseType: !24, size: 96, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !509, file: !1, line: 181, baseType: !22, size: 32, align: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !509, file: !1, line: 181, baseType: !24, size: 96, align: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !509, file: !1, line: 181, baseType: !22, size: 32, align: 32, offset: 224)
!515 = !DILocation(line: 181, column: 29, scope: !314)
!516 = !DILocation(line: 183, column: 47, scope: !314)
!517 = !DILocation(line: 183, column: 35, scope: !314)
!518 = !DILocation(line: 184, column: 30, scope: !314)
!519 = !DILocation(line: 185, column: 30, scope: !314)
!520 = !DILocation(line: 189, column: 28, scope: !314)
!521 = !DILocation(line: 189, column: 21, scope: !314)
!522 = !DILocation(line: 191, column: 29, scope: !523)
!523 = distinct !DILexicalBlock(scope: !524, file: !1, line: 191, column: 29)
!524 = distinct !DILexicalBlock(scope: !314, file: !1, line: 190, column: 21)
!525 = !DILocation(line: 191, column: 47, scope: !523)
!526 = !DILocation(line: 191, column: 29, scope: !524)
!527 = !DILocation(line: 193, column: 29, scope: !528)
!528 = distinct !DILexicalBlock(scope: !523, file: !1, line: 192, column: 25)
!529 = !DILocation(line: 194, column: 42, scope: !528)
!530 = !DILocation(line: 195, column: 29, scope: !528)
!531 = !DILocation(line: 200, column: 26, scope: !532)
!532 = distinct !DILexicalBlock(scope: !314, file: !1, line: 200, column: 25)
!533 = !DILocation(line: 200, column: 25, scope: !314)
!534 = !DILocation(line: 202, column: 36, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !1, line: 201, column: 21)
!536 = !DILocation(line: 203, column: 38, scope: !535)
!537 = !DILocation(line: 204, column: 21, scope: !535)
!538 = !DILocation(line: 205, column: 17, scope: !314)
!539 = !DILocation(line: 172, column: 57, scope: !315)
!540 = !DILocation(line: 172, column: 36, scope: !315)
!541 = !DILocation(line: 206, column: 13, scope: !317)
!542 = !DILocation(line: 166, column: 66, scope: !318)
!543 = !DILocation(line: 207, column: 9, scope: !320)
!544 = !DILocation(line: 209, column: 9, scope: !322)
!545 = !DILocation(line: 211, column: 13, scope: !546)
!546 = distinct !DILexicalBlock(scope: !322, file: !1, line: 211, column: 13)
!547 = !DILocation(line: 211, column: 26, scope: !546)
!548 = !DILocation(line: 211, column: 43, scope: !546)
!549 = !DILocation(line: 211, column: 31, scope: !546)
!550 = !DILocation(line: 211, column: 13, scope: !322)
!551 = !DILocation(line: 213, column: 36, scope: !552)
!552 = distinct !DILexicalBlock(scope: !546, file: !1, line: 212, column: 9)
!553 = !DILocation(line: 213, column: 49, scope: !552)
!554 = !DILocation(line: 213, column: 18, scope: !552)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nFaces", scope: !552, file: !1, line: 213, type: !40)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startAddress", scope: !552, file: !1, line: 215, type: !40)
!557 = !DILocation(line: 215, column: 18, scope: !552)
!558 = !DILocation(line: 216, column: 13, scope: !552)
!559 = !DILocation(line: 218, column: 19, scope: !552)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDirections", scope: !552, file: !1, line: 220, type: !561)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 576, align: 32, elements: !125)
!562 = !DILocation(line: 220, column: 20, scope: !552)
!563 = !{i32 0, i32 96, i32 6}
!564 = !{i32 32, i32 96, i32 6}
!565 = !{i32 64, i32 96, i32 6}
!566 = !DILocation(line: 221, column: 13, scope: !552)
!567 = !DILocation(line: 230, column: 23, scope: !568)
!568 = distinct !DILexicalBlock(scope: !552, file: !1, line: 230, column: 13)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !568, file: !1, line: 230, type: !40)
!570 = !DILocation(line: 230, column: 40, scope: !571)
!571 = distinct !DILexicalBlock(scope: !568, file: !1, line: 230, column: 13)
!572 = !DILocation(line: 230, column: 13, scope: !568)
!573 = !DILocation(line: 232, column: 31, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !1, line: 231, column: 13)
!575 = !DILocation(line: 232, column: 22, scope: !574)
