#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 3ee72d7e610a52266044a3d39dc82948.pdb
; shader hash: 3ee72d7e610a52266044a3d39dc82948
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           float pad1;                               ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           float pad2;                               ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80
;           float pad3;                               ; Offset:   92
;           column_major float4x4 VoxelToWorld;       ; Offset:   96
;           column_major float4x4 WorldToVoxel;       ; Offset:  160
;       
;       } cbVoxelCommons;                             ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !65, globals: !257)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !33, !40, !8, !48, !57}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 84, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 84, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x3", file: !1, line: 119, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 3>", file: !1, line: 119, size: 192, align: 32, elements: !24, templateParams: !31)
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!31 = !{!18, !32, !21}
!32 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 84, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 84, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 84, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!18, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!18, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 117, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 117, size: 96, align: 32, elements: !50, templateParams: !55)
!50 = !{!51, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 117, baseType: !52, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 117, baseType: !52, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !49, file: !1, line: 117, baseType: !52, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !{!56, !47}
!56 = !DITemplateTypeParameter(name: "element", type: !52)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 7, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 7, size: 96, align: 32, elements: !59, templateParams: !63)
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 7, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 7, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !58, file: !1, line: 7, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !{!64, !47}
!64 = !DITemplateTypeParameter(name: "element", type: !20)
!65 = !{!66, !76, !106, !119, !122, !125, !128, !131, !132, !142, !180, !183, !186, !189, !190, !191, !194, !201, !206, !209, !212, !216, !220, !223, !224, !227, !246, !249, !256}
!66 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NV?$vector@M$02@@0Y01V1@AIAM2@Z", scope: !67, file: !67, line: 4, type: !68, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/RaytracingUtils.hlsli", directory: "")
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !40, !40, !71, !74, !74}
!70 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, align: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 2)
!74 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!76 = !DISubprogram(name: "GetPBRMaterial", linkageName: "\01?GetPBRMaterial@@YA?AUPBRMaterial@@UGenericMaterial@@@Z", scope: !77, file: !77, line: 55, type: !78, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !96}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBRMaterial", file: !77, line: 32, size: 352, align: 32, elements: !81)
!81 = !{!82, !92, !93, !94, !95}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "baseColor", scope: !80, file: !77, line: 34, baseType: !83, size: 128, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 34, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 34, size: 128, align: 32, elements: !85, templateParams: !90)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !84, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !84, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !84, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !84, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!90 = !{!18, !91}
!91 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !80, file: !77, line: 35, baseType: !83, size: 128, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !80, file: !77, line: 37, baseType: !8, size: 32, align: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !80, file: !77, line: 38, baseType: !8, size: 32, align: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !80, file: !77, line: 39, baseType: !8, size: 32, align: 32, offset: 320)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericMaterial", file: !77, line: 18, size: 640, align: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "float4_0", scope: !96, file: !77, line: 20, baseType: !83, size: 128, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "float4_1", scope: !96, file: !77, line: 21, baseType: !83, size: 128, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "float4_2", scope: !96, file: !77, line: 22, baseType: !83, size: 128, align: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "float4_3", scope: !96, file: !77, line: 23, baseType: !83, size: 128, align: 32, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "float_0", scope: !96, file: !77, line: 25, baseType: !8, size: 32, align: 32, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "float_1", scope: !96, file: !77, line: 26, baseType: !8, size: 32, align: 32, offset: 544)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "float_2", scope: !96, file: !77, line: 27, baseType: !8, size: 32, align: 32, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "float_3", scope: !96, file: !77, line: 28, baseType: !8, size: 32, align: 32, offset: 608)
!106 = !DISubprogram(name: "GetPhongMaterial", linkageName: "\01?GetPhongMaterial@@YA?AUPhongMaterial@@UGenericMaterial@@@Z", scope: !77, file: !77, line: 69, type: !107, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !96}
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhongMaterial", file: !77, line: 42, size: 640, align: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseColor", scope: !109, file: !77, line: 44, baseType: !83, size: 128, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !109, file: !77, line: 45, baseType: !83, size: 128, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "specularColor", scope: !109, file: !77, line: 46, baseType: !83, size: 128, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ambientColor", scope: !109, file: !77, line: 47, baseType: !83, size: 128, align: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !109, file: !77, line: 49, baseType: !8, size: 32, align: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !109, file: !77, line: 50, baseType: !8, size: 32, align: 32, offset: 544)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !109, file: !77, line: 51, baseType: !8, size: 32, align: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "refractiveIndex", scope: !109, file: !77, line: 52, baseType: !8, size: 32, align: 32, offset: 608)
!119 = !DISubprogram(name: "CalculateTBN", linkageName: "\01?CalculateTBN@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@0V?$vector@M$01@@@Z", scope: !77, file: !77, line: 111, type: !120, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!120 = !DISubroutineType(types: !121)
!121 = !{!4, !40, !40, !33}
!122 = !DISubprogram(name: "ComputeTwoChannelNormal", linkageName: "\01?ComputeTwoChannelNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !77, file: !77, line: 127, type: !123, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!40, !33}
!125 = !DISubprogram(name: "signNotZero", linkageName: "\01?signNotZero@@YA?AV?$vector@M$01@@V1@@Z", scope: !77, file: !77, line: 143, type: !126, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!33, !33}
!128 = !DISubprogram(name: "PackNormal", linkageName: "\01?PackNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !77, file: !77, line: 148, type: !129, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!33, !40}
!131 = !DISubprogram(name: "UnpackNormal", linkageName: "\01?UnpackNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !77, file: !77, line: 156, type: !123, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubprogram(name: "Spec", linkageName: "\01?Spec@@YAMV?$vector@M$02@@USurfaceData@@M@Z", scope: !77, file: !77, line: 165, type: !133, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !40, !135, !8}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceData", file: !77, line: 95, size: 416, align: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !135, file: !77, line: 97, baseType: !40, size: 96, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !135, file: !77, line: 98, baseType: !40, size: 96, align: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "NdotV", scope: !135, file: !77, line: 99, baseType: !8, size: 32, align: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "c_diff", scope: !135, file: !77, line: 100, baseType: !40, size: 96, align: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "c_spec", scope: !135, file: !77, line: 101, baseType: !40, size: 96, align: 32, offset: 320)
!142 = !DISubprogram(name: "ComputeDirectionalLight", linkageName: "\01?ComputeDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@MM@Z", scope: !77, file: !77, line: 174, type: !143, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false)
!143 = !DISubroutineType(types: !144)
!144 = !{!40, !145, !135, !8, !8}
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !77, line: 3, size: 1024, align: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !176, !177, !178, !179}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !145, file: !77, line: 5, baseType: !40, size: 96, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !145, file: !77, line: 6, baseType: !8, size: 32, align: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !145, file: !77, line: 7, baseType: !40, size: 96, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !145, file: !77, line: 8, baseType: !8, size: 32, align: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !145, file: !77, line: 9, baseType: !40, size: 96, align: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !145, file: !77, line: 10, baseType: !8, size: 32, align: 32, offset: 352)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !145, file: !77, line: 11, baseType: !154, size: 512, align: 32, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 171, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 171, size: 512, align: 32, elements: !156, templateParams: !173)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !155, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!173 = !{!18, !174, !175}
!174 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!175 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !145, file: !77, line: 12, baseType: !20, size: 32, align: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !145, file: !77, line: 13, baseType: !8, size: 32, align: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !145, file: !77, line: 14, baseType: !8, size: 32, align: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !145, file: !77, line: 15, baseType: !8, size: 32, align: 32, offset: 992)
!180 = !DISubprogram(name: "FresnelShlick", linkageName: "\01?FresnelShlick@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !77, file: !77, line: 195, type: !181, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false)
!181 = !DISubroutineType(types: !182)
!182 = !{!40, !40, !40, !8}
!183 = !DISubprogram(name: "Diffuse_Burley", linkageName: "\01?Diffuse_Burley@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !77, file: !77, line: 201, type: !184, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false)
!184 = !DISubroutineType(types: !185)
!185 = !{!40, !135, !8, !8, !8}
!186 = !DISubprogram(name: "Specular_D_GGX", linkageName: "\01?Specular_D_GGX@@YAMUSurfaceData@@MM@Z", scope: !77, file: !77, line: 208, type: !187, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DISubroutineType(types: !188)
!188 = !{!8, !135, !8, !8}
!189 = !DISubprogram(name: "G_Shlick_Smith_Hable", linkageName: "\01?G_Shlick_Smith_Hable@@YAMUSurfaceData@@MM@Z", scope: !77, file: !77, line: 217, type: !187, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false)
!190 = !DISubprogram(name: "Specular_BRDF", linkageName: "\01?Specular_BRDF@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !77, file: !77, line: 222, type: !184, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false)
!191 = !DISubprogram(name: "PBRDirectionalLight", linkageName: "\01?PBRDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@M@Z", scope: !77, file: !77, line: 238, type: !192, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false)
!192 = !DISubroutineType(types: !193)
!193 = !{!40, !145, !135, !8}
!194 = !DISubprogram(name: "CalcShadowFactor", linkageName: "\01?CalcShadowFactor@@YAMV?$Texture2D@V?$vector@M$03@@@@V?$vector@M$03@@@Z", scope: !195, file: !195, line: 78, type: !196, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!195 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!196 = !DISubroutineType(types: !197)
!197 = !{!8, !198, !83}
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 255, size: 160, align: 32, elements: !2, templateParams: !199)
!199 = !{!200}
!200 = !DITemplateTypeParameter(name: "element", type: !84)
!201 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !202, file: !202, line: 74, type: !203, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!202 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!203 = !DISubroutineType(types: !204)
!204 = !{!48, !205, !48}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 86, baseType: !52)
!206 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !202, file: !202, line: 83, type: !207, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false)
!207 = !DISubroutineType(types: !208)
!208 = !{!205, !48, !48}
!209 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !202, file: !202, line: 91, type: !210, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!70, !48, !57, !48}
!212 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !202, file: !202, line: 102, type: !213, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!213 = !DISubroutineType(types: !214)
!214 = !{!70, !205, !215}
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 100, size: 32, align: 32, elements: !2)
!216 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !202, file: !202, line: 113, type: !217, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false)
!217 = !DISubroutineType(types: !218)
!218 = !{!70, !205, !219}
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 111, size: 32, align: 32, elements: !2)
!220 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !202, file: !202, line: 124, type: !221, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{!70, !48, !48, !215}
!223 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !202, file: !202, line: 130, type: !217, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!224 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NV?$vector@I$02@@0URWByteAddressBuffer@@@Z", scope: !202, file: !202, line: 145, type: !225, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DISubroutineType(types: !226)
!226 = !{!70, !48, !48, !219}
!227 = !DISubprogram(name: "GetFaceEdgeMidpoints", linkageName: "\01?GetFaceEdgeMidpoints@@YA?AV?$matrix@M$03$02@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 40, type: !228, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !40, !40}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 149, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 149, size: 384, align: 32, elements: !232, templateParams: !245)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !231, file: !1, line: 149, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!245 = !{!18, !174, !21}
!246 = !DISubprogram(name: "ShadowRaygen", linkageName: "\01?ShadowRaygen@@YAXXZ", scope: !1, file: !1, line: 80, type: !247, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowRaygen@@YAXXZ")
!247 = !DISubroutineType(types: !248)
!248 = !{null}
!249 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 154, type: !250, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z")
!250 = !DISubroutineType(types: !251)
!251 = !{null, !252}
!252 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 30, size: 32, align: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "voxelIdx", scope: !253, file: !1, line: 32, baseType: !205, size: 32, align: 32)
!256 = !DISubprogram(name: "ShadowIntersection", linkageName: "\01?ShadowIntersection@@YAXXZ", scope: !1, file: !1, line: 160, type: !247, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowIntersection@@YAXXZ")
!257 = !{!258, !260, !261, !262, !264, !265, !267, !268, !269, !270, !272, !274, !275, !276, !277, !301, !309, !311, !314, !315, !316, !317, !327, !328, !329, !338, !339, !340, !342, !344}
!258 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !66, file: !67, line: 18, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!260 = !DIGlobalVariable(name: "PI", scope: !0, file: !77, line: 104, type: !259, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!261 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !77, line: 106, type: !259, isLocal: true, isDefinition: true, variable: float 0x3EB0C6F7A0000000)
!262 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 137, type: !263, isLocal: true, isDefinition: true, variable: i32 4)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!264 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 137, type: !263, isLocal: true, isDefinition: true, variable: i32 8)
!265 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !77, line: 86, type: !266, isLocal: true, isDefinition: true)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!267 = !DIGlobalVariable(name: "PI", scope: !0, file: !77, line: 104, type: !259, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !77, line: 105, type: !259, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !77, line: 106, type: !259, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !195, line: 47, type: !271, isLocal: false, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 47, size: 32, align: 32, elements: !2)
!272 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !195, line: 48, type: !273, isLocal: false, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!274 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !202, line: 8, type: !263, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariable(name: "cos30", scope: !0, file: !202, line: 9, type: !259, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariable(name: "cos25", scope: !0, file: !202, line: 10, type: !259, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 9, type: !278, isLocal: false, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 9, size: 32, align: 32, elements: !2, templateParams: !279)
!279 = !{!280}
!280 = !DITemplateTypeParameter(name: "T", type: !281)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !282, line: 26, size: 1792, align: 32, elements: !283)
!282 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!283 = !{!284, !285, !286, !289, !290, !291, !293, !294, !295, !296, !297, !298, !299, !300}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !281, file: !282, line: 28, baseType: !48, size: 96, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !281, file: !282, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !281, file: !282, line: 31, baseType: !287, size: 96, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !288, line: 4, baseType: !40)
!288 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !281, file: !282, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !281, file: !282, line: 34, baseType: !287, size: 96, align: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !281, file: !282, line: 35, baseType: !292, size: 32, align: 32, offset: 352)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !288, line: 8, baseType: !205)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !281, file: !282, line: 37, baseType: !287, size: 96, align: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !281, file: !282, line: 38, baseType: !8, size: 32, align: 32, offset: 480)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !281, file: !282, line: 40, baseType: !287, size: 96, align: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !281, file: !282, line: 41, baseType: !8, size: 32, align: 32, offset: 608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !281, file: !282, line: 43, baseType: !287, size: 96, align: 32, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !281, file: !282, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !281, file: !282, line: 46, baseType: !154, size: 512, align: 32, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !281, file: !282, line: 47, baseType: !154, size: 512, align: 32, offset: 1280)
!301 = !DIGlobalVariable(name: "cbRaytracingShadows", linkageName: "\01?cbRaytracingShadows@@3U?$ConstantBuffer@UConstantBufferRTShadows@@@@A", scope: !0, file: !1, line: 10, type: !302, isLocal: false, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferRTShadows>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !303)
!303 = !{!304}
!304 = !DITemplateTypeParameter(name: "T", type: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferRTShadows", file: !282, line: 88, size: 128, align: 32, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !305, file: !282, line: 90, baseType: !287, size: 96, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !305, file: !282, line: 91, baseType: !292, size: 32, align: 32, offset: 96)
!309 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 12, type: !310, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 12, size: 32, align: 32, elements: !2)
!311 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 14, type: !312, isLocal: false, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !313)
!313 = !{!56}
!314 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 15, type: !312, isLocal: false, isDefinition: true)
!315 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 16, type: !312, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !312, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A")
!317 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 19, type: !318, isLocal: false, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 19, size: 256, align: 32, elements: !2, templateParams: !319)
!319 = !{!320}
!320 = !DITemplateTypeParameter(name: "element", type: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !202, line: 65, size: 256, align: 32, elements: !322)
!322 = !{!323, !324, !325, !326}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !321, file: !202, line: 67, baseType: !48, size: 96, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !321, file: !202, line: 68, baseType: !205, size: 32, align: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !321, file: !202, line: 70, baseType: !40, size: 96, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !321, file: !202, line: 71, baseType: !205, size: 32, align: 32, offset: 224)
!327 = !DIGlobalVariable(name: "gNextVoxelLinkedList", linkageName: "\01?gNextVoxelLinkedList@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !312, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 21, type: !312, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A")
!329 = !DIGlobalVariable(name: "gVoxelFaceDataBuffer", linkageName: "\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 23, type: !330, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<unsigned int, 2> >"* @"\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A")
!330 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 23, size: 64, align: 32, elements: !2, templateParams: !331)
!331 = !{!332}
!332 = !DITemplateTypeParameter(name: "element", type: !333)
!333 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 100, size: 64, align: 32, elements: !334, templateParams: !337)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !333, file: !1, line: 100, baseType: !52, size: 32, align: 32, flags: DIFlagPublic)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !333, file: !1, line: 100, baseType: !52, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!337 = !{!56, !39}
!338 = !DIGlobalVariable(name: "gVoxelLitBuffer", linkageName: "\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 25, type: !219, isLocal: false, isDefinition: true, variable: %struct.RWByteAddressBuffer* @"\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A")
!339 = !DIGlobalVariable(name: "gClusterLitBuffer", linkageName: "\01?gClusterLitBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !219, isLocal: false, isDefinition: true, variable: %struct.RWByteAddressBuffer* @"\01?gClusterLitBuffer@@3URWByteAddressBuffer@@A")
!340 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !77, line: 86, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !266, size: 32, align: 4, offset: 32)
!342 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !77, line: 86, type: !343, isLocal: false, isDefinition: true)
!343 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !266, size: 32, align: 4, offset: 64)
!344 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !77, line: 86, type: !345, isLocal: false, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !266, size: 32, align: 4)
!346 = !{i32 2, !"Dwarf Version", i32 4}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!349 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl", !"#ifndef RAYTRACING_SHADOW_HLSL\0D\0A#define RAYTRACING_SHADOW_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferRTShadows> cbRaytracingShadows : register(b1);\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space1);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space1);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space1);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space1);\0D\0A\0D\0AStructuredBuffer<ClusterData> gClusterDataBuffer : register(t0, space2);\0D\0AStructuredBuffer<uint> gNextVoxelLinkedList : register(t1, space2);\0D\0AStructuredBuffer<uint> gVoxelAssignmentMap : register(t2, space2);\0D\0A\0D\0AStructuredBuffer<uint2> gVoxelFaceDataBuffer : register(t0, space3);\0D\0A\0D\0ARWByteAddressBuffer gVoxelLitBuffer : register(u0, space0);\0D\0ARWByteAddressBuffer gClusterLitBuffer : register(u1, space0);\0D\0A\0D\0A\0D\0A\0D\0Astruct Payload\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Astruct Attributes\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Afloat4x3 GetFaceEdgeMidpoints(float3 voxelCenter, float3 faceDirection)\0D\0A{\0D\0A    // Define the half-size offsets.\0D\0A    float3 right = float3(0.5f, 0.0f, 0.0f);\0D\0A    float3 up = float3(0.0f, 0.5f, 0.0f);\0D\0A    float3 forward = float3(0.0f, 0.0f, 0.5f);\0D\0A\0D\0A    // Initialize a float3x4 to store the edge midpoints.\0D\0A    float4x3 edgeMidpoints;\0D\0A\0D\0A    // Determine midpoints based on face direction.\0D\0A    if (faceDirection.x != 0.0f)\0D\0A    {\0D\0A        // Left or right face.\0D\0A        edgeMidpoints[0] = faceDirection - up;\0D\0A        edgeMidpoints[1] = faceDirection + up;\0D\0A        edgeMidpoints[2] = faceDirection - forward;\0D\0A        edgeMidpoints[3] = faceDirection + forward;\0D\0A    }\0D\0A    else if (faceDirection.y != 0.0f)\0D\0A    {\0D\0A        // Top or bottom face.\0D\0A        edgeMidpoints[0] = faceDirection - right;\0D\0A        edgeMidpoints[1] = faceDirection + right;\0D\0A        edgeMidpoints[2] = faceDirection - forward;\0D\0A        edgeMidpoints[3] = faceDirection + forward;\0D\0A    }\0D\0A    else if (faceDirection.z != 0.0f)\0D\0A    {\0D\0A        // Front or back face.\0D\0A        edgeMidpoints[0] = faceDirection - right;\0D\0A        edgeMidpoints[1] = faceDirection + right;\0D\0A        edgeMidpoints[2] = faceDirection - up;\0D\0A        edgeMidpoints[3] = faceDirection + up;\0D\0A    }\0D\0A\0D\0A    return edgeMidpoints;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid ShadowRaygen()\0D\0A{\0D\0A    float3 faceDirection[6] =\0D\0A    {\0D\0A        float3(0.0f, 0.0f, -0.5f),\0D\0A        float3(0.0f, 0.0f, 0.5f),\0D\0A        float3(-0.5f, 0.0f, 0.0f),\0D\0A        float3(0.5f, 0.0f, 0.0f),\0D\0A        float3(0.0f, -0.5f, 0.0f),\0D\0A        float3(0.0f, 0.5f, 0.0f),\0D\0A    };\0D\0A    \0D\0A    uint3 dispatchIdx = DispatchRaysIndex();\0D\0A    uint3 dispatchDim = DispatchRaysDimensions();\0D\0A    \0D\0A    uint faceIdx = GetLinearCoord(dispatchIdx, dispatchDim);\0D\0A    \0D\0A    if (faceIdx >= cbRaytracingShadows.FaceCount)\0D\0A        return;\0D\0A    \0D\0A    uint2 faceData = gVoxelFaceDataBuffer[faceIdx];\0D\0A    \0D\0A    float3 voxelCenter = float3(GetVoxelPosition(gVoxelHashedCompactBuffer[faceData.x], cbVoxelCommons.voxelTextureDimensions));\0D\0A    \0D\0A    \0D\0A    // Define ray starting position and other parameters\0D\0A    RayDesc ray;\0D\0A    // A face is half a voxel distant from the center, so we divide the face direction by 2. We also multiply by 1.1 to add\0D\0A    // a small offset to avoid self intersection\0D\0A    ray.Direction = -cbRaytracingShadows.LightDirection;\0D\0A    // Start the ray slightly away from the origin \0D\0A    // TODO: check if this value is okay or can be improved\0D\0A    ray.TMin = 0.5f; \0D\0A    // Chebyshev Distance (1.74 is an approximation of sqrt(3));\0D\0A    // This is an approximation of the scene diagonal, which is the maximum distance a ray can travel for a hit.\0D\0A    ray.TMax = max(max(cbVoxelCommons.voxelTextureDimensions.x, cbVoxelCommons.voxelTextureDimensions.y), cbVoxelCommons.voxelTextureDimensions.z);\0D\0A    ray.TMax *= 1.74f; \0D\0A    Payload rayPayload = { 1 }; // Payload to store the index\0D\0A    \0D\0A    float3 points[5];\0D\0A    float3 faceDir = faceDirection[faceData.y];\0D\0A    points[0] = voxelCenter + faceDir;\0D\0A    {\0D\0A        float4x3 edgeMidPoints = GetFaceEdgeMidpoints(voxelCenter, faceDir);\0D\0A        points[1] = voxelCenter + edgeMidPoints[0];\0D\0A        points[2] = voxelCenter + edgeMidPoints[1];\0D\0A        points[3] = voxelCenter + edgeMidPoints[2];\0D\0A        points[4] = voxelCenter + edgeMidPoints[3];\0D\0A    }\0D\0A\0D\0A    // Not much difference when tracing a ray from only the center of the face\0D\0A    // Or also from the edges midpoints.\0D\0A    for (uint i = 0; i < 1; i++)\0D\0A    {\0D\0A        ray.Origin = points[i];\0D\0A        if (!IsVoxelPresent(faceData.x, gVoxelLitBuffer))\0D\0A        {\0D\0A            TraceRay(Scene, RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER, ~0, 0, 0, 0, ray, rayPayload);\0D\0A            if (rayPayload.voxelIdx == 0)\0D\0A            {\0D\0A                SetVoxelPresence(faceData.x, gVoxelLitBuffer);\0D\0A                SetVoxelPresence(gVoxelAssignmentMap[faceData.x], gClusterLitBuffer);\0D\0A                break;\0D\0A            }\0D\0A        }\0D\0A        else\0D\0A        {\0D\0A            break;\0D\0A        }\0D\0A    }\0D\0A    \0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid ShadowMiss(inout Payload rayPayload)\0D\0A{\0D\0A    rayPayload.voxelIdx = 0;\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid ShadowIntersection()\0D\0A{\0D\0A    Attributes attr = { 1 };\0D\0A    ReportHit(1.0f, 0, attr); // Report the hit with hitT as tMin\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_SHADOW_HLSL\0D\0A"}
!350 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}"}
!351 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A"}
!352 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!353 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!354 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09float pad2;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09XMUINT3 DispatchSize;\0D\0A\09UINT NumberOfFaces;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!355 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A    uint3 Center;\0D\0A    uint VoxelCount;\0D\0A    \0D\0A    float3 Normal;\0D\0A    uint FirstDataIndex;\0D\0A};\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A        return false;\0D\0A    \0D\0A    uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A    return all(result < gridDimension);\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!356 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl"}
!357 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CData\5CShadersRaytracingShadow.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!358 = !{i32 1, i32 5}
!359 = !{i32 1, i32 6}
!360 = !{!"lib", i32 6, i32 5}
!361 = !{!362, !370, !373, null}
!362 = !{!363, !365, !367, !368}
!363 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !364}
!364 = !{i32 0, i32 4}
!365 = !{i32 1, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", !"gVoxelHashedCompactBuffer", i32 1, i32 3, i32 1, i32 12, i32 0, !366}
!366 = !{i32 1, i32 4}
!367 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", !"gVoxelAssignmentMap", i32 2, i32 2, i32 1, i32 12, i32 0, !366}
!368 = !{i32 3, %"class.StructuredBuffer<vector<unsigned int, 2> >"* @"\01?gVoxelFaceDataBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", !"gVoxelFaceDataBuffer", i32 3, i32 0, i32 1, i32 12, i32 0, !369}
!369 = !{i32 1, i32 8}
!370 = !{!371, !372}
!371 = !{i32 0, %struct.RWByteAddressBuffer* @"\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", !"gVoxelLitBuffer", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!372 = !{i32 1, %struct.RWByteAddressBuffer* @"\01?gClusterLitBuffer@@3URWByteAddressBuffer@@A", !"gClusterLitBuffer", i32 0, i32 1, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!373 = !{!374, !375}
!374 = !{i32 0, %hostlayout.cbVoxelCommons* @cbVoxelCommons_legacy, !"cbVoxelCommons", i32 0, i32 0, i32 1, i32 224, null}
!375 = !{i32 1, %cbRaytracingShadows* @cbRaytracingShadows, !"cbRaytracingShadows", i32 0, i32 1, i32 1, i32 16, null}
!376 = !{i32 0, %struct.PBRMaterial undef, !377, %struct.GenericMaterial undef, !383, %struct.PhongMaterial undef, !392, %struct.SurfaceData undef, !400, %struct.Light undef, !406, %struct.ConstantBufferVoxelCommons undef, !419, %struct.ConstantBufferRTShadows undef, !434, %"class.StructuredBuffer<unsigned int>" undef, !437, %"class.StructuredBuffer<ClusterData>" undef, !442, %struct.ClusterData undef, !447, %"class.StructuredBuffer<vector<unsigned int, 2> >" undef, !452, %struct.RayDesc undef, !456, %struct.Payload undef, !461, %struct.Attributes undef, !461, %cbRaytracingShadows undef, !463, %hostlayout.struct.ConstantBufferVoxelCommons undef, !419, %hostlayout.cbVoxelCommons undef, !465}
!377 = !{i32 44, !378, !379, !380, !381, !382}
!378 = !{i32 6, !"baseColor", i32 3, i32 0, i32 7, i32 9}
!379 = !{i32 6, !"emissiveColor", i32 3, i32 16, i32 7, i32 9}
!380 = !{i32 6, !"metallic", i32 3, i32 32, i32 7, i32 9}
!381 = !{i32 6, !"roughness", i32 3, i32 36, i32 7, i32 9}
!382 = !{i32 6, !"normalScale", i32 3, i32 40, i32 7, i32 9}
!383 = !{i32 80, !384, !385, !386, !387, !388, !389, !390, !391}
!384 = !{i32 6, !"float4_0", i32 3, i32 0, i32 7, i32 9}
!385 = !{i32 6, !"float4_1", i32 3, i32 16, i32 7, i32 9}
!386 = !{i32 6, !"float4_2", i32 3, i32 32, i32 7, i32 9}
!387 = !{i32 6, !"float4_3", i32 3, i32 48, i32 7, i32 9}
!388 = !{i32 6, !"float_0", i32 3, i32 64, i32 7, i32 9}
!389 = !{i32 6, !"float_1", i32 3, i32 68, i32 7, i32 9}
!390 = !{i32 6, !"float_2", i32 3, i32 72, i32 7, i32 9}
!391 = !{i32 6, !"float_3", i32 3, i32 76, i32 7, i32 9}
!392 = !{i32 80, !393, !379, !394, !395, !396, !397, !398, !399}
!393 = !{i32 6, !"diffuseColor", i32 3, i32 0, i32 7, i32 9}
!394 = !{i32 6, !"specularColor", i32 3, i32 32, i32 7, i32 9}
!395 = !{i32 6, !"ambientColor", i32 3, i32 48, i32 7, i32 9}
!396 = !{i32 6, !"normalScale", i32 3, i32 64, i32 7, i32 9}
!397 = !{i32 6, !"opacity", i32 3, i32 68, i32 7, i32 9}
!398 = !{i32 6, !"shininess", i32 3, i32 72, i32 7, i32 9}
!399 = !{i32 6, !"refractiveIndex", i32 3, i32 76, i32 7, i32 9}
!400 = !{i32 60, !401, !402, !403, !404, !405}
!401 = !{i32 6, !"N", i32 3, i32 0, i32 7, i32 9}
!402 = !{i32 6, !"V", i32 3, i32 16, i32 7, i32 9}
!403 = !{i32 6, !"NdotV", i32 3, i32 28, i32 7, i32 9}
!404 = !{i32 6, !"c_diff", i32 3, i32 32, i32 7, i32 9}
!405 = !{i32 6, !"c_spec", i32 3, i32 48, i32 7, i32 9}
!406 = !{i32 128, !407, !408, !409, !410, !411, !412, !413, !415, !416, !417, !418}
!407 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!408 = !{i32 6, !"fallOffStart", i32 3, i32 12, i32 7, i32 9}
!409 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!410 = !{i32 6, !"fallOffEnd", i32 3, i32 28, i32 7, i32 9}
!411 = !{i32 6, !"position", i32 3, i32 32, i32 7, i32 9}
!412 = !{i32 6, !"spotPower", i32 3, i32 44, i32 7, i32 9}
!413 = !{i32 6, !"shadowMatrix", i32 2, !414, i32 3, i32 48, i32 7, i32 9}
!414 = !{i32 4, i32 4, i32 2}
!415 = !{i32 6, !"castShadows", i32 3, i32 112, i32 7, i32 4}
!416 = !{i32 6, !"_pad0", i32 3, i32 116, i32 7, i32 9}
!417 = !{i32 6, !"_pad1", i32 3, i32 120, i32 7, i32 9}
!418 = !{i32 6, !"_pad2", i32 3, i32 124, i32 7, i32 9}
!419 = !{i32 224, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!420 = !{i32 6, !"voxelTextureDimensions", i32 3, i32 0, i32 7, i32 5}
!421 = !{i32 6, !"totalTime", i32 3, i32 12, i32 7, i32 9}
!422 = !{i32 6, !"voxelCellSize", i32 3, i32 16, i32 7, i32 9}
!423 = !{i32 6, !"deltaTime", i32 3, i32 28, i32 7, i32 9}
!424 = !{i32 6, !"invVoxelTextureDimensions", i32 3, i32 32, i32 7, i32 9}
!425 = !{i32 6, !"StoreData", i32 3, i32 44, i32 7, i32 5}
!426 = !{i32 6, !"invVoxelCellSize", i32 3, i32 48, i32 7, i32 9}
!427 = !{i32 6, !"pad1", i32 3, i32 60, i32 7, i32 9}
!428 = !{i32 6, !"SceneAABBMin", i32 3, i32 64, i32 7, i32 9}
!429 = !{i32 6, !"pad2", i32 3, i32 76, i32 7, i32 9}
!430 = !{i32 6, !"SceneAABBMax", i32 3, i32 80, i32 7, i32 9}
!431 = !{i32 6, !"pad3", i32 3, i32 92, i32 7, i32 9}
!432 = !{i32 6, !"VoxelToWorld", i32 2, !414, i32 3, i32 96, i32 7, i32 9}
!433 = !{i32 6, !"WorldToVoxel", i32 2, !414, i32 3, i32 160, i32 7, i32 9}
!434 = !{i32 16, !435, !436}
!435 = !{i32 6, !"LightDirection", i32 3, i32 0, i32 7, i32 9}
!436 = !{i32 6, !"FaceCount", i32 3, i32 12, i32 7, i32 5}
!437 = !{i32 4, !438, !439}
!438 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!439 = !{i32 0, !440}
!440 = !{!441}
!441 = !{i32 0, i32 undef}
!442 = !{i32 32, !443, !444}
!443 = !{i32 6, !"h", i32 3, i32 0}
!444 = !{i32 0, !445}
!445 = !{!446}
!446 = !{i32 0, %struct.ClusterData undef}
!447 = !{i32 32, !448, !449, !450, !451}
!448 = !{i32 6, !"Center", i32 3, i32 0, i32 7, i32 5}
!449 = !{i32 6, !"VoxelCount", i32 3, i32 12, i32 7, i32 5}
!450 = !{i32 6, !"Normal", i32 3, i32 16, i32 7, i32 9}
!451 = !{i32 6, !"FirstDataIndex", i32 3, i32 28, i32 7, i32 5}
!452 = !{i32 8, !438, !453}
!453 = !{i32 0, !454}
!454 = !{!455}
!455 = !{i32 0, <2 x i32> undef}
!456 = !{i32 32, !457, !458, !459, !460}
!457 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!458 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!459 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!460 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!461 = !{i32 4, !462}
!462 = !{i32 6, !"voxelIdx", i32 3, i32 0, i32 7, i32 5}
!463 = !{i32 16, !464}
!464 = !{i32 6, !"cbRaytracingShadows", i32 3, i32 0}
!465 = !{i32 224, !466}
!466 = !{i32 6, !"cbVoxelCommons", i32 3, i32 0}
!467 = !{i32 1, void ()* @"\01?ShadowRaygen@@YAXXZ", !468, void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !470, void ()* @"\01?ShadowIntersection@@YAXXZ", !468}
!468 = !{!469}
!469 = !{i32 1, !2, !2}
!470 = !{!469, !471}
!471 = !{i32 2, !2, !2}
!472 = !{null, !"", null, !361, !473}
!473 = !{i32 0, i64 65553}
!474 = !{void ()* @"\01?ShadowIntersection@@YAXXZ", !"\01?ShadowIntersection@@YAXXZ", null, null, !475}
!475 = !{i32 8, i32 8, i32 5, !476}
!476 = !{i32 0}
!477 = !{void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !"\01?ShadowMiss@@YAXUPayload@@@Z", null, null, !478}
!478 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !476}
!479 = !{void ()* @"\01?ShadowRaygen@@YAXXZ", !"\01?ShadowRaygen@@YAXXZ", null, null, !480}
!480 = !{i32 8, i32 7, i32 5, !476}
!481 = !DILocation(line: 100, column: 22, scope: !246)
!482 = !DILocation(line: 141, column: 34, scope: !483)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 139, column: 13)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 138, column: 17)
!485 = distinct !DILexicalBlock(scope: !486, file: !1, line: 136, column: 9)
!486 = distinct !DILexicalBlock(scope: !487, file: !1, line: 135, column: 13)
!487 = distinct !DILexicalBlock(scope: !488, file: !1, line: 133, column: 5)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 132, column: 5)
!489 = distinct !DILexicalBlock(scope: !246, file: !1, line: 132, column: 5)
!490 = !DILocation(line: 102, column: 50, scope: !246)
!491 = !DILocation(line: 137, column: 13, scope: !485)
!492 = !DILocation(line: 139, column: 5, scope: !223, inlinedAt: !493)
!493 = distinct !DILocation(line: 141, column: 17, scope: !483)
!494 = !DILocation(line: 139, column: 5, scope: !223, inlinedAt: !495)
!495 = distinct !DILocation(line: 140, column: 17, scope: !483)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDirection", scope: !246, file: !1, line: 82, type: !497)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 576, align: 32, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 6)
!500 = !DIExpression(DW_OP_bit_piece, 0, 32)
!501 = !DILocation(line: 82, column: 12, scope: !246)
!502 = !{i32 0, i32 96, i32 6}
!503 = !DIExpression(DW_OP_bit_piece, 32, 32)
!504 = !{i32 32, i32 96, i32 6}
!505 = !DIExpression(DW_OP_bit_piece, 64, 32)
!506 = !{i32 64, i32 96, i32 6}
!507 = !DILocation(line: 83, column: 5, scope: !246)
!508 = !DILocation(line: 92, column: 25, scope: !246)
!509 = !DILocation(line: 92, column: 11, scope: !246)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchIdx", scope: !246, file: !1, line: 92, type: !48)
!511 = !DILocation(line: 93, column: 25, scope: !246)
!512 = !DILocation(line: 93, column: 11, scope: !246)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchDim", scope: !246, file: !1, line: 93, type: !48)
!514 = !DILocation(line: 95, column: 20, scope: !246)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gridDimension", arg: 2, scope: !206, file: !202, line: 83, type: !48)
!516 = !DILocation(line: 83, column: 41, scope: !206, inlinedAt: !517)
!517 = distinct !DILocation(line: 95, column: 20, scope: !246)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coord3", arg: 1, scope: !206, file: !202, line: 83, type: !48)
!519 = !DILocation(line: 83, column: 27, scope: !206, inlinedAt: !517)
!520 = !DILocation(line: 86, column: 22, scope: !206, inlinedAt: !517)
!521 = !DILocation(line: 85, column: 22, scope: !206, inlinedAt: !517)
!522 = !DILocation(line: 87, column: 22, scope: !206, inlinedAt: !517)
!523 = !DILocation(line: 87, column: 40, scope: !206, inlinedAt: !517)
!524 = !DILocation(line: 86, column: 40, scope: !206, inlinedAt: !517)
!525 = !DILocation(line: 85, column: 5, scope: !206, inlinedAt: !517)
!526 = !DILocation(line: 95, column: 10, scope: !246)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceIdx", scope: !246, file: !1, line: 95, type: !205)
!528 = !DIExpression()
!529 = !DILocation(line: 97, column: 40, scope: !530)
!530 = distinct !DILexicalBlock(scope: !246, file: !1, line: 97, column: 9)
!531 = !DILocation(line: 97, column: 17, scope: !530)
!532 = !DILocation(line: 97, column: 9, scope: !246)
!533 = !DILocation(line: 98, column: 9, scope: !530)
!534 = !DILocation(line: 100, column: 11, scope: !246)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceData", scope: !246, file: !1, line: 100, type: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 100, baseType: !333)
!537 = !DILocation(line: 102, column: 104, scope: !246)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gridDimension", arg: 2, scope: !201, file: !202, line: 74, type: !48)
!539 = !DILocation(line: 74, column: 53, scope: !201, inlinedAt: !540)
!540 = distinct !DILocation(line: 102, column: 33, scope: !246)
!541 = !DILocation(line: 102, column: 33, scope: !246)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "voxelLinearCoord", arg: 1, scope: !201, file: !202, line: 74, type: !205)
!543 = !DILocation(line: 74, column: 29, scope: !201, inlinedAt: !540)
!544 = !DILocation(line: 77, column: 40, scope: !201, inlinedAt: !540)
!545 = !DILocation(line: 77, column: 21, scope: !201, inlinedAt: !540)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelPosition", scope: !201, file: !202, line: 76, type: !48)
!547 = !DILocation(line: 76, column: 11, scope: !201, inlinedAt: !540)
!548 = !DILocation(line: 78, column: 41, scope: !201, inlinedAt: !540)
!549 = !DILocation(line: 78, column: 60, scope: !201, inlinedAt: !540)
!550 = !DILocation(line: 78, column: 21, scope: !201, inlinedAt: !540)
!551 = !DILocation(line: 79, column: 59, scope: !201, inlinedAt: !540)
!552 = !DILocation(line: 79, column: 40, scope: !201, inlinedAt: !540)
!553 = !DILocation(line: 79, column: 21, scope: !201, inlinedAt: !540)
!554 = !DILocation(line: 80, column: 5, scope: !201, inlinedAt: !540)
!555 = !DILocation(line: 102, column: 26, scope: !246)
!556 = !DILocation(line: 102, column: 12, scope: !246)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelCenter", scope: !246, file: !1, line: 102, type: !40)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !246, file: !1, line: 106, type: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 106, size: 256, align: 32, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !559, file: !1, line: 106, baseType: !41, size: 96, align: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !559, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !559, file: !1, line: 106, baseType: !41, size: 96, align: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !559, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 224)
!565 = !DILocation(line: 106, column: 13, scope: !246)
!566 = !DILocation(line: 109, column: 42, scope: !246)
!567 = !DILocation(line: 109, column: 21, scope: !246)
!568 = !DILocation(line: 109, column: 9, scope: !246)
!569 = !DILocation(line: 109, column: 19, scope: !246)
!570 = !DILocation(line: 112, column: 9, scope: !246)
!571 = !DILocation(line: 112, column: 14, scope: !246)
!572 = !DILocation(line: 115, column: 107, scope: !246)
!573 = !DILocation(line: 115, column: 65, scope: !246)
!574 = !DILocation(line: 115, column: 24, scope: !246)
!575 = !DILocation(line: 115, column: 20, scope: !246)
!576 = !DILocation(line: 115, column: 16, scope: !246)
!577 = !DILocation(line: 115, column: 9, scope: !246)
!578 = !DILocation(line: 115, column: 14, scope: !246)
!579 = !DILocation(line: 116, column: 9, scope: !246)
!580 = !DILocation(line: 116, column: 14, scope: !246)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !246, file: !1, line: 117, type: !253)
!582 = !DILocation(line: 117, column: 13, scope: !246)
!583 = !DILocation(line: 117, column: 26, scope: !246)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "points", scope: !246, file: !1, line: 119, type: !585)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 480, align: 32, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 5)
!588 = !DILocation(line: 119, column: 12, scope: !246)
!589 = !{i32 0, i32 96, i32 5}
!590 = !{i32 32, i32 96, i32 5}
!591 = !{i32 64, i32 96, i32 5}
!592 = !DILocation(line: 120, column: 22, scope: !246)
!593 = !DILocation(line: 120, column: 12, scope: !246)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDir", scope: !246, file: !1, line: 120, type: !40)
!595 = !DILocation(line: 121, column: 29, scope: !246)
!596 = !DILocation(line: 121, column: 5, scope: !246)
!597 = !DILocation(line: 121, column: 15, scope: !246)
!598 = !DILocation(line: 123, column: 34, scope: !599)
!599 = distinct !DILexicalBlock(scope: !246, file: !1, line: 122, column: 5)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "faceDirection", arg: 2, scope: !227, file: !1, line: 40, type: !40)
!601 = !DILocation(line: 40, column: 58, scope: !227, inlinedAt: !602)
!602 = distinct !DILocation(line: 123, column: 34, scope: !599)
!603 = !DILocation(line: 43, column: 12, scope: !227, inlinedAt: !602)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !227, file: !1, line: 43, type: !40)
!605 = !DILocation(line: 44, column: 12, scope: !227, inlinedAt: !602)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !227, file: !1, line: 44, type: !40)
!607 = !DILocation(line: 45, column: 12, scope: !227, inlinedAt: !602)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !227, file: !1, line: 45, type: !40)
!609 = !DILocation(line: 51, column: 25, scope: !610, inlinedAt: !602)
!610 = distinct !DILexicalBlock(scope: !227, file: !1, line: 51, column: 9)
!611 = !DILocation(line: 51, column: 9, scope: !227, inlinedAt: !602)
!612 = !DILocation(line: 54, column: 42, scope: !613, inlinedAt: !602)
!613 = distinct !DILexicalBlock(scope: !610, file: !1, line: 52, column: 5)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edgeMidpoints", scope: !227, file: !1, line: 48, type: !230)
!615 = !DILocation(line: 48, column: 14, scope: !227, inlinedAt: !602)
!616 = !DILocation(line: 55, column: 42, scope: !613, inlinedAt: !602)
!617 = !DILocation(line: 56, column: 42, scope: !613, inlinedAt: !602)
!618 = !DILocation(line: 57, column: 42, scope: !613, inlinedAt: !602)
!619 = !DIExpression(DW_OP_bit_piece, 96, 32)
!620 = !DILocation(line: 58, column: 5, scope: !613, inlinedAt: !602)
!621 = !DILocation(line: 59, column: 30, scope: !622, inlinedAt: !602)
!622 = distinct !DILexicalBlock(scope: !610, file: !1, line: 59, column: 14)
