#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Raytracing tier 1.1 features
;
; shader debug name: ce712e65762bd599c5595a7f03de8ef3.pdb
; shader hash: ce712e65762bd599c5595a7f03de8ef3
;
; Buffer Definitions:
;
; cbuffer cbRaytracingShadows
; {
;
;   struct cbRaytracingShadows
;   {
;
;       struct struct.ConstantBufferRTShadows
;       {
;
;           uint3 GridDimension;                      ; Offset:    0
;           float pad0;                               ; Offset:   12
;           uint2 ShadowTexDimensions;                ; Offset:   16
;           float pad1;                               ; Offset:   24
;           float pad2;                               ; Offset:   28
;       
;       } cbRaytracingShadows;                        ; Offset:    0
;
;   
;   } cbRaytracingShadows;                            ; Offset:    0 Size:    32
;
; }
;
; cbuffer cbCameraBuffer
; {
;
;   struct hostlayout.cbCameraBuffer
;   {
;
;       column_major float4x4 view;                   ; Offset:    0
;       column_major float4x4 invView;                ; Offset:   64
;       column_major float4x4 projection;             ; Offset:  128
;       column_major float4x4 invProjection;          ; Offset:  192
;       column_major float4x4 viewProjection;         ; Offset:  256
;       column_major float4x4 invViewProjection;      ; Offset:  320
;       float3 eyePosition;                           ; Offset:  384

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !87)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23, !38}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 27, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 27, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 70, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 70, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 82, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 82, size: 288, align: 32, elements: !25, templateParams: !35)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !24, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!35 = !{!11, !36, !37}
!36 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!37 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!11, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!46 = !{!47, !57, !60, !65, !68, !78, !81, !82}
!47 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NV?$vector@M$02@@0Y01V1@AIAM2@Z", scope: !48, file: !48, line: 4, type: !49, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/RaytracingUtils.hlsli", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !38, !38, !52, !55, !55}
!51 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, align: 32, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 2)
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!57 = !DISubprogram(name: "Random", linkageName: "\01?Random@@YAMV?$vector@M$01@@@Z", scope: !1, file: !1, line: 61, type: !58, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!8, !4}
!60 = !DISubprogram(name: "SetShadowVoxel", linkageName: "\01?SetShadowVoxel@@YAXI@Z", scope: !1, file: !1, line: 86, type: !61, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 64, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!65 = !DISubprogram(name: "ShadowRaygen", linkageName: "\01?ShadowRaygen@@YAXXZ", scope: !1, file: !1, line: 102, type: !66, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowRaygen@@YAXXZ")
!66 = !DISubroutineType(types: !67)
!67 = !{null}
!68 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUPayload@@UAttributes@@@Z", scope: !1, file: !1, line: 156, type: !69, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.Attributes*)* @"\01?ShadowClosestHit@@YAXUPayload@@UAttributes@@@Z")
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !75}
!71 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 51, size: 32, align: 32, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "voxelIdx", scope: !72, file: !1, line: 53, baseType: !63, size: 32, align: 32)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attributes", file: !1, line: 56, size: 32, align: 32, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "voxelIdx", scope: !75, file: !1, line: 58, baseType: !63, size: 32, align: 32)
!78 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 164, type: !79, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z")
!79 = !DISubroutineType(types: !80)
!80 = !{null, !71}
!81 = !DISubprogram(name: "ShadowIntersection", linkageName: "\01?ShadowIntersection@@YAXXZ", scope: !1, file: !1, line: 170, type: !66, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowIntersection@@YAXXZ")
!82 = !DISubprogram(name: "GenerateOrthoCameraRay", linkageName: "\01?GenerateOrthoCameraRay@@YAXV?$vector@M$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 68, type: !83, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !4, !85, !85}
!85 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38)
!87 = !{!88, !90, !114, !115, !116, !117, !118, !119, !121, !122, !123, !124, !125, !126, !127, !129, !131, !157, !159, !162, !165, !166, !167, !168, !178, !189, !190, !191, !192, !194, !195}
!88 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !47, file: !48, line: 18, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!90 = !DIGlobalVariable(name: "view", linkageName: "\01?view@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 14, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 14, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 14, size: 512, align: 32, elements: !94, templateParams: !111)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !93, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!111 = !{!11, !112, !113}
!112 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!113 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!114 = !DIGlobalVariable(name: "invView", linkageName: "\01?invView@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 15, type: !91, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 16, type: !91, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "invProjection", linkageName: "\01?invProjection@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 17, type: !91, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "viewProjection", linkageName: "\01?viewProjection@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 18, type: !91, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "invViewProjection", linkageName: "\01?invViewProjection@cbCameraBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 19, type: !91, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "eyePosition", linkageName: "\01?eyePosition@cbCameraBuffer@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 21, type: !120, isLocal: false, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!121 = !DIGlobalVariable(name: "nearPlane", linkageName: "\01?nearPlane@cbCameraBuffer@@3MB", scope: !0, file: !1, line: 22, type: !89, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "farPlane", linkageName: "\01?farPlane@cbCameraBuffer@@3MB", scope: !0, file: !1, line: 24, type: !89, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "_pad0", linkageName: "\01?_pad0@cbCameraBuffer@@3MB", scope: !0, file: !1, line: 25, type: !89, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "_pad1", linkageName: "\01?_pad1@cbCameraBuffer@@3MB", scope: !0, file: !1, line: 26, type: !89, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "_pad2", linkageName: "\01?_pad2@cbCameraBuffer@@3MB", scope: !0, file: !1, line: 27, type: !89, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "JITTER_AMOUNT", scope: !0, file: !1, line: 66, type: !89, isLocal: true, isDefinition: true, variable: float 0x3F847AE140000000)
!127 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 129, type: !128, isLocal: true, isDefinition: true, variable: i32 0)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!129 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !1, line: 8, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 8, size: 32, align: 32, elements: !2)
!131 = !DIGlobalVariable(name: "cbRaytracingShadows", linkageName: "\01?cbRaytracingShadows@@3U?$ConstantBuffer@UConstantBufferRTShadows@@@@A", scope: !0, file: !1, line: 10, type: !132, isLocal: false, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferRTShadows>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !133)
!133 = !{!134}
!134 = !DITemplateTypeParameter(name: "T", type: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferRTShadows", file: !136, line: 16, size: 256, align: 32, elements: !137)
!136 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!137 = !{!138, !147, !148, !155, !156}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "GridDimension", scope: !135, file: !136, line: 18, baseType: !139, size: 96, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 10, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 10, size: 96, align: 32, elements: !141, templateParams: !145)
!141 = !{!142, !143, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !140, file: !1, line: 10, baseType: !64, size: 32, align: 32, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !140, file: !1, line: 10, baseType: !64, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !140, file: !1, line: 10, baseType: !64, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!145 = !{!146, !45}
!146 = !DITemplateTypeParameter(name: "element", type: !64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !135, file: !136, line: 19, baseType: !8, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowTexDimensions", scope: !135, file: !136, line: 21, baseType: !149, size: 64, align: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 10, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 10, size: 64, align: 32, elements: !151, templateParams: !154)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !150, file: !1, line: 10, baseType: !64, size: 32, align: 32, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !150, file: !1, line: 10, baseType: !64, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!154 = !{!146, !12}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !135, file: !136, line: 22, baseType: !8, size: 32, align: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !135, file: !136, line: 23, baseType: !8, size: 32, align: 32, offset: 224)
!157 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 30, type: !158, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 30, size: 32, align: 32, elements: !2)
!159 = !DIGlobalVariable(name: "gShadowMap", linkageName: "\01?gShadowMap@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 32, type: !160, isLocal: false, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 32, size: 64, align: 32, elements: !2, templateParams: !161)
!161 = !{!11}
!162 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 34, type: !163, isLocal: false, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 34, size: 32, align: 32, elements: !2, templateParams: !164)
!164 = !{!146}
!165 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !163, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 36, type: !163, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 37, type: !163, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 39, type: !169, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<AABB>"* @"\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A")
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 39, size: 192, align: 32, elements: !2, templateParams: !170)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "element", type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !136, line: 64, size: 192, align: 32, elements: !173)
!173 = !{!174, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !172, file: !136, line: 66, baseType: !175, size: 96, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !176, line: 4, baseType: !38)
!176 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !172, file: !136, line: 67, baseType: !175, size: 96, align: 32, offset: 96)
!178 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UAABBInfo@@@@A", scope: !0, file: !1, line: 40, type: !179, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABBInfo>", file: !1, line: 40, size: 128, align: 32, elements: !2, templateParams: !180)
!180 = !{!181}
!181 = !DITemplateTypeParameter(name: "element", type: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABBInfo", file: !136, line: 56, size: 128, align: 32, elements: !183)
!183 = !{!184, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !182, file: !136, line: 58, baseType: !185, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !176, line: 8, baseType: !63)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !182, file: !136, line: 59, baseType: !185, size: 32, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !182, file: !136, line: 60, baseType: !8, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !182, file: !136, line: 61, baseType: !8, size: 32, align: 32, offset: 96)
!189 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 41, type: !163, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A")
!190 = !DIGlobalVariable(name: "gGeometryStartOffset", linkageName: "\01?gGeometryStartOffset@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 43, type: !163, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gGeometryStartOffset@@3V?$StructuredBuffer@I@@A")
!191 = !DIGlobalVariable(name: "gAABBStartOffset", linkageName: "\01?gAABBStartOffset@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 44, type: !163, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBStartOffset@@3V?$StructuredBuffer@I@@A")
!192 = !DIGlobalVariable(name: "gVoxelShadowBuffer", linkageName: "\01?gVoxelShadowBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 46, type: !193, isLocal: false, isDefinition: true, variable: %struct.RWByteAddressBuffer* @"\01?gVoxelShadowBuffer@@3URWByteAddressBuffer@@A")
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 46, size: 32, align: 32, elements: !2)
!194 = !DIGlobalVariable(name: "gTaaVoxelShadowBuffer", linkageName: "\01?gTaaVoxelShadowBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 47, type: !193, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariable(name: "JITTER_AMOUNT", scope: !0, file: !1, line: 66, type: !89, isLocal: true, isDefinition: true)
!196 = !{i32 2, !"Dwarf Version", i32 4}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!199 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl", !"#ifndef RAYTRACING_SHADOW_HLSL\0D\0A#define RAYTRACING_SHADOW_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0ASamplerComparisonState gShadowSampler : register(s0);\0D\0A\0D\0AConstantBuffer<ConstantBufferRTShadows> cbRaytracingShadows : register(b0);\0D\0A\0D\0Acbuffer cbCameraBuffer : register(b1)\0D\0A{\0D\0A    float4x4 view;\0D\0A    float4x4 invView;\0D\0A    float4x4 projection;\0D\0A    float4x4 invProjection;\0D\0A    float4x4 viewProjection;\0D\0A    float4x4 invViewProjection;\0D\0A    \0D\0A    float3 eyePosition;\0D\0A    float nearPlane;\0D\0A    \0D\0A    float farPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A\0D\0ATexture2D<float> gShadowMap : register(t1, space0);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space1);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space1);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space1);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space1);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space2);\0D\0AStructuredBuffer<AABBInfo> gClusterAABBInfoBuffer : register(t1, space2);\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space2);\0D\0A\0D\0AStructuredBuffer<uint> gGeometryStartOffset : register(t0, space3);\0D\0AStructuredBuffer<uint> gAABBStartOffset : register(t1, space3);\0D\0A\0D\0ARWByteAddressBuffer gVoxelShadowBuffer : register(u0, space0);\0D\0ARWByteAddressBuffer gTaaVoxelShadowBuffer : register(u1, space0);\0D\0A\0D\0A\0D\0A\0D\0Astruct Payload\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Astruct Attributes\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Afloat Random(float2 seed)\0D\0A{\0D\0A    return frac(sin(dot(seed.xy, float2(12.9898, 78.233))) * 43758.5453);\0D\0A}\0D\0A\0D\0Astatic const float JITTER_AMOUNT = 0.01f;\0D\0A\0D\0Ainline void GenerateOrthoCameraRay(float2 ndc, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float4 screenPos = float4(ndc * float2(240.0f, 240.0f), 0.0f, 1.0f);\0D\0A    \0D\0A    // Orthobounds are 120, 120, but the voxel scene is bigger than the raster scene by a factor of 2\0D\0A    float3 worldPos = mul(screenPos, invView).xyz;\0D\0A    \0D\0A    // Jittering factor (scales the amount of jitter, adjust this value as needed)\0D\0A\0D\0A    float jitterDir = Random(float2(ndc.y, ndc.x) + 2.0f) * 2.0f - 1;\0D\0A    jitterDir *= 0.1f;\0D\0A    \0D\0A    origin = worldPos + eyePosition + cbRaytracingShadows.GridDimension / 2;\0D\0A    \0D\0A    direction = normalize(mul(float3(0.0f, 0.0f, 1.0f), (float3x3) invView));\0D\0A}\0D\0A\0D\0A\0D\0Avoid SetShadowVoxel(uint i)\0D\0A{\0D\0A    uint index = i / 32; // Calculate the 32-bit word index\0D\0A    uint bitPosition = i % 32; // Calculate the bit position within the word\0D\0A    \0D\0A    // Use InterlockedOr to set the bit\0D\0A    uint offset = index * 4; // Each 32-bit word is 4 bytes\0D\0A    \0D\0A    uint outValue = 0;\0D\0A    uint taaOut = 0;\0D\0A    \0D\0A    gVoxelShadowBuffer.InterlockedOr(offset, (1u << bitPosition), outValue);\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid ShadowRaygen()\0D\0A{\0D\0A    float2 rayOffset = float2(cbRaytracingShadows.ShadowTexDimensions.xy) / float2(DispatchRaysDimensions().xy);\0D\0A    float2 rayStart = float2(DispatchRaysIndex().xy) * rayOffset;\0D\0A\0D\0A    // Generate a 2D random offset\0D\0A    float2 jitterOffset = float2(Random(rayStart), Random(rayStart + 1.0f));\0D\0A    jitterOffset = jitterOffset * 2.0f - 1.0f;\0D\0A    // Scale the jitter to make it a small offset\0D\0A    jitterOffset = (jitterOffset) * JITTER_AMOUNT; // Center it around 0 and scale\0D\0A        \0D\0A    float2 ndc = rayStart / cbRaytracingShadows.ShadowTexDimensions; // normalized [0, 1]\0D\0A    ndc = ndc * 2.0f - 1.0f; // normalized [-1, 1]\0D\0A    ndc.y *= -1.0f; // flip y-axis\0D\0A    \0D\0A    \0D\0A    float3 origin, direction;\0D\0A    GenerateOrthoCameraRay(ndc, origin, direction);\0D\0A        \0D\0A        // Define ray starting position and other parameters\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = direction;\0D\0A    ray.TMin = 0.001; // Start the ray slightly away from the origin\0D\0A    ray.TMax = 1.#INF; // Max distance for the ray\0D\0A    Payload rayPayload = { -1 }; // Payload to store the index\0D\0A        \0D\0A    TraceRay(Scene, RAY_FLAG_NONE, ~0, 0, 0, 0, ray, rayPayload);\0D\0A        \0D\0A    uint idx = rayPayload.voxelIdx;\0D\0A        \0D\0A    if (idx == -1)\0D\0A        return;\0D\0A        \0D\0A    SetShadowVoxel(idx);\0D\0A       \0D\0A    GenerateOrthoCameraRay(ndc, origin, direction);\0D\0A    \0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = direction + jitterOffset.x + jitterOffset.y;\0D\0A    \0D\0A    rayPayload.voxelIdx = -1;\0D\0A    TraceRay(Scene, RAY_FLAG_NONE, ~0, 0, 0, 0, ray, rayPayload);\0D\0A    \0D\0A    idx = rayPayload.voxelIdx;\0D\0A        \0D\0A    if (idx == -1)\0D\0A        return;\0D\0A        \0D\0A    SetShadowVoxel(idx);\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ShadowClosestHit(inout Payload rayPayload, in Attributes attribs)\0D\0A{\0D\0A    uint idx = gAABBVoxelIndices[attribs.voxelIdx];\0D\0A    \0D\0A    rayPayload.voxelIdx = idx;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid ShadowMiss(inout Payload rayPayload)\0D\0A{\0D\0A    rayPayload.voxelIdx = -1;\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid ShadowIntersection()\0D\0A{\0D\0A    uint idx = gGeometryStartOffset[InstanceIndex()];\0D\0A    idx += GeometryIndex();\0D\0A    \0D\0A    idx = gAABBStartOffset[idx] + PrimitiveIndex();\0D\0A    \0D\0A    AABB aabb = gVoxelAABBBuffer[idx];\0D\0A\0D\0A    float3 aabbs[2] = { aabb.Min, aabb.Max };\0D\0A\0D\0A\0D\0A    float tMin;\0D\0A    float tMax;\0D\0A    \0D\0A    // Perform AABB intersection test\0D\0A    \0D\0A    if (RayAABBIntersectionTest(WorldRayOrigin(), WorldRayDirection(), aabbs, tMin, tMax))\0D\0A    {\0D\0A\0D\0A        Attributes attr;\0D\0A        attr.voxelIdx = idx;\0D\0A        \0D\0A        ReportHit(tMin, 0, attr); // Report the hit with hitT as tMin\0D\0A    }\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_SHADOW_HLSL\0D\0A"}
!200 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!201 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!202 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09float pad0;\0D\0A\0D\0A\09XMUINT2 ShadowTexDimensions;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09XMUINT3 DispatchSize;\0D\0A\09UINT NumberOfFaces;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct AABBInfo\0D\0A{\0D\0A\09UINT ClusterStartIndex;\0D\0A\09UINT ClusterElementCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct AABB\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09XMFLOAT3 Max;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!203 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CRaytracingShadow.hlsl"}
!204 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CData\5CShadersRaytracingShadow.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!205 = !{i32 1, i32 5}
!206 = !{i32 1, i32 6}
!207 = !{!"lib", i32 6, i32 5}
!208 = !{!209, !218, !220, null}
!209 = !{!210, !212, !214, !216, !217}
!210 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !211}
!211 = !{i32 0, i32 4}
!212 = !{i32 1, %"class.StructuredBuffer<AABB>"* @"\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", !"gVoxelAABBBuffer", i32 2, i32 0, i32 1, i32 12, i32 0, !213}
!213 = !{i32 1, i32 24}
!214 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", !"gAABBVoxelIndices", i32 2, i32 2, i32 1, i32 12, i32 0, !215}
!215 = !{i32 1, i32 4}
!216 = !{i32 3, %"class.StructuredBuffer<unsigned int>"* @"\01?gGeometryStartOffset@@3V?$StructuredBuffer@I@@A", !"gGeometryStartOffset", i32 3, i32 0, i32 1, i32 12, i32 0, !215}
!217 = !{i32 4, %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBStartOffset@@3V?$StructuredBuffer@I@@A", !"gAABBStartOffset", i32 3, i32 1, i32 1, i32 12, i32 0, !215}
!218 = !{!219}
!219 = !{i32 0, %struct.RWByteAddressBuffer* @"\01?gVoxelShadowBuffer@@3URWByteAddressBuffer@@A", !"gVoxelShadowBuffer", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!220 = !{!221, !222}
!221 = !{i32 0, %cbRaytracingShadows* @cbRaytracingShadows, !"cbRaytracingShadows", i32 0, i32 0, i32 1, i32 32, null}
!222 = !{i32 1, %hostlayout.cbCameraBuffer* @cbCameraBuffer_legacy, !"cbCameraBuffer", i32 0, i32 1, i32 1, i32 416, null}
!223 = !{i32 0, %struct.ConstantBufferRTShadows undef, !224, %"class.StructuredBuffer<unsigned int>" undef, !230, %"class.StructuredBuffer<AABB>" undef, !235, %struct.AABB undef, !240, %"class.StructuredBuffer<AABBInfo>" undef, !243, %struct.AABBInfo undef, !247, %struct.RayDesc undef, !252, %struct.Payload undef, !257, %struct.Attributes undef, !257, %cbRaytracingShadows undef, !259, %hostlayout.cbCameraBuffer undef, !261}
!224 = !{i32 32, !225, !226, !227, !228, !229}
!225 = !{i32 6, !"GridDimension", i32 3, i32 0, i32 7, i32 5}
!226 = !{i32 6, !"pad0", i32 3, i32 12, i32 7, i32 9}
!227 = !{i32 6, !"ShadowTexDimensions", i32 3, i32 16, i32 7, i32 5}
!228 = !{i32 6, !"pad1", i32 3, i32 24, i32 7, i32 9}
!229 = !{i32 6, !"pad2", i32 3, i32 28, i32 7, i32 9}
!230 = !{i32 4, !231, !232}
!231 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!232 = !{i32 0, !233}
!233 = !{!234}
!234 = !{i32 0, i32 undef}
!235 = !{i32 28, !236, !237}
!236 = !{i32 6, !"h", i32 3, i32 0}
!237 = !{i32 0, !238}
!238 = !{!239}
!239 = !{i32 0, %struct.AABB undef}
!240 = !{i32 28, !241, !242}
!241 = !{i32 6, !"Min", i32 3, i32 0, i32 7, i32 9}
!242 = !{i32 6, !"Max", i32 3, i32 16, i32 7, i32 9}
!243 = !{i32 16, !236, !244}
!244 = !{i32 0, !245}
!245 = !{!246}
!246 = !{i32 0, %struct.AABBInfo undef}
!247 = !{i32 16, !248, !249, !250, !251}
!248 = !{i32 6, !"ClusterStartIndex", i32 3, i32 0, i32 7, i32 5}
!249 = !{i32 6, !"ClusterElementCount", i32 3, i32 4, i32 7, i32 5}
!250 = !{i32 6, !"pad0", i32 3, i32 8, i32 7, i32 9}
!251 = !{i32 6, !"pad1", i32 3, i32 12, i32 7, i32 9}
!252 = !{i32 32, !253, !254, !255, !256}
!253 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!254 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!255 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!256 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!257 = !{i32 4, !258}
!258 = !{i32 6, !"voxelIdx", i32 3, i32 0, i32 7, i32 5}
!259 = !{i32 32, !260}
!260 = !{i32 6, !"cbRaytracingShadows", i32 3, i32 0}
!261 = !{i32 416, !262, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!262 = !{i32 6, !"view", i32 2, !263, i32 3, i32 0, i32 7, i32 9}
!263 = !{i32 4, i32 4, i32 2}
!264 = !{i32 6, !"invView", i32 2, !263, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!265 = !{i32 6, !"projection", i32 2, !263, i32 3, i32 128, i32 7, i32 9}
!266 = !{i32 6, !"invProjection", i32 2, !263, i32 3, i32 192, i32 7, i32 9}
!267 = !{i32 6, !"viewProjection", i32 2, !263, i32 3, i32 256, i32 7, i32 9}
!268 = !{i32 6, !"invViewProjection", i32 2, !263, i32 3, i32 320, i32 7, i32 9}
!269 = !{i32 6, !"eyePosition", i32 3, i32 384, i32 7, i32 9, i32 9, i1 true}
!270 = !{i32 6, !"nearPlane", i32 3, i32 396, i32 7, i32 9}
!271 = !{i32 6, !"farPlane", i32 3, i32 400, i32 7, i32 9}
!272 = !{i32 6, !"_pad0", i32 3, i32 404, i32 7, i32 9}
!273 = !{i32 6, !"_pad1", i32 3, i32 408, i32 7, i32 9}
!274 = !{i32 6, !"_pad2", i32 3, i32 412, i32 7, i32 9}
!275 = !{i32 1, void ()* @"\01?ShadowRaygen@@YAXXZ", !276, void (%struct.Payload*, %struct.Attributes*)* @"\01?ShadowClosestHit@@YAXUPayload@@UAttributes@@@Z", !278, void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !281, void ()* @"\01?ShadowIntersection@@YAXXZ", !276}
!276 = !{!277}
!277 = !{i32 1, !2, !2}
!278 = !{!277, !279, !280}
!279 = !{i32 2, !2, !2}
!280 = !{i32 0, !2, !2}
!281 = !{!277, !279}
!282 = !{null, !"", null, !208, !283}
!283 = !{i32 0, i64 33619985}
!284 = !{void (%struct.Payload*, %struct.Attributes*)* @"\01?ShadowClosestHit@@YAXUPayload@@UAttributes@@@Z", !"\01?ShadowClosestHit@@YAXUPayload@@UAttributes@@@Z", null, null, !285}
!285 = !{i32 8, i32 10, i32 6, i32 4, i32 7, i32 4, i32 5, !286}
!286 = !{i32 0}
!287 = !{void ()* @"\01?ShadowIntersection@@YAXXZ", !"\01?ShadowIntersection@@YAXXZ", null, null, !288}
!288 = !{i32 8, i32 8, i32 5, !286}
!289 = !{void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !"\01?ShadowMiss@@YAXUPayload@@@Z", null, null, !290}
!290 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !286}
!291 = !{void ()* @"\01?ShadowRaygen@@YAXXZ", !"\01?ShadowRaygen@@YAXXZ", null, null, !292}
!292 = !{i32 8, i32 7, i32 5, !286}
!293 = !DILocation(line: 129, column: 5, scope: !65)
!294 = !DILocation(line: 97, column: 5, scope: !60, inlinedAt: !295)
!295 = distinct !DILocation(line: 151, column: 5, scope: !65)
!296 = !DILocation(line: 104, column: 31, scope: !65)
!297 = !DILocation(line: 104, column: 24, scope: !65)
!298 = !DILocation(line: 104, column: 84, scope: !65)
!299 = !DILocation(line: 104, column: 77, scope: !65)
!300 = !DILocation(line: 104, column: 75, scope: !65)
!301 = !DILocation(line: 104, column: 12, scope: !65)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayOffset", scope: !65, file: !1, line: 104, type: !4)
!303 = !DIExpression(DW_OP_bit_piece, 0, 32)
!304 = !DIExpression(DW_OP_bit_piece, 32, 32)
!305 = !DILocation(line: 105, column: 30, scope: !65)
!306 = !DILocation(line: 105, column: 23, scope: !65)
!307 = !DILocation(line: 105, column: 54, scope: !65)
!308 = !DILocation(line: 105, column: 12, scope: !65)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayStart", scope: !65, file: !1, line: 105, type: !4)
!310 = !DILocation(line: 108, column: 34, scope: !65)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !57, file: !1, line: 61, type: !4)
!312 = !DILocation(line: 61, column: 21, scope: !57, inlinedAt: !313)
!313 = distinct !DILocation(line: 108, column: 34, scope: !65)
!314 = !DILocation(line: 63, column: 21, scope: !57, inlinedAt: !313)
!315 = !DILocation(line: 63, column: 17, scope: !57, inlinedAt: !313)
!316 = !DILocation(line: 63, column: 60, scope: !57, inlinedAt: !313)
!317 = !DILocation(line: 63, column: 12, scope: !57, inlinedAt: !313)
!318 = !DILocation(line: 63, column: 5, scope: !57, inlinedAt: !313)
!319 = !DILocation(line: 108, column: 68, scope: !65)
!320 = !DILocation(line: 108, column: 52, scope: !65)
!321 = !DILocation(line: 61, column: 21, scope: !57, inlinedAt: !322)
!322 = distinct !DILocation(line: 108, column: 52, scope: !65)
!323 = !DILocation(line: 63, column: 21, scope: !57, inlinedAt: !322)
!324 = !DILocation(line: 63, column: 17, scope: !57, inlinedAt: !322)
!325 = !DILocation(line: 63, column: 60, scope: !57, inlinedAt: !322)
!326 = !DILocation(line: 63, column: 12, scope: !57, inlinedAt: !322)
!327 = !DILocation(line: 63, column: 5, scope: !57, inlinedAt: !322)
!328 = !DILocation(line: 108, column: 12, scope: !65)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jitterOffset", scope: !65, file: !1, line: 108, type: !4)
!330 = !DILocation(line: 109, column: 33, scope: !65)
!331 = !DILocation(line: 109, column: 40, scope: !65)
!332 = !DILocation(line: 109, column: 18, scope: !65)
!333 = !DILocation(line: 111, column: 35, scope: !65)
!334 = !DILocation(line: 111, column: 18, scope: !65)
!335 = !DILocation(line: 113, column: 49, scope: !65)
!336 = !DILocation(line: 113, column: 29, scope: !65)
!337 = !DILocation(line: 113, column: 27, scope: !65)
!338 = !DILocation(line: 113, column: 12, scope: !65)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndc", scope: !65, file: !1, line: 113, type: !4)
!340 = !DILocation(line: 114, column: 15, scope: !65)
!341 = !DILocation(line: 114, column: 22, scope: !65)
!342 = !DILocation(line: 114, column: 9, scope: !65)
!343 = !DILocation(line: 115, column: 11, scope: !65)
!344 = !DILocation(line: 119, column: 5, scope: !65)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndc", arg: 1, scope: !82, file: !1, line: 68, type: !4)
!346 = !DILocation(line: 68, column: 43, scope: !82, inlinedAt: !347)
!347 = distinct !DILocation(line: 119, column: 5, scope: !65)
!348 = !DILocation(line: 70, column: 35, scope: !82, inlinedAt: !347)
!349 = !DILocation(line: 70, column: 12, scope: !82, inlinedAt: !347)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !82, file: !1, line: 70, type: !14)
!351 = !DIExpression(DW_OP_bit_piece, 64, 32)
!352 = !DIExpression(DW_OP_bit_piece, 96, 32)
!353 = !DILocation(line: 73, column: 38, scope: !82, inlinedAt: !347)
!354 = !DILocation(line: 73, column: 23, scope: !82, inlinedAt: !347)
!355 = !DILocation(line: 73, column: 12, scope: !82, inlinedAt: !347)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldPos", scope: !82, file: !1, line: 73, type: !38)
!357 = !DILocation(line: 77, column: 23, scope: !82, inlinedAt: !347)
!358 = !DILocation(line: 63, column: 5, scope: !57, inlinedAt: !359)
!359 = distinct !DILocation(line: 77, column: 23, scope: !82, inlinedAt: !347)
!360 = !DILocation(line: 77, column: 11, scope: !82, inlinedAt: !347)
!361 = !DILocation(line: 78, column: 15, scope: !82, inlinedAt: !347)
!362 = !DILocation(line: 80, column: 25, scope: !82, inlinedAt: !347)
!363 = !DILocation(line: 80, column: 23, scope: !82, inlinedAt: !347)
!364 = !DILocation(line: 80, column: 59, scope: !82, inlinedAt: !347)
!365 = !DILocation(line: 80, column: 73, scope: !82, inlinedAt: !347)
!366 = !DILocation(line: 80, column: 39, scope: !82, inlinedAt: !347)
!367 = !DILocation(line: 80, column: 37, scope: !82, inlinedAt: !347)
!368 = !DILocation(line: 80, column: 12, scope: !82, inlinedAt: !347)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !82, file: !1, line: 68, type: !38)
!370 = !DILocation(line: 68, column: 59, scope: !82, inlinedAt: !371)
!371 = distinct !DILocation(line: 138, column: 5, scope: !65)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !65, file: !1, line: 118, type: !38)
!373 = !DILocation(line: 118, column: 12, scope: !65)
!374 = !DILocation(line: 82, column: 68, scope: !82, inlinedAt: !347)
!375 = !DILocation(line: 82, column: 27, scope: !82, inlinedAt: !347)
!376 = !DILocation(line: 82, column: 17, scope: !82, inlinedAt: !347)
!377 = !DILocation(line: 82, column: 15, scope: !82, inlinedAt: !347)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !82, file: !1, line: 68, type: !38)
!379 = !DILocation(line: 68, column: 78, scope: !82, inlinedAt: !371)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !65, file: !1, line: 118, type: !38)
!381 = !DILocation(line: 118, column: 20, scope: !65)
!382 = !DILocation(line: 83, column: 1, scope: !82, inlinedAt: !347)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !65, file: !1, line: 122, type: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 122, size: 256, align: 32, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !384, file: !1, line: 122, baseType: !39, size: 96, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !384, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !384, file: !1, line: 122, baseType: !39, size: 96, align: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !384, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 224)
!390 = !DIExpression()
!391 = !DILocation(line: 122, column: 13, scope: !65)
!392 = !DILocation(line: 123, column: 9, scope: !65)
!393 = !DILocation(line: 123, column: 16, scope: !65)
!394 = !DILocation(line: 124, column: 9, scope: !65)
!395 = !DILocation(line: 124, column: 19, scope: !65)
!396 = !DILocation(line: 125, column: 9, scope: !65)
!397 = !DILocation(line: 125, column: 14, scope: !65)
!398 = !DILocation(line: 126, column: 9, scope: !65)
!399 = !DILocation(line: 126, column: 14, scope: !65)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !65, file: !1, line: 127, type: !72)
!401 = !DILocation(line: 127, column: 13, scope: !65)
!402 = !DILocation(line: 127, column: 26, scope: !65)
!403 = !DILocation(line: 131, column: 27, scope: !65)
!404 = !DILocation(line: 131, column: 10, scope: !65)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !65, file: !1, line: 131, type: !63)
!406 = !DILocation(line: 133, column: 13, scope: !407)
!407 = distinct !DILexicalBlock(scope: !65, file: !1, line: 133, column: 9)
!408 = !DILocation(line: 133, column: 9, scope: !65)
!409 = !DILocation(line: 134, column: 9, scope: !407)
!410 = !DILocation(line: 136, column: 5, scope: !65)
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 1, scope: !60, file: !1, line: 86, type: !63)
!412 = !DILocation(line: 86, column: 26, scope: !60, inlinedAt: !413)
!413 = distinct !DILocation(line: 136, column: 5, scope: !65)
!414 = !DILocation(line: 88, column: 20, scope: !60, inlinedAt: !413)
!415 = !DILocation(line: 88, column: 10, scope: !60, inlinedAt: !413)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !60, file: !1, line: 88, type: !63)
!417 = !DILocation(line: 89, column: 26, scope: !60, inlinedAt: !413)
!418 = !DILocation(line: 89, column: 10, scope: !60, inlinedAt: !413)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitPosition", scope: !60, file: !1, line: 89, type: !63)
!420 = !DILocation(line: 92, column: 25, scope: !60, inlinedAt: !413)
!421 = !DILocation(line: 92, column: 10, scope: !60, inlinedAt: !413)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !60, file: !1, line: 92, type: !63)
!423 = !DILocation(line: 94, column: 10, scope: !60, inlinedAt: !413)
!424 = !DILocation(line: 95, column: 10, scope: !60, inlinedAt: !413)
!425 = !DILocation(line: 97, column: 50, scope: !60, inlinedAt: !413)
!426 = !DILocation(line: 97, column: 5, scope: !60, inlinedAt: !413)
!427 = !DILocation(line: 99, column: 1, scope: !60, inlinedAt: !413)
!428 = !DILocation(line: 138, column: 5, scope: !65)
!429 = !DILocation(line: 68, column: 43, scope: !82, inlinedAt: !371)
!430 = !DILocation(line: 70, column: 35, scope: !82, inlinedAt: !371)
!431 = !DILocation(line: 70, column: 12, scope: !82, inlinedAt: !371)
!432 = !DILocation(line: 73, column: 38, scope: !82, inlinedAt: !371)
!433 = !DILocation(line: 73, column: 23, scope: !82, inlinedAt: !371)
!434 = !DILocation(line: 73, column: 12, scope: !82, inlinedAt: !371)
!435 = !DILocation(line: 77, column: 23, scope: !82, inlinedAt: !371)
!436 = !DILocation(line: 63, column: 5, scope: !57, inlinedAt: !437)
!437 = distinct !DILocation(line: 77, column: 23, scope: !82, inlinedAt: !371)
!438 = !DILocation(line: 77, column: 11, scope: !82, inlinedAt: !371)
!439 = !DILocation(line: 78, column: 15, scope: !82, inlinedAt: !371)
!440 = !DILocation(line: 80, column: 25, scope: !82, inlinedAt: !371)
!441 = !DILocation(line: 80, column: 23, scope: !82, inlinedAt: !371)
!442 = !DILocation(line: 80, column: 59, scope: !82, inlinedAt: !371)
!443 = !DILocation(line: 80, column: 73, scope: !82, inlinedAt: !371)
!444 = !DILocation(line: 80, column: 39, scope: !82, inlinedAt: !371)
!445 = !DILocation(line: 80, column: 37, scope: !82, inlinedAt: !371)
!446 = !DILocation(line: 80, column: 12, scope: !82, inlinedAt: !371)
!447 = !DILocation(line: 82, column: 68, scope: !82, inlinedAt: !371)
!448 = !DILocation(line: 82, column: 27, scope: !82, inlinedAt: !371)
!449 = !DILocation(line: 82, column: 17, scope: !82, inlinedAt: !371)
!450 = !DILocation(line: 82, column: 15, scope: !82, inlinedAt: !371)
!451 = !DILocation(line: 83, column: 1, scope: !82, inlinedAt: !371)
!452 = !DILocation(line: 140, column: 9, scope: !65)
!453 = !DILocation(line: 140, column: 16, scope: !65)
!454 = !DILocation(line: 141, column: 31, scope: !65)
!455 = !DILocation(line: 141, column: 48, scope: !65)
!456 = !DILocation(line: 141, column: 9, scope: !65)
!457 = !DILocation(line: 141, column: 19, scope: !65)
!458 = !DILocation(line: 143, column: 16, scope: !65)
!459 = !DILocation(line: 143, column: 25, scope: !65)
!460 = !DILocation(line: 144, column: 5, scope: !65)
!461 = !DILocation(line: 146, column: 22, scope: !65)
!462 = !DILocation(line: 146, column: 9, scope: !65)
!463 = !DILocation(line: 148, column: 13, scope: !464)
!464 = distinct !DILexicalBlock(scope: !65, file: !1, line: 148, column: 9)
!465 = !DILocation(line: 148, column: 9, scope: !65)
!466 = !DILocation(line: 149, column: 9, scope: !464)
!467 = !DILocation(line: 151, column: 5, scope: !65)
!468 = !DILocation(line: 86, column: 26, scope: !60, inlinedAt: !295)
!469 = !DILocation(line: 88, column: 20, scope: !60, inlinedAt: !295)
!470 = !DILocation(line: 88, column: 10, scope: !60, inlinedAt: !295)
!471 = !DILocation(line: 89, column: 26, scope: !60, inlinedAt: !295)
!472 = !DILocation(line: 89, column: 10, scope: !60, inlinedAt: !295)
!473 = !DILocation(line: 92, column: 25, scope: !60, inlinedAt: !295)
!474 = !DILocation(line: 92, column: 10, scope: !60, inlinedAt: !295)
!475 = !DILocation(line: 94, column: 10, scope: !60, inlinedAt: !295)
!476 = !DILocation(line: 95, column: 10, scope: !60, inlinedAt: !295)
!477 = !DILocation(line: 97, column: 50, scope: !60, inlinedAt: !295)
!478 = !DILocation(line: 99, column: 1, scope: !60, inlinedAt: !295)
!479 = !DILocation(line: 153, column: 1, scope: !65)
!480 = !DILocation(line: 158, column: 16, scope: !68)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !68, file: !1, line: 156, type: !75)
!482 = !DILocation(line: 156, column: 63, scope: !68)
!483 = !DILocation(line: 158, column: 42, scope: !68)
!484 = !DILocation(line: 158, column: 10, scope: !68)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !68, file: !1, line: 158, type: !63)
!486 = !DILocation(line: 160, column: 25, scope: !68)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !68, file: !1, line: 156, type: !72)
!488 = !DILocation(line: 156, column: 37, scope: !68)
!489 = !DILocation(line: 161, column: 1, scope: !68)
!490 = !DILocation(line: 166, column: 25, scope: !78)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !78, file: !1, line: 164, type: !72)
!492 = !DILocation(line: 164, column: 31, scope: !78)
!493 = !DILocation(line: 167, column: 1, scope: !78)
!494 = !DILocation(line: 175, column: 11, scope: !81)
!495 = !DILocation(line: 172, column: 16, scope: !81)
!496 = !DILocation(line: 177, column: 17, scope: !81)
!497 = !DILocation(line: 172, column: 37, scope: !81)
!498 = !DILocation(line: 172, column: 10, scope: !81)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !81, file: !1, line: 172, type: !63)
!500 = !DILocation(line: 173, column: 12, scope: !81)
!501 = !DILocation(line: 173, column: 9, scope: !81)
!502 = !DILocation(line: 175, column: 35, scope: !81)
!503 = !DILocation(line: 175, column: 33, scope: !81)
!504 = !DILocation(line: 175, column: 9, scope: !81)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabb", scope: !81, file: !1, line: 177, type: !172)
!506 = !DILocation(line: 177, column: 10, scope: !81)
!507 = !DIExpression(DW_OP_bit_piece, 128, 32)
!508 = !DIExpression(DW_OP_bit_piece, 160, 32)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aabbs", scope: !81, file: !1, line: 179, type: !52)
!510 = !DILocation(line: 179, column: 12, scope: !81)
!511 = !{i32 0, i32 96, i32 2}
!512 = !{i32 32, i32 96, i32 2}
!513 = !{i32 64, i32 96, i32 2}
!514 = !DILocation(line: 179, column: 23, scope: !81)
!515 = !DILocation(line: 187, column: 51, scope: !516)
!516 = distinct !DILexicalBlock(scope: !81, file: !1, line: 187, column: 9)
!517 = !DILocation(line: 187, column: 33, scope: !516)
!518 = !DILocation(line: 187, column: 9, scope: !516)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aabb", arg: 3, scope: !47, file: !48, line: 4, type: !52)
!520 = !DILocation(line: 4, column: 76, scope: !47, inlinedAt: !521)
!521 = distinct !DILocation(line: 187, column: 9, scope: !516)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayDirection", arg: 2, scope: !47, file: !48, line: 4, type: !38)
!523 = !DILocation(line: 4, column: 55, scope: !47, inlinedAt: !521)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayOrigin", arg: 1, scope: !47, file: !48, line: 4, type: !38)
!525 = !DILocation(line: 4, column: 37, scope: !47, inlinedAt: !521)
!526 = !DILocation(line: 7, column: 31, scope: !47, inlinedAt: !521)
!527 = !DILocation(line: 7, column: 18, scope: !47, inlinedAt: !521)
!528 = !DILocation(line: 7, column: 10, scope: !47, inlinedAt: !521)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign3", scope: !47, file: !48, line: 7, type: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 7, baseType: !531)
!531 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 7, size: 96, align: 32, elements: !532, templateParams: !536)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !531, file: !1, line: 7, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !531, file: !1, line: 7, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !531, file: !1, line: 7, baseType: !13, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!536 = !{!537, !45}
!537 = !DITemplateTypeParameter(name: "element", type: !13)
!538 = !DILocation(line: 19, column: 43, scope: !47, inlinedAt: !521)
!539 = !DILocation(line: 19, column: 52, scope: !47, inlinedAt: !521)
!540 = !DILocation(line: 19, column: 83, scope: !47, inlinedAt: !521)
!541 = !DILocation(line: 19, column: 70, scope: !47, inlinedAt: !521)
!542 = !DILocation(line: 19, column: 30, scope: !47, inlinedAt: !521)
!543 = !DILocation(line: 19, column: 12, scope: !47, inlinedAt: !521)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invRayDirection", scope: !47, file: !48, line: 19, type: !38)
!545 = !DILocation(line: 21, column: 23, scope: !47, inlinedAt: !521)
!546 = !DILocation(line: 21, column: 16, scope: !47, inlinedAt: !521)
!547 = !DILocation(line: 21, column: 36, scope: !47, inlinedAt: !521)
!548 = !DILocation(line: 21, column: 51, scope: !47, inlinedAt: !521)
!549 = !DILocation(line: 21, column: 13, scope: !47, inlinedAt: !521)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmin3", scope: !47, file: !48, line: 6, type: !38)
!551 = !DILocation(line: 6, column: 12, scope: !47, inlinedAt: !521)
!552 = !DILocation(line: 22, column: 16, scope: !47, inlinedAt: !521)
!553 = !DILocation(line: 22, column: 32, scope: !47, inlinedAt: !521)
!554 = !DILocation(line: 22, column: 47, scope: !47, inlinedAt: !521)
!555 = !DILocation(line: 22, column: 13, scope: !47, inlinedAt: !521)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmax3", scope: !47, file: !48, line: 6, type: !38)
!557 = !DILocation(line: 6, column: 19, scope: !47, inlinedAt: !521)
!558 = !DILocation(line: 24, column: 23, scope: !47, inlinedAt: !521)
!559 = !DILocation(line: 24, column: 16, scope: !47, inlinedAt: !521)
!560 = !DILocation(line: 24, column: 36, scope: !47, inlinedAt: !521)
!561 = !DILocation(line: 24, column: 51, scope: !47, inlinedAt: !521)
!562 = !DILocation(line: 24, column: 13, scope: !47, inlinedAt: !521)
!563 = !DILocation(line: 25, column: 16, scope: !47, inlinedAt: !521)
!564 = !DILocation(line: 25, column: 32, scope: !47, inlinedAt: !521)
!565 = !DILocation(line: 25, column: 47, scope: !47, inlinedAt: !521)
!566 = !DILocation(line: 25, column: 13, scope: !47, inlinedAt: !521)
!567 = !DILocation(line: 27, column: 23, scope: !47, inlinedAt: !521)
!568 = !DILocation(line: 27, column: 16, scope: !47, inlinedAt: !521)
!569 = !DILocation(line: 27, column: 36, scope: !47, inlinedAt: !521)
!570 = !DILocation(line: 27, column: 51, scope: !47, inlinedAt: !521)
!571 = !DILocation(line: 27, column: 13, scope: !47, inlinedAt: !521)
!572 = !DILocation(line: 28, column: 16, scope: !47, inlinedAt: !521)
!573 = !DILocation(line: 28, column: 32, scope: !47, inlinedAt: !521)
!574 = !DILocation(line: 28, column: 47, scope: !47, inlinedAt: !521)
!575 = !DILocation(line: 28, column: 13, scope: !47, inlinedAt: !521)
!576 = !DILocation(line: 30, column: 16, scope: !47, inlinedAt: !521)
!577 = !DILocation(line: 30, column: 12, scope: !47, inlinedAt: !521)
!578 = !DILocation(line: 30, column: 10, scope: !47, inlinedAt: !521)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tMin", scope: !81, file: !1, line: 182, type: !8)
!580 = !DILocation(line: 182, column: 11, scope: !81)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmin", arg: 4, scope: !47, file: !48, line: 4, type: !8)
!582 = !DILocation(line: 4, column: 95, scope: !47, inlinedAt: !521)
!583 = !DILocation(line: 31, column: 16, scope: !47, inlinedAt: !521)
!584 = !DILocation(line: 31, column: 12, scope: !47, inlinedAt: !521)
!585 = !DILocation(line: 31, column: 10, scope: !47, inlinedAt: !521)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmax", arg: 5, scope: !47, file: !48, line: 4, type: !8)
!587 = !DILocation(line: 4, column: 111, scope: !47, inlinedAt: !521)
