#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f84e31bb4ab39b1d7f6ce5cd82c549c9.pdb
; shader hash: f84e31bb4ab39b1d7f6ce5cd82c549c9
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbClearBuffers
; {
;
;   struct cbClearBuffers
;   {
;
;       struct struct.ConstantBufferClearBuffers
;       {
;
;           uint ValueCount0;                         ; Offset:    0
;           uint ValueCount1;                         ; Offset:    4
;           uint ValueCount2;                         ; Offset:    8
;           uint ValueCount3;                         ; Offset:   12
;       
;       } cbClearBuffers;                             ; Offset:    0
;
;   
;   } cbClearBuffers;                                 ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gClusterRadiance
; {
;
;   uint4 $Element;                                   ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !28)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CClearBufferShader_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 25, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 25, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 10, type: !18, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !26)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!13, !27}
!27 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!28 = !{!29, !41, !43, !44, !45, !48, !50, !53, !54, !55, !69, !71, !75, !77, !79}
!29 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !30, line: 90, type: !31, isLocal: true, isDefinition: true)
!30 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !34, templateParams: !39)
!34 = !{!35, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 90, baseType: !36, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 90, baseType: !36, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, line: 90, baseType: !36, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!40, !27}
!40 = !DITemplateTypeParameter(name: "element", type: !36)
!41 = !DIGlobalVariable(name: "PI", scope: !0, file: !30, line: 108, type: !42, isLocal: true, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!43 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !30, line: 109, type: !42, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !30, line: 110, type: !42, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !46, line: 48, type: !47, isLocal: false, isDefinition: true)
!46 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!48 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !46, line: 49, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!50 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !52, isLocal: true, isDefinition: true)
!51 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!53 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !42, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !42, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariable(name: "cbClearBuffers", linkageName: "\01?cbClearBuffers@@3U?$ConstantBuffer@UConstantBufferClearBuffers@@@@A", scope: !0, file: !1, line: 3, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferClearBuffers>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !57)
!57 = !{!58}
!58 = !DITemplateTypeParameter(name: "T", type: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferClearBuffers", file: !60, line: 164, size: 128, align: 32, elements: !61)
!60 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!61 = !{!62, !66, !67, !68}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount0", scope: !59, file: !60, line: 166, baseType: !63, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !64, line: 8, baseType: !65)
!64 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 16, baseType: !8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount1", scope: !59, file: !60, line: 167, baseType: !63, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount2", scope: !59, file: !60, line: 168, baseType: !63, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ValueCount3", scope: !59, file: !60, line: 169, baseType: !63, size: 32, align: 32, offset: 96)
!69 = !DIGlobalVariable(name: "gVoxelLitBuffer", linkageName: "\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 5, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 5, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "gClusterRadiance", linkageName: "\01?gClusterRadiance@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 6, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 6, size: 128, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !5)
!75 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !30, line: 90, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !31, size: 32, align: 4, offset: 64)
!77 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !30, line: 90, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !31, size: 32, align: 4, offset: 32)
!79 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !30, line: 90, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !31, size: 32, align: 4)
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!84 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CClearBufferShader_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferClearBuffers> cbClearBuffers : register(b0);\0D\0A\0D\0ARWByteAddressBuffer gVoxelLitBuffer : register(u0);\0D\0ARWStructuredBuffer<uint4> gClusterRadiance : register(u1);\0D\0A\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    // ValueCount = Voxel Count\0D\0A    if (DTid.x >= cbClearBuffers.ValueCount0)\0D\0A        return;\0D\0A    \0D\0A    uint idx = DTid.x >> 5u;\0D\0A    idx = idx * 4;\0D\0A    \0D\0A    gVoxelLitBuffer.Store(idx, 0);\0D\0A\0D\0A    // ValueCount1 = Cluster Count\0D\0A    if (DTid.x >= cbClearBuffers.ValueCount1)\0D\0A        return;\0D\0A    \0D\0A    gClusterRadiance[DTid.x] = uint4(0, 0, 0, 0);\0D\0A}"}
