#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 62149a17a75070f8a0bb449549ed58fe.pdb
; shader hash: 62149a17a75070f8a0bb449549ed58fe
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%"class.StructuredBuffer<unsigned int>" = type { i32 }
%"class.RWStructuredBuffer<ClusterData>" = type { %struct.ClusterData }
%struct.ClusterData = type { <3 x i32>, i32, <3 x float>, i32, <3 x float>, i32, <3 x float>, i32, <3 x float>, float, [64 x i32] }
%"class.RWStructuredBuffer<unsigned int>" = type { i32 }
%"class.RWStructuredBuffer<vector<float, 3> >" = type { <3 x float> }

@dx.nothing.a = internal constant [1 x i32] zeroinitializer

define void @CS() {
  %1 = load i32, i32* getelementptr inbounds ([1 x i32], [1 x i32]* @dx.nothing.a, i32 0, i32 0), !dbg !163 ; line:903 col:1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !19)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CClusterReduce_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 147, type: !5, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7, !18, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 12, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 12, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 12, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 12, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 12, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 7, baseType: !11)
!19 = !{!20, !22, !23, !24, !27, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !49, !50, !51, !52, !55, !57, !60, !61, !62, !65, !66, !67, !68, !92, !94, !95, !97, !98, !99, !103, !104, !105, !106, !107, !108, !109, !111, !113}
!20 = !DIGlobalVariable(name: "CurrentPhase", linkageName: "\01?CurrentPhase@SLICCommon@@3IB", scope: !0, file: !1, line: 7, type: !21, isLocal: false, isDefinition: true)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!22 = !DIGlobalVariable(name: "NumberOfSubclusters", linkageName: "\01?NumberOfSubclusters@SLICCommon@@3IB", scope: !0, file: !1, line: 8, type: !21, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariable(name: "NumberOfSuperClusters", linkageName: "\01?NumberOfSuperClusters@SLICCommon@@3IB", scope: !0, file: !1, line: 9, type: !21, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariable(name: "m", linkageName: "\01?m@SLICCommon@@3MB", scope: !0, file: !1, line: 10, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIGlobalVariable(name: "GridDimension", linkageName: "\01?GridDimension@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 12, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!29 = !DIGlobalVariable(name: "VoxelCount", linkageName: "\01?VoxelCount@SLICCommon@@3IB", scope: !0, file: !1, line: 13, type: !21, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariable(name: "TileDimension", linkageName: "\01?TileDimension@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 16, type: !28, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariable(name: "S", linkageName: "\01?S@SLICCommon@@3IB", scope: !0, file: !1, line: 17, type: !21, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariable(name: "PreviousTileDimension", linkageName: "\01?PreviousTileDimension@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 19, type: !28, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariable(name: "PreviousS", linkageName: "\01?PreviousS@SLICCommon@@3IB", scope: !0, file: !1, line: 20, type: !21, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariable(name: "CurrentSubdivision", linkageName: "\01?CurrentSubdivision@SLICCommon@@3IB", scope: !0, file: !1, line: 22, type: !21, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariable(name: "FirstClusterSet", linkageName: "\01?FirstClusterSet@SLICCommon@@3IB", scope: !0, file: !1, line: 23, type: !21, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariable(name: "UnassignedOnlyPass", linkageName: "\01?UnassignedOnlyPass@SLICCommon@@3IB", scope: !0, file: !1, line: 24, type: !21, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariable(name: "MaxClusterCount", linkageName: "\01?MaxClusterCount@SLICCommon@@3IB", scope: !0, file: !1, line: 25, type: !21, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !39, line: 90, type: !40, isLocal: true, isDefinition: true)
!39 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !43, templateParams: !47)
!43 = !{!44, !45, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !42, file: !1, line: 90, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !42, file: !1, line: 90, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !42, file: !1, line: 90, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!47 = !{!48, !16}
!48 = !DITemplateTypeParameter(name: "element", type: !26)
!49 = !DIGlobalVariable(name: "PI", scope: !0, file: !39, line: 108, type: !25, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !39, line: 109, type: !25, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !39, line: 110, type: !25, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !53, line: 48, type: !54, isLocal: false, isDefinition: true)
!53 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!55 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !53, line: 49, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!57 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !58, line: 15, type: !59, isLocal: true, isDefinition: true)
!58 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!60 = !DIGlobalVariable(name: "cos30", scope: !0, file: !58, line: 16, type: !25, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariable(name: "cos25", scope: !0, file: !58, line: 17, type: !25, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 30, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!15}
!65 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 31, type: !63, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 32, type: !63, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 33, type: !63, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "gSuperClusterDataBuffer", linkageName: "\01?gSuperClusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 36, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ClusterData>", file: !1, line: 36, size: 2688, align: 32, elements: !2, templateParams: !70)
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "element", type: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !73, line: 193, size: 2688, align: 32, elements: !74)
!73 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!74 = !{!75, !76, !79, !81, !82, !83, !84, !85, !86, !87, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !72, file: !73, line: 195, baseType: !7, size: 96, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !72, file: !73, line: 196, baseType: !77, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !78, line: 8, baseType: !18)
!78 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !72, file: !73, line: 198, baseType: !80, size: 96, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !78, line: 4, baseType: !41)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !72, file: !73, line: 199, baseType: !77, size: 32, align: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !72, file: !73, line: 201, baseType: !80, size: 96, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !72, file: !73, line: 202, baseType: !77, size: 32, align: 32, offset: 352)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !72, file: !73, line: 204, baseType: !80, size: 96, align: 32, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !72, file: !73, line: 205, baseType: !77, size: 32, align: 32, offset: 480)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !72, file: !73, line: 207, baseType: !80, size: 96, align: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !72, file: !73, line: 208, baseType: !26, size: 32, align: 32, offset: 608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !72, file: !73, line: 210, baseType: !89, size: 2048, align: 32, offset: 640)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 64)
!92 = !DIGlobalVariable(name: "gNextVoxelLinkedList", linkageName: "\01?gNextVoxelLinkedList@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 37, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 37, size: 32, align: 32, elements: !2, templateParams: !64)
!94 = !DIGlobalVariable(name: "gVoxelAssignmentBuffer", linkageName: "\01?gVoxelAssignmentBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 38, type: !93, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "gSuperClusterTileBuffer", linkageName: "\01?gSuperClusterTileBuffer@@3V?$RWTexture3D@I@@A", scope: !0, file: !1, line: 39, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture3D<unsigned int>", file: !1, line: 39, size: 32, align: 32, elements: !2, templateParams: !64)
!97 = !DIGlobalVariable(name: "gNextSuperClusterInTileLinkedList", linkageName: "\01?gNextSuperClusterInTileLinkedList@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 40, type: !93, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "gCounter", linkageName: "\01?gCounter@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 41, type: !93, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "gVoxelNormalDirectionBuffer", linkageName: "\01?gVoxelNormalDirectionBuffer@@3V?$RWStructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 42, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<float, 3> >", file: !1, line: 42, size: 96, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !42)
!103 = !DIGlobalVariable(name: "gSubClusterDataBuffer", linkageName: "\01?gSubClusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 43, type: !69, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "gNextSubClusterInSuperCluster", linkageName: "\01?gNextSubClusterInSuperCluster@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 45, type: !93, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "gSubClusterAssignmentBuffer", linkageName: "\01?gSubClusterAssignmentBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 46, type: !93, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "gSubClusterTileBuffer", linkageName: "\01?gSubClusterTileBuffer@@3V?$RWTexture3D@I@@A", scope: !0, file: !1, line: 47, type: !96, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "gNextSubClusterInTileLInkedList", linkageName: "\01?gNextSubClusterInTileLInkedList@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 48, type: !93, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "gTempClusterDataBuffer", linkageName: "\01?gTempClusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 49, type: !69, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !39, line: 90, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !40, size: 32, align: 4, offset: 64)
!111 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !39, line: 90, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !40, size: 32, align: 4)
!113 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !39, line: 90, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !40, size: 32, align: 4, offset: 32)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
