#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: a3ffd7baf6cc7a83ec4df384aafd8ee7.pdb
; shader hash: a3ffd7baf6cc7a83ec4df384aafd8ee7
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbAABB
; {
;
;   struct cbAABB
;   {
;
;       struct struct.ConstantBufferAABBGeneration
;       {
;
;           uint3 GridDimension;                      ; Offset:    0
;           uint ClusterCount;                        ; Offset:   12
;       
;       } cbAABB;                                     ; Offset:    0
;
;   
;   } cbAABB;                                         ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gIndirectionRankBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gIndirectionIndexBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gVoxelHashedCompactBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gVoxelAABBBuffer
; {
;
;   struct struct.AABB
;   {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !43)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CComputeAABB_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 38, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 38, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 125, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 125, size: 96, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 125, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 125, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 125, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !19)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 86, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 86, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!31 = !{!32, !36, !39}
!32 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 83, type: !33, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !4, !35, !4}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !8)
!36 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 41, type: !37, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!24, !4, !4}
!39 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !40, file: !40, line: 97, type: !41, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!41 = !DISubroutineType(types: !42)
!42 = !{!35, !4, !4}
!43 = !{!44, !48, !49, !50, !51, !54, !56, !57, !58, !61, !63, !65, !66, !67, !78, !81, !82, !83, !84, !105, !106, !107, !115, !125, !127, !128, !129, !131, !133, !135, !137, !138, !140, !141, !143}
!44 = !DIGlobalVariable(name: "voxelCount", linkageName: "\01?voxelCount@@3PAIA", scope: !0, file: !1, line: 33, type: !45, isLocal: false, isDefinition: true, variable: [2 x i32] addrspace(3)* @"\01?voxelCount@@3PAIA")
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DIGlobalVariable(name: "aabbStart", linkageName: "\01?aabbStart@@3IA", scope: !0, file: !1, line: 36, type: !35, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?aabbStart@@3IA")
!49 = !DIGlobalVariable(name: "minAABB", linkageName: "\01?minAABB@@3V?$vector@I$02@@A", scope: !0, file: !1, line: 38, type: !4, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariable(name: "maxAABB", linkageName: "\01?maxAABB@@3V?$vector@I$02@@A", scope: !0, file: !1, line: 39, type: !4, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !52, line: 90, type: !53, isLocal: true, isDefinition: true)
!52 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!54 = !DIGlobalVariable(name: "PI", scope: !0, file: !52, line: 108, type: !55, isLocal: true, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!56 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !52, line: 109, type: !55, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !52, line: 110, type: !55, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !59, line: 48, type: !60, isLocal: false, isDefinition: true)
!59 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !59, line: 49, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!63 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !40, line: 15, type: !64, isLocal: true, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!65 = !DIGlobalVariable(name: "cos30", scope: !0, file: !40, line: 16, type: !55, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "cos25", scope: !0, file: !40, line: 17, type: !55, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "cbAABB", linkageName: "\01?cbAABB@@3U?$ConstantBuffer@UConstantBufferAABBGeneration@@@@A", scope: !0, file: !1, line: 6, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferAABBGeneration>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferAABBGeneration", file: !72, line: 125, size: 128, align: 32, elements: !73)
!72 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "GridDimension", scope: !71, file: !72, line: 127, baseType: !4, size: 96, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !71, file: !72, line: 128, baseType: !76, size: 32, align: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !77, line: 8, baseType: !35)
!77 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!78 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 9, size: 32, align: 32, elements: !2, templateParams: !80)
!80 = !{!12}
!81 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !79, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !79, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !79, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 14, type: !85, isLocal: false, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 14, size: 2688, align: 32, elements: !2, templateParams: !86)
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "element", type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !72, line: 199, size: 2688, align: 32, elements: !89)
!89 = !{!90, !91, !92, !94, !95, !96, !97, !98, !99, !100, !101}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !88, file: !72, line: 201, baseType: !4, size: 96, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !88, file: !72, line: 202, baseType: !76, size: 32, align: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !88, file: !72, line: 204, baseType: !93, size: 96, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !77, line: 4, baseType: !15)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !88, file: !72, line: 205, baseType: !76, size: 32, align: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !88, file: !72, line: 207, baseType: !93, size: 96, align: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !88, file: !72, line: 208, baseType: !76, size: 32, align: 32, offset: 352)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !88, file: !72, line: 210, baseType: !93, size: 96, align: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !88, file: !72, line: 211, baseType: !76, size: 32, align: 32, offset: 480)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !88, file: !72, line: 213, baseType: !93, size: 96, align: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !88, file: !72, line: 214, baseType: !19, size: 32, align: 32, offset: 608)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !88, file: !72, line: 216, baseType: !102, size: 2048, align: 32, offset: 640)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, align: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 64)
!105 = !DIGlobalVariable(name: "gNextVoxelInClusterBuffer", linkageName: "\01?gNextVoxelInClusterBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 15, type: !79, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "gVoxelAssignmentBuffer", linkageName: "\01?gVoxelAssignmentBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 16, type: !79, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$RWStructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 18, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<AABB>", file: !1, line: 18, size: 192, align: 32, elements: !2, templateParams: !109)
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "element", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !72, line: 12, size: 192, align: 32, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !111, file: !72, line: 14, baseType: !15, size: 96, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !111, file: !72, line: 15, baseType: !15, size: 96, align: 32, offset: 96)
!115 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$RWStructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 19, type: !116, isLocal: false, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ClusterAABBInfo>", file: !1, line: 19, size: 256, align: 32, elements: !2, templateParams: !117)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "element", type: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !72, line: 183, size: 256, align: 32, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !119, file: !72, line: 185, baseType: !93, size: 96, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !119, file: !72, line: 186, baseType: !76, size: 32, align: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !119, file: !72, line: 187, baseType: !93, size: 96, align: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !119, file: !72, line: 188, baseType: !76, size: 32, align: 32, offset: 224)
!125 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 21, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !80)
!127 = !DIGlobalVariable(name: "gAABBCounter", linkageName: "\01?gAABBCounter@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 23, type: !126, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "gAABBGridCount", linkageName: "\01?gAABBGridCount@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !126, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !52, line: 90, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !53, size: 32, align: 4)
!131 = !DIGlobalVariable(name: "minAABB.1", linkageName: "\01?minAABB@@3V?$vector@I$02@@A.1", scope: !0, file: !1, line: 38, type: !132, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?minAABB@@3V?$vector@I$02@@A.1")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.1", file: !1, line: 38, baseType: !4, size: 32, align: 4, offset: 32)
!133 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !52, line: 90, type: !134, isLocal: false, isDefinition: true)
!134 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !53, size: 32, align: 4, offset: 32)
!135 = !DIGlobalVariable(name: "minAABB.0", linkageName: "\01?minAABB@@3V?$vector@I$02@@A.0", scope: !0, file: !1, line: 38, type: !136, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?minAABB@@3V?$vector@I$02@@A.0")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.0", file: !1, line: 38, baseType: !4, size: 32, align: 4)
!137 = !DIGlobalVariable(name: "maxAABB.0", linkageName: "\01?maxAABB@@3V?$vector@I$02@@A.0", scope: !0, file: !1, line: 39, type: !136, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?maxAABB@@3V?$vector@I$02@@A.0")
!138 = !DIGlobalVariable(name: "minAABB.2", linkageName: "\01?minAABB@@3V?$vector@I$02@@A.2", scope: !0, file: !1, line: 38, type: !139, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?minAABB@@3V?$vector@I$02@@A.2")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "uint3.2", file: !1, line: 38, baseType: !4, size: 32, align: 4, offset: 64)
!140 = !DIGlobalVariable(name: "maxAABB.2", linkageName: "\01?maxAABB@@3V?$vector@I$02@@A.2", scope: !0, file: !1, line: 39, type: !139, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?maxAABB@@3V?$vector@I$02@@A.2")
!141 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !52, line: 90, type: !142, isLocal: false, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !53, size: 32, align: 4, offset: 64)
!143 = !DIGlobalVariable(name: "maxAABB.1", linkageName: "\01?maxAABB@@3V?$vector@I$02@@A.1", scope: !0, file: !1, line: 39, type: !132, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?maxAABB@@3V?$vector@I$02@@A.1")
!144 = !{i32 2, !"Dwarf Version", i32 4}
!145 = !{i32 2, !"Debug Info Version", i32 3}
!146 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
