#if 0
;
; Note: shader requires additional functionality:
;       64 UAV slots
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 4c587a51d3c622481a34faa8d4419142.pdb
; shader hash: 4c587a51d3c622481a34faa8d4419142
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer SLICCommon
; {
;
;   struct SLICCommon
;   {
;
;       uint CurrentPhase;                            ; Offset:    0
;       uint VoxelCount;                              ; Offset:    4
;       uint K;                                       ; Offset:    8
;       float m;                                      ; Offset:   12
;       uint3 GridDimension;                          ; Offset:   16
;       uint S;                                       ; Offset:   28
;       uint3 TileDimension;                          ; Offset:   32
;       uint FirstClusterSet;                         ; Offset:   44
;       uint3 TilesToUpdate;                          ; Offset:   48
;       uint UnassignedOnlyPass;                      ; Offset:   60
;   
;   } SLICCommon;                                     ; Offset:    0 Size:    64
;
; }
;
; Resource bind info for gFragmentBuffer
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !69)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CFastSlic_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !24, !14, !32}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 424, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 424, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 424, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 424, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 424, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 10, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 10, size: 96, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 10, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 10, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 10, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !19)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 555, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 555, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 555, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 555, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 555, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!31, !13}
!31 = !DITemplateTypeParameter(name: "element", type: !14)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 5, baseType: !19)
!33 = !{!34, !37, !41, !44, !47, !52, !55, !58, !59, !60, !63, !66}
!34 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 366, type: !35, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !15, !32, !15}
!37 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !38, file: !38, line: 88, type: !39, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!15, !32, !15}
!41 = !DISubprogram(name: "SetUpVoxelNormal", linkageName: "\01?SetUpVoxelNormal@@YAXI@Z", scope: !1, file: !1, line: 281, type: !42, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !32}
!44 = !DISubprogram(name: "GetEmptyVoxelX", linkageName: "\01?GetEmptyVoxelX@@YAIV?$vector@I$02@@@Z", scope: !1, file: !1, line: 133, type: !45, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!32, !15}
!47 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !38, file: !38, line: 142, type: !48, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !15, !15, !51}
!50 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 21, size: 32, align: 32, elements: !2)
!52 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !38, file: !38, line: 97, type: !53, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!32, !15, !15}
!55 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !38, file: !38, line: 120, type: !56, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!50, !32, !51}
!58 = !DISubprogram(name: "GetEmptyVoxelY", linkageName: "\01?GetEmptyVoxelY@@YAIV?$vector@I$02@@@Z", scope: !1, file: !1, line: 172, type: !45, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubprogram(name: "GetEmptyVoxelZ", linkageName: "\01?GetEmptyVoxelZ@@YAIV?$vector@I$02@@@Z", scope: !1, file: !1, line: 211, type: !45, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "GetAccumulatedDot", linkageName: "\01?GetAccumulatedDot@@YAMIV?$vector@M$02@@@Z", scope: !1, file: !1, line: 250, type: !61, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!8, !32, !4}
!63 = !DISubprogram(name: "GetVoxelAverageColor", linkageName: "\01?GetVoxelAverageColor@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 334, type: !64, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!4, !32}
!66 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !38, file: !38, line: 105, type: !67, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!50, !15, !24, !15}
!69 = !{!70, !72, !73, !74, !76, !78, !79, !80, !81, !82, !83, !85, !87, !88, !90, !91, !92, !93, !96, !98, !99, !100, !101, !102, !122, !125, !126, !127, !128, !129, !153, !155, !156, !160, !161, !163, !164, !165, !166, !167, !169, !171}
!70 = !DIGlobalVariable(name: "CurrentPhase", linkageName: "\01?CurrentPhase@SLICCommon@@3IB", scope: !0, file: !1, line: 5, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!72 = !DIGlobalVariable(name: "VoxelCount", linkageName: "\01?VoxelCount@SLICCommon@@3IB", scope: !0, file: !1, line: 6, type: !71, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "K", linkageName: "\01?K@SLICCommon@@3IB", scope: !0, file: !1, line: 7, type: !71, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "m", linkageName: "\01?m@SLICCommon@@3MB", scope: !0, file: !1, line: 8, type: !75, isLocal: false, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!76 = !DIGlobalVariable(name: "GridDimension", linkageName: "\01?GridDimension@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 10, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!78 = !DIGlobalVariable(name: "S", linkageName: "\01?S@SLICCommon@@3IB", scope: !0, file: !1, line: 11, type: !71, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariable(name: "TileDimension", linkageName: "\01?TileDimension@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 13, type: !77, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "FirstClusterSet", linkageName: "\01?FirstClusterSet@SLICCommon@@3IB", scope: !0, file: !1, line: 14, type: !71, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "TilesToUpdate", linkageName: "\01?TilesToUpdate@SLICCommon@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 16, type: !77, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "UnassignedOnlyPass", linkageName: "\01?UnassignedOnlyPass@SLICCommon@@3IB", scope: !0, file: !1, line: 17, type: !71, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !38, line: 15, type: !84, isLocal: true, isDefinition: true, variable: i32 -1)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!85 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !86, line: 110, type: !75, isLocal: true, isDefinition: true, variable: float 0x3EB0C6F7A0000000)
!86 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!87 = !DIGlobalVariable(name: "cos25", scope: !0, file: !38, line: 17, type: !75, isLocal: true, isDefinition: true, variable: float 0x3FECCCCCC0000000)
!88 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !86, line: 90, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!90 = !DIGlobalVariable(name: "PI", scope: !0, file: !86, line: 108, type: !75, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !86, line: 109, type: !75, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !86, line: 110, type: !75, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !94, line: 48, type: !95, isLocal: false, isDefinition: true)
!94 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!96 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !94, line: 49, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!98 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !38, line: 15, type: !84, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "cos30", scope: !0, file: !38, line: 16, type: !75, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariable(name: "cos25", scope: !0, file: !38, line: 17, type: !75, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 21, type: !51, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "gFragmentBuffer", linkageName: "\01?gFragmentBuffer@@3V?$StructuredBuffer@UFragmentData@@@@A", scope: !0, file: !1, line: 22, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<FragmentData>", file: !1, line: 22, size: 384, align: 32, elements: !2, templateParams: !104)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "element", type: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "FragmentData", file: !38, line: 75, size: 384, align: 32, elements: !107)
!107 = !{!108, !109, !110, !120, !121}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !106, file: !38, line: 77, baseType: !4, size: 96, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !106, file: !38, line: 78, baseType: !8, size: 32, align: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !106, file: !38, line: 80, baseType: !111, size: 128, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 22, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 22, size: 128, align: 32, elements: !113, templateParams: !118)
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !112, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !112, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !112, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !112, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!118 = !{!12, !119}
!119 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !106, file: !38, line: 82, baseType: !4, size: 96, align: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "voxelLinearCoord", scope: !106, file: !38, line: 83, baseType: !32, size: 32, align: 32, offset: 352)
!122 = !DIGlobalVariable(name: "gNextIndexBuffer", linkageName: "\01?gNextIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 23, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 23, size: 32, align: 32, elements: !2, templateParams: !124)
!124 = !{!23}
!125 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !123, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 26, type: !123, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !123, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !123, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 33, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ClusterData>", file: !1, line: 33, size: 2688, align: 32, elements: !2, templateParams: !131)
!131 = !{!132}
!132 = !DITemplateTypeParameter(name: "element", type: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !134, line: 193, size: 2688, align: 32, elements: !135)
!134 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!135 = !{!136, !137, !140, !142, !143, !144, !145, !146, !147, !148, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !133, file: !134, line: 195, baseType: !15, size: 96, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !133, file: !134, line: 196, baseType: !138, size: 32, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !139, line: 8, baseType: !32)
!139 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !133, file: !134, line: 198, baseType: !141, size: 96, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !139, line: 4, baseType: !4)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !133, file: !134, line: 199, baseType: !138, size: 32, align: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !133, file: !134, line: 201, baseType: !141, size: 96, align: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !133, file: !134, line: 202, baseType: !138, size: 32, align: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !133, file: !134, line: 204, baseType: !141, size: 96, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !133, file: !134, line: 205, baseType: !138, size: 32, align: 32, offset: 480)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !133, file: !134, line: 207, baseType: !141, size: 96, align: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !133, file: !134, line: 208, baseType: !8, size: 32, align: 32, offset: 608)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !133, file: !134, line: 210, baseType: !150, size: 2048, align: 32, offset: 640)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2048, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 64)
!153 = !DIGlobalVariable(name: "gVoxelInClusterBuffer", linkageName: "\01?gVoxelInClusterBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 37, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 37, size: 32, align: 32, elements: !2, templateParams: !124)
!155 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 44, type: !154, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$RWStructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 47, type: !157, isLocal: false, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<float, 3> >", file: !1, line: 47, size: 96, align: 32, elements: !2, templateParams: !158)
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "element", type: !5)
!160 = !DIGlobalVariable(name: "gVoxelNormalDirectionBuffer", linkageName: "\01?gVoxelNormalDirectionBuffer@@3V?$RWStructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 52, type: !157, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariable(name: "gTileBuffer", linkageName: "\01?gTileBuffer@@3V?$RWTexture3D@I@@A", scope: !0, file: !1, line: 56, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture3D<unsigned int>", file: !1, line: 56, size: 32, align: 32, elements: !2, templateParams: !124)
!163 = !DIGlobalVariable(name: "gNextClusterInTileLinkedList", linkageName: "\01?gNextClusterInTileLinkedList@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 63, type: !154, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gCounter", linkageName: "\01?gCounter@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 68, type: !154, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "gSubclusterDataBuffer", linkageName: "\01?gSubclusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 72, type: !130, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "gNextVoxelLinkedList", linkageName: "\01?gNextVoxelLinkedList@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 80, type: !154, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !86, line: 90, type: !168, isLocal: false, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !89, size: 32, align: 4)
!169 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !86, line: 90, type: !170, isLocal: false, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !89, size: 32, align: 4, offset: 64)
!171 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !86, line: 90, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !89, size: 32, align: 4, offset: 32)
!173 = !{i32 2, !"Dwarf Version", i32 4}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
