#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 51bba93e2dfc4c21323c769b30fdfa49.pdb
; shader hash: 51bba93e2dfc4c21323c769b30fdfa49
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !91)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CGaussianFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !14, !23, !24, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 170, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 170, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 170, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 170, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 170, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !{!22, !13}
!22 = !DITemplateTypeParameter(name: "element", type: !18)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 157, baseType: !18)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 192, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 192, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 192, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 192, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 192, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 191, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 191, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 191, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 191, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!22, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 206, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 206, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 206, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 206, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!32, !39}
!46 = !{!47, !50, !54, !57, !61, !67, !70, !73, !77, !80, !83, !87, !88}
!47 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 155, type: !48, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !14}
!50 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !51, file: !51, line: 97, type: !52, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!23, !14, !14}
!54 = !DISubprogram(name: "gaussianDistribution", linkageName: "\01?gaussianDistribution@@YAMMMMM@Z", scope: !1, file: !1, line: 74, type: !55, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!28, !28, !28, !28, !28}
!57 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !58, file: !58, line: 120, type: !59, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!59 = !DISubroutineType(types: !60)
!60 = !{!40, !23}
!61 = !DISubprogram(name: "filterFace", linkageName: "\01?filterFace@@YA?AV?$vector@M$02@@II_NAIA_N@Z", scope: !1, file: !1, line: 84, type: !62, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!24, !23, !23, !64, !65}
!64 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !64)
!67 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !51, file: !51, line: 88, type: !68, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!14, !23, !14}
!70 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !51, file: !51, line: 105, type: !71, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!64, !14, !4, !14}
!73 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !51, file: !51, line: 142, type: !74, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!64, !14, !14, !76}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!77 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !51, file: !51, line: 120, type: !78, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!64, !23, !76}
!80 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 34, type: !81, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!33, !14, !14}
!83 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 131, type: !84, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!64, !23, !86}
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 25, size: 32, align: 32, elements: !2)
!87 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 148, type: !84, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !58, file: !58, line: 128, type: !89, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!23, !40}
!91 = !{!92, !95, !97, !98, !99, !101, !103, !105, !106, !107, !153, !165, !166, !169, !170, !171, !172, !175, !176, !180, !182, !184, !185, !186, !188, !189, !190, !192, !194}
!92 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !93, line: 90, type: !94, isLocal: true, isDefinition: true)
!93 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!95 = !DIGlobalVariable(name: "PI", scope: !0, file: !93, line: 108, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!97 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !93, line: 109, type: !96, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !93, line: 110, type: !96, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !58, line: 48, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!101 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !58, line: 49, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!103 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !104, isLocal: true, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!105 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !96, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !96, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !109)
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "T", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !112, line: 26, size: 1792, align: 32, elements: !113)
!112 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!113 = !{!114, !115, !116, !119, !120, !121, !123, !124, !125, !126, !127, !128, !129, !152}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !111, file: !112, line: 28, baseType: !14, size: 96, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !111, file: !112, line: 29, baseType: !28, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !111, file: !112, line: 31, baseType: !117, size: 96, align: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !118, line: 4, baseType: !24)
!118 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !111, file: !112, line: 32, baseType: !28, size: 32, align: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !111, file: !112, line: 34, baseType: !117, size: 96, align: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !111, file: !112, line: 35, baseType: !122, size: 32, align: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !118, line: 8, baseType: !23)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !111, file: !112, line: 37, baseType: !117, size: 96, align: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !111, file: !112, line: 38, baseType: !122, size: 32, align: 32, offset: 480)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !111, file: !112, line: 40, baseType: !117, size: 96, align: 32, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !111, file: !112, line: 41, baseType: !122, size: 32, align: 32, offset: 608)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !111, file: !112, line: 43, baseType: !117, size: 96, align: 32, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !111, file: !112, line: 44, baseType: !28, size: 32, align: 32, offset: 736)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !111, file: !112, line: 46, baseType: !130, size: 512, align: 32, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !132, templateParams: !149)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !131, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!149 = !{!32, !150, !151}
!150 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!151 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !111, file: !112, line: 47, baseType: !130, size: 512, align: 32, offset: 1280)
!153 = !DIGlobalVariable(name: "cbGaussianFilter", linkageName: "\01?cbGaussianFilter@@3U?$ConstantBuffer@UConstantBufferGaussianFilter@@@@A", scope: !0, file: !1, line: 4, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferGaussianFilter>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "T", type: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferGaussianFilter", file: !112, line: 221, size: 256, align: 32, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !157, file: !112, line: 223, baseType: !117, size: 96, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !157, file: !112, line: 224, baseType: !122, size: 32, align: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !157, file: !112, line: 226, baseType: !122, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "KernelSize", scope: !157, file: !112, line: 227, baseType: !122, size: 32, align: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !157, file: !112, line: 228, baseType: !122, size: 32, align: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !157, file: !112, line: 229, baseType: !122, size: 32, align: 32, offset: 224)
!165 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !76, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !168)
!168 = !{!22}
!169 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !167, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !167, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !167, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 14, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !174)
!174 = !{!32}
!175 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 15, type: !173, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "gFaceRadianceReadBuffer", linkageName: "\01?gFaceRadianceReadBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 17, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !178)
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "element", type: !34)
!180 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 20, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !178)
!182 = !DIGlobalVariable(name: "gGaussianPrecomputedDataBuffer", linkageName: "\01?gGaussianPrecomputedDataBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 21, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !174)
!184 = !DIGlobalVariable(name: "gWriteFinalRadianceBuffer", linkageName: "\01?gWriteFinalRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 23, type: !181, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 25, type: !86, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariable(name: "gGaussianFaceIndices", linkageName: "\01?gGaussianFaceIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 26, type: !187, isLocal: false, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !168)
!188 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 27, type: !86, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 28, type: !86, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !93, line: 90, type: !191, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !94, size: 32, align: 4, offset: 64)
!192 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !93, line: 90, type: !193, isLocal: false, isDefinition: true)
!193 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !94, size: 32, align: 4)
!194 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !93, line: 90, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !94, size: 32, align: 4, offset: 32)
!196 = !{i32 2, !"Dwarf Version", i32 4}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
