#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 94041a1280834d56fa6e99272f3b7095.pdb
; shader hash: 94041a1280834d56fa6e99272f3b7095
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbLerpRadiance
; {
;
;   struct cbLerpRadiance
;   {
;
;       struct struct.ConstantBufferLerpRadiance
;       {
;
;           uint CurrentPhase;                        ; Offset:    0
;           float accumulatedTime;                    ; Offset:    4
;           float maxTime;                            ; Offset:    8
;           uint FaceCount;                           ; Offset:   12
;       
;       } cbLerpRadiance;                             ; Offset:    0
;
;   
;   } cbLerpRadiance;                                 ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gCurrentGaussianRadiance
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gFinalLerpRadiance
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gLerpStartRadiance
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !30, globals: !52)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CLerpRadiance_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 75, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 75, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 75, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 75, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 75, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 63, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 63, size: 64, align: 32, elements: !17, templateParams: !21)
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 63, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 63, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !19)
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 88, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 88, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !23}
!30 = !{!31, !41, !46, !49}
!31 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 27, type: !32, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!22, !13}
!41 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !42, file: !42, line: 120, type: !43, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!24, !45}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !19)
!46 = !DISubprogram(name: "easeOutInterpolation", linkageName: "\01?easeOutInterpolation@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !1, file: !1, line: 14, type: !47, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!4, !4, !4, !8}
!49 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !42, file: !42, line: 128, type: !50, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!45, !24}
!52 = !{!53, !56, !58, !59, !60, !62, !64, !67, !68, !69, !115, !125, !129, !130, !131, !132, !134, !136}
!53 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !54, line: 90, type: !55, isLocal: true, isDefinition: true)
!54 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIGlobalVariable(name: "PI", scope: !0, file: !54, line: 108, type: !57, isLocal: true, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!58 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !54, line: 109, type: !57, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !54, line: 110, type: !57, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !42, line: 48, type: !61, isLocal: false, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!62 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !42, line: 49, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!64 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !65, line: 15, type: !66, isLocal: true, isDefinition: true)
!65 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!67 = !DIGlobalVariable(name: "cos30", scope: !0, file: !65, line: 16, type: !57, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariable(name: "cos25", scope: !0, file: !65, line: 17, type: !57, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariable(name: "cbCommons", linkageName: "\01?cbCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "T", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !74, line: 26, size: 1792, align: 32, elements: !75)
!74 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!75 = !{!76, !77, !78, !81, !82, !83, !85, !86, !87, !88, !89, !90, !91, !114}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !73, file: !74, line: 28, baseType: !34, size: 96, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !73, file: !74, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !73, file: !74, line: 31, baseType: !79, size: 96, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !80, line: 4, baseType: !4)
!80 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !73, file: !74, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !73, file: !74, line: 34, baseType: !79, size: 96, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !73, file: !74, line: 35, baseType: !84, size: 32, align: 32, offset: 352)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !80, line: 8, baseType: !45)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !73, file: !74, line: 37, baseType: !79, size: 96, align: 32, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !73, file: !74, line: 38, baseType: !84, size: 32, align: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !73, file: !74, line: 40, baseType: !79, size: 96, align: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !73, file: !74, line: 41, baseType: !84, size: 32, align: 32, offset: 608)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !73, file: !74, line: 43, baseType: !79, size: 96, align: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !73, file: !74, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !73, file: !74, line: 46, baseType: !92, size: 512, align: 32, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !94, templateParams: !111)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !93, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!111 = !{!12, !112, !113}
!112 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!113 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !73, file: !74, line: 47, baseType: !92, size: 512, align: 32, offset: 1280)
!115 = !DIGlobalVariable(name: "cbLerpRadiance", linkageName: "\01?cbLerpRadiance@@3U?$ConstantBuffer@UConstantBufferLerpRadiance@@@@A", scope: !0, file: !1, line: 4, type: !116, isLocal: false, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferLerpRadiance>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !117)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "T", type: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferLerpRadiance", file: !74, line: 185, size: 128, align: 32, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !119, file: !74, line: 187, baseType: !84, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "accumulatedTime", scope: !119, file: !74, line: 188, baseType: !8, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !119, file: !74, line: 189, baseType: !8, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !119, file: !74, line: 190, baseType: !84, size: 32, align: 32, offset: 96)
!125 = !DIGlobalVariable(name: "gCurrentGaussianRadiance", linkageName: "\01?gCurrentGaussianRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 6, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 6, size: 64, align: 32, elements: !2, templateParams: !127)
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "element", type: !16)
!129 = !DIGlobalVariable(name: "gFinalLerpRadiance", linkageName: "\01?gFinalLerpRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 8, type: !126, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "gLerpStartRadiance", linkageName: "\01?gLerpStartRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 9, type: !126, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "gLerpEndRadiance", linkageName: "\01?gLerpEndRadiance@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 11, type: !126, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !54, line: 90, type: !133, isLocal: false, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !55, size: 32, align: 4)
!134 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !54, line: 90, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !55, size: 32, align: 4, offset: 32)
!136 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !54, line: 90, type: !137, isLocal: false, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !55, size: 32, align: 4, offset: 64)
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
