#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 0d6f33a6b8e8a4c2df410a73319a5ffb.pdb
; shader hash: 0d6f33a6b8e8a4c2df410a73319a5ffb
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !39)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CLightTransportDepth_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 90, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 90, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 90, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !19)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 41, baseType: !8)
!25 = !{!26, !29, !33, !38}
!26 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 39, type: !27, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !4}
!29 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !30, file: !30, line: 88, type: !31, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!30 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!4, !24, !4}
!33 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !30, file: !30, line: 131, type: !34, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !24, !37}
!36 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 23, size: 32, align: 32, elements: !2)
!38 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !30, file: !30, line: 148, type: !34, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!39 = !{!40, !42, !45, !47, !48, !49, !52, !54, !55, !56, !57, !103, !129, !147, !150, !151, !152, !153, !161, !171, !172, !176, !186, !187, !189, !190, !191, !192, !196, !197, !198, !199, !201, !203}
!40 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !30, line: 15, type: !41, isLocal: true, isDefinition: true, variable: i32 -1)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!42 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !43, line: 90, type: !44, isLocal: true, isDefinition: true)
!43 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!45 = !DIGlobalVariable(name: "PI", scope: !0, file: !43, line: 108, type: !46, isLocal: true, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!47 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !43, line: 109, type: !46, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !43, line: 110, type: !46, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !50, line: 48, type: !51, isLocal: false, isDefinition: true)
!50 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!52 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !50, line: 49, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!54 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !30, line: 15, type: !41, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariable(name: "cos30", scope: !0, file: !30, line: 16, type: !46, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariable(name: "cos25", scope: !0, file: !30, line: 17, type: !46, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 5, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 5, size: 32, align: 32, elements: !2, templateParams: !59)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !62, line: 26, size: 1792, align: 32, elements: !63)
!62 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!63 = !{!64, !65, !66, !69, !70, !71, !73, !74, !75, !76, !77, !78, !79, !102}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !61, file: !62, line: 28, baseType: !4, size: 96, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !61, file: !62, line: 29, baseType: !19, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !61, file: !62, line: 31, baseType: !67, size: 96, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !68, line: 4, baseType: !15)
!68 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !61, file: !62, line: 32, baseType: !19, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !61, file: !62, line: 34, baseType: !67, size: 96, align: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !61, file: !62, line: 35, baseType: !72, size: 32, align: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !68, line: 8, baseType: !24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !61, file: !62, line: 37, baseType: !67, size: 96, align: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !61, file: !62, line: 38, baseType: !72, size: 32, align: 32, offset: 480)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !61, file: !62, line: 40, baseType: !67, size: 96, align: 32, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !61, file: !62, line: 41, baseType: !72, size: 32, align: 32, offset: 608)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !61, file: !62, line: 43, baseType: !67, size: 96, align: 32, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !61, file: !62, line: 44, baseType: !19, size: 32, align: 32, offset: 736)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !61, file: !62, line: 46, baseType: !80, size: 512, align: 32, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !82, templateParams: !99)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !81, file: !1, line: 5, baseType: !19, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!99 = !{!23, !100, !101}
!100 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!101 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !61, file: !62, line: 47, baseType: !80, size: 512, align: 32, offset: 1280)
!103 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 6, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !105)
!105 = !{!106}
!106 = !DITemplateTypeParameter(name: "T", type: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !62, line: 139, size: 1024, align: 32, elements: !108)
!108 = !{!109, !123, !124, !125, !126, !127, !128}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !107, file: !62, line: 141, baseType: !110, size: 768, align: 32)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 768, align: 32, elements: !121)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !68, line: 5, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 95, baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 95, size: 128, align: 32, elements: !114, templateParams: !119)
!114 = !{!115, !116, !117, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !113, file: !1, line: 95, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !113, file: !1, line: 95, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !113, file: !1, line: 95, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !113, file: !1, line: 95, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!119 = !{!23, !120}
!120 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !107, file: !62, line: 143, baseType: !67, size: 96, align: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !107, file: !62, line: 144, baseType: !72, size: 32, align: 32, offset: 864)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !107, file: !62, line: 146, baseType: !72, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !107, file: !62, line: 147, baseType: !72, size: 32, align: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !107, file: !62, line: 148, baseType: !72, size: 32, align: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ResetRadianceBuffers", scope: !107, file: !62, line: 149, baseType: !72, size: 32, align: 32, offset: 992)
!129 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@ULight@@@@A", scope: !0, file: !1, line: 7, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Light>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !131)
!131 = !{!132}
!132 = !DITemplateTypeParameter(name: "T", type: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !43, line: 6, size: 1536, align: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !133, file: !43, line: 8, baseType: !15, size: 96, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !133, file: !43, line: 9, baseType: !19, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !133, file: !43, line: 10, baseType: !15, size: 96, align: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !133, file: !43, line: 11, baseType: !19, size: 32, align: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !133, file: !43, line: 12, baseType: !15, size: 96, align: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !133, file: !43, line: 13, baseType: !19, size: 32, align: 32, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !133, file: !43, line: 14, baseType: !80, size: 512, align: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !133, file: !43, line: 15, baseType: !80, size: 512, align: 32, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !133, file: !43, line: 16, baseType: !14, size: 32, align: 32, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !133, file: !43, line: 17, baseType: !19, size: 32, align: 32, offset: 1440)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !133, file: !43, line: 18, baseType: !19, size: 32, align: 32, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !133, file: !43, line: 19, baseType: !19, size: 32, align: 32, offset: 1504)
!147 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 9, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!12}
!150 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !148, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !148, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !148, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 14, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 14, size: 192, align: 32, elements: !2, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "element", type: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !62, line: 12, size: 192, align: 32, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !157, file: !62, line: 14, baseType: !15, size: 96, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !157, file: !62, line: 15, baseType: !15, size: 96, align: 32, offset: 96)
!161 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 15, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 15, size: 256, align: 32, elements: !2, templateParams: !163)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "element", type: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !62, line: 177, size: 256, align: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !165, file: !62, line: 179, baseType: !67, size: 96, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !165, file: !62, line: 180, baseType: !72, size: 32, align: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !165, file: !62, line: 181, baseType: !67, size: 96, align: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !165, file: !62, line: 182, baseType: !72, size: 32, align: 32, offset: 224)
!171 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !148, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariable(name: "gCameraDepth", linkageName: "\01?gCameraDepth@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 19, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 19, size: 160, align: 32, elements: !2, templateParams: !174)
!174 = !{!175}
!175 = !DITemplateTypeParameter(name: "element", type: !113)
!176 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 21, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !178)
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "element", type: !180)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 21, size: 64, align: 32, elements: !181, templateParams: !184)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !180, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !180, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!184 = !{!12, !185}
!185 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!186 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 23, type: !37, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !149)
!189 = !DIGlobalVariable(name: "gGaussianVisibleFacesIndices", linkageName: "\01?gGaussianVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !188, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !37, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 27, type: !37, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariable(name: "gGaussianDispatchIndirectBuffer", linkageName: "\01?gGaussianDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 28, type: !193, isLocal: false, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 28, size: 96, align: 32, elements: !2, templateParams: !194)
!194 = !{!195}
!195 = !DITemplateTypeParameter(name: "element", type: !5)
!196 = !DIGlobalVariable(name: "gIndirectLightDispatchIndirectBuffer", linkageName: "\01?gIndirectLightDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 29, type: !193, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 33, type: !177, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 35, type: !46, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !43, line: 90, type: !200, isLocal: false, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !44, size: 32, align: 4, offset: 32)
!201 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !43, line: 90, type: !202, isLocal: false, isDefinition: true)
!202 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !44, size: 32, align: 4)
!203 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !43, line: 90, type: !204, isLocal: false, isDefinition: true)
!204 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !44, size: 32, align: 4, offset: 64)
!205 = !{i32 2, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
