#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 7802924852cde0ed9bef33a08fa8b0e5.pdb
; shader hash: 7802924852cde0ed9bef33a08fa8b0e5
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbCommons
; {
;
;   struct hostlayout.cbCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80
;           float pad3;                               ; Offset:   92

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !40, globals: !63)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CLitVoxels_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24, !33, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 80, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 80, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 80, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 80, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 80, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 80, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 80, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 80, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 80, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 80, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 80, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !23}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 95, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 95, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 95, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 95, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!32, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !{!41, !44, !49, !52, !55, !60}
!41 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 69, type: !42, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !24}
!44 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !45, file: !45, line: 88, type: !46, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!24, !48, !24}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 76, baseType: !28)
!49 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 25, type: !50, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!33, !24, !24}
!52 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !45, file: !45, line: 97, type: !53, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!48, !24, !24}
!55 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !45, file: !45, line: 148, type: !56, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !48, !59}
!58 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 21, size: 32, align: 32, elements: !2)
!60 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !45, file: !45, line: 198, type: !61, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!8, !16, !16}
!63 = !{!64, !66, !69, !71, !72, !73, !76, !78, !79, !80, !81, !127, !145, !149, !151, !154, !155, !156, !157, !177, !178, !179, !183, !184, !195, !197, !199}
!64 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !45, line: 15, type: !65, isLocal: true, isDefinition: true, variable: i32 -1)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!66 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !67, line: 90, type: !68, isLocal: true, isDefinition: true)
!67 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!69 = !DIGlobalVariable(name: "PI", scope: !0, file: !67, line: 108, type: !70, isLocal: true, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!71 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !67, line: 109, type: !70, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !67, line: 110, type: !70, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !74, line: 48, type: !75, isLocal: false, isDefinition: true)
!74 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!76 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !74, line: 49, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!78 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !45, line: 15, type: !65, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariable(name: "cos30", scope: !0, file: !45, line: 16, type: !70, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariable(name: "cos25", scope: !0, file: !45, line: 17, type: !70, isLocal: true, isDefinition: true)
!81 = !DIGlobalVariable(name: "cbCommons", linkageName: "\01?cbCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "T", type: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !86, line: 26, size: 1792, align: 32, elements: !87)
!86 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!87 = !{!88, !89, !90, !93, !94, !95, !97, !98, !99, !100, !101, !102, !103, !126}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !85, file: !86, line: 28, baseType: !24, size: 96, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !85, file: !86, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !85, file: !86, line: 31, baseType: !91, size: 96, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !92, line: 4, baseType: !16)
!92 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !85, file: !86, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !85, file: !86, line: 34, baseType: !91, size: 96, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !85, file: !86, line: 35, baseType: !96, size: 32, align: 32, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !92, line: 8, baseType: !48)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !85, file: !86, line: 37, baseType: !91, size: 96, align: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !85, file: !86, line: 38, baseType: !96, size: 32, align: 32, offset: 480)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !85, file: !86, line: 40, baseType: !91, size: 96, align: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !85, file: !86, line: 41, baseType: !96, size: 32, align: 32, offset: 608)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !85, file: !86, line: 43, baseType: !91, size: 96, align: 32, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !85, file: !86, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !85, file: !86, line: 46, baseType: !104, size: 512, align: 32, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !106, templateParams: !123)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !105, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!123 = !{!13, !124, !125}
!124 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!125 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !85, file: !86, line: 47, baseType: !104, size: 512, align: 32, offset: 1280)
!127 = !DIGlobalVariable(name: "cbLight", linkageName: "\01?cbLight@@3U?$ConstantBuffer@ULight@@@@A", scope: !0, file: !1, line: 4, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Light>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !129)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !67, line: 6, size: 1536, align: 32, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !131, file: !67, line: 8, baseType: !16, size: 96, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !131, file: !67, line: 9, baseType: !8, size: 32, align: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !131, file: !67, line: 10, baseType: !16, size: 96, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !131, file: !67, line: 11, baseType: !8, size: 32, align: 32, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !131, file: !67, line: 12, baseType: !16, size: 96, align: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !131, file: !67, line: 13, baseType: !8, size: 32, align: 32, offset: 352)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !131, file: !67, line: 14, baseType: !104, size: 512, align: 32, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !131, file: !67, line: 15, baseType: !104, size: 512, align: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !131, file: !67, line: 16, baseType: !15, size: 32, align: 32, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !131, file: !67, line: 17, baseType: !8, size: 32, align: 32, offset: 1440)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !131, file: !67, line: 18, baseType: !8, size: 32, align: 32, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !131, file: !67, line: 19, baseType: !8, size: 32, align: 32, offset: 1504)
!145 = !DIGlobalVariable(name: "gShadowMapTexture", linkageName: "\01?gShadowMapTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 6, size: 160, align: 32, elements: !2, templateParams: !147)
!147 = !{!148}
!148 = !DITemplateTypeParameter(name: "element", type: !5)
!149 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 8, type: !150, isLocal: false, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 8, size: 32, align: 32, elements: !2)
!151 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!32}
!154 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !152, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !152, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !152, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 15, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 15, size: 2688, align: 32, elements: !2, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !86, line: 199, size: 2688, align: 32, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !161, file: !86, line: 201, baseType: !24, size: 96, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !161, file: !86, line: 202, baseType: !96, size: 32, align: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !161, file: !86, line: 204, baseType: !91, size: 96, align: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !161, file: !86, line: 205, baseType: !96, size: 32, align: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !161, file: !86, line: 207, baseType: !91, size: 96, align: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !161, file: !86, line: 208, baseType: !96, size: 32, align: 32, offset: 352)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !161, file: !86, line: 210, baseType: !91, size: 96, align: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !161, file: !86, line: 211, baseType: !96, size: 32, align: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !161, file: !86, line: 213, baseType: !91, size: 96, align: 32, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !161, file: !86, line: 214, baseType: !8, size: 32, align: 32, offset: 608)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !161, file: !86, line: 216, baseType: !174, size: 2048, align: 32, offset: 640)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, align: 32, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 64)
!177 = !DIGlobalVariable(name: "gNextVoxelLinkedList", linkageName: "\01?gNextVoxelLinkedList@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 16, type: !152, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !152, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 18, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 18, size: 96, align: 32, elements: !2, templateParams: !181)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "element", type: !17)
!183 = !DIGlobalVariable(name: "gVoxelLitBuffer", linkageName: "\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 21, type: !59, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariable(name: "gClusterLitBuffer", linkageName: "\01?gClusterLitBuffer@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 22, type: !185, isLocal: false, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !186)
!186 = !{!187}
!187 = !DITemplateTypeParameter(name: "element", type: !188)
!188 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 22, size: 128, align: 32, elements: !189, templateParams: !194)
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !188, file: !1, line: 22, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !188, file: !1, line: 22, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !188, file: !1, line: 22, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !188, file: !1, line: 22, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!194 = !{!32, !14}
!195 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !67, line: 90, type: !196, isLocal: false, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !68, size: 32, align: 4)
!197 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !67, line: 90, type: !198, isLocal: false, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !68, size: 32, align: 4, offset: 64)
!199 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !67, line: 90, type: !200, isLocal: false, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !68, size: 32, align: 4, offset: 32)
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
