#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 98041c6572f022a8429950d891c16a44.pdb
; shader hash: 98041c6572f022a8429950d891c16a44
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbPrefixSum
; {
;
;   struct cbPrefixSum
;   {
;
;       uint gCurrentPhase;                           ; Offset:    0
;       uint gCurrentStep;                            ; Offset:    4
;       uint gPrefixSumBufferSize;                    ; Offset:    8
;       uint gElementsPerThread;                      ; Offset:   12
;       uint gNumStepsSweepDown;                      ; Offset:   16
;       uint gNumElementsBase;                        ; Offset:   20
;       uint gNumElementsLevel0;                      ; Offset:   24
;       uint gNumElementsLevel1;                      ; Offset:   28
;       uint gNumElementsLevel2;                      ; Offset:   32
;       uint gNumElementsLevel3;                      ; Offset:   36
;       float pad0;                                   ; Offset:   40
;       float pad1;                                   ; Offset:   44
;       uint3 gVoxelGridDimension;                    ; Offset:   48

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !25)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CPrefixSum_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 5, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !{!8, !21}
!8 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 41, type: !9, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !4}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 20, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 20, size: 96, align: 32, elements: !13, templateParams: !17)
!13 = !{!14, !15, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !12, file: !1, line: 20, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !12, file: !1, line: 20, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !12, file: !1, line: 20, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !{!18, !19}
!18 = !DITemplateTypeParameter(name: "element", type: !5)
!19 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !22, file: !22, line: 88, type: !23, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!22 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!11, !4, !11}
!25 = !{!26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !39, !40, !42, !43, !45, !56, !57, !58, !59, !62, !64, !65, !66, !67, !87, !90, !91, !92, !93, !94, !95, !96, !98, !100}
!26 = !DIGlobalVariable(name: "gCurrentPhase", linkageName: "\01?gCurrentPhase@cbPrefixSum@@3IB", scope: !0, file: !1, line: 5, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!28 = !DIGlobalVariable(name: "gCurrentStep", linkageName: "\01?gCurrentStep@cbPrefixSum@@3IB", scope: !0, file: !1, line: 6, type: !27, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariable(name: "gPrefixSumBufferSize", linkageName: "\01?gPrefixSumBufferSize@cbPrefixSum@@3IB", scope: !0, file: !1, line: 7, type: !27, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariable(name: "gElementsPerThread", linkageName: "\01?gElementsPerThread@cbPrefixSum@@3IB", scope: !0, file: !1, line: 8, type: !27, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariable(name: "gNumStepsSweepDown", linkageName: "\01?gNumStepsSweepDown@cbPrefixSum@@3IB", scope: !0, file: !1, line: 10, type: !27, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariable(name: "gNumElementsBase", linkageName: "\01?gNumElementsBase@cbPrefixSum@@3IB", scope: !0, file: !1, line: 11, type: !27, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariable(name: "gNumElementsLevel0", linkageName: "\01?gNumElementsLevel0@cbPrefixSum@@3IB", scope: !0, file: !1, line: 12, type: !27, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariable(name: "gNumElementsLevel1", linkageName: "\01?gNumElementsLevel1@cbPrefixSum@@3IB", scope: !0, file: !1, line: 13, type: !27, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariable(name: "gNumElementsLevel2", linkageName: "\01?gNumElementsLevel2@cbPrefixSum@@3IB", scope: !0, file: !1, line: 15, type: !27, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariable(name: "gNumElementsLevel3", linkageName: "\01?gNumElementsLevel3@cbPrefixSum@@3IB", scope: !0, file: !1, line: 16, type: !27, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariable(name: "pad0", linkageName: "\01?pad0@cbPrefixSum@@3MB", scope: !0, file: !1, line: 17, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!39 = !DIGlobalVariable(name: "pad1", linkageName: "\01?pad1@cbPrefixSum@@3MB", scope: !0, file: !1, line: 18, type: !38, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariable(name: "gVoxelGridDimension", linkageName: "\01?gVoxelGridDimension@cbPrefixSum@@3V?$vector@I$02@@B", scope: !0, file: !1, line: 20, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!42 = !DIGlobalVariable(name: "pad2", linkageName: "\01?pad2@cbPrefixSum@@3MB", scope: !0, file: !1, line: 21, type: !38, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !22, line: 15, type: !44, isLocal: true, isDefinition: true, variable: i32 -1)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!45 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !46, line: 90, type: !47, isLocal: true, isDefinition: true)
!46 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !50, templateParams: !54)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 90, baseType: !6, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 90, baseType: !6, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !49, file: !1, line: 90, baseType: !6, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !{!55, !19}
!55 = !DITemplateTypeParameter(name: "element", type: !6)
!56 = !DIGlobalVariable(name: "PI", scope: !0, file: !46, line: 108, type: !38, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !46, line: 109, type: !38, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !46, line: 110, type: !38, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !60, line: 48, type: !61, isLocal: false, isDefinition: true)
!60 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!62 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !60, line: 49, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!64 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !22, line: 15, type: !44, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariable(name: "cos30", scope: !0, file: !22, line: 16, type: !38, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "cos25", scope: !0, file: !22, line: 17, type: !38, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "gFragmentDataBuffer", linkageName: "\01?gFragmentDataBuffer@@3V?$RWStructuredBuffer@UFragmentData@@@@A", scope: !0, file: !1, line: 26, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<FragmentData>", file: !1, line: 26, size: 384, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "element", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "FragmentData", file: !22, line: 75, size: 384, align: 32, elements: !72)
!72 = !{!73, !74, !75, !85, !86}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !71, file: !22, line: 77, baseType: !48, size: 96, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !71, file: !22, line: 78, baseType: !6, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !71, file: !22, line: 80, baseType: !76, size: 128, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !78, templateParams: !83)
!78 = !{!79, !80, !81, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !77, file: !1, line: 26, baseType: !6, size: 32, align: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !77, file: !1, line: 26, baseType: !6, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !77, file: !1, line: 26, baseType: !6, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !77, file: !1, line: 26, baseType: !6, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!83 = !{!55, !84}
!84 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !71, file: !22, line: 82, baseType: !48, size: 96, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "voxelLinearCoord", scope: !71, file: !22, line: 83, baseType: !4, size: 32, align: 32, offset: 352)
!87 = !DIGlobalVariable(name: "gNextIndexBuffer", linkageName: "\01?gNextIndexBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 27, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !89)
!89 = !{!18}
!90 = !DIGlobalVariable(name: "gVoxelIndicesBuffer", linkageName: "\01?gVoxelIndicesBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 28, type: !88, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 32, type: !88, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 33, type: !88, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "gVoxelIndicesCompacted", linkageName: "\01?gVoxelIndicesCompacted@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !88, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "gVoxelHashesCompacted", linkageName: "\01?gVoxelHashesCompacted@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 36, type: !88, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "gPrefixSumBuffer", linkageName: "\01?gPrefixSumBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 38, type: !88, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !46, line: 90, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !47, size: 32, align: 4, offset: 32)
!98 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !46, line: 90, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !47, size: 32, align: 4, offset: 64)
!100 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !46, line: 90, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !47, size: 32, align: 4)
!102 = !{i32 2, !"Dwarf Version", i32 4}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
