#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   x           0     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; VOXELINDEX               0   x           1     NONE    uint   x   
;
; shader debug name: 55c0bfae2fb552b6b34d6d3585c6e5be.pdb
; shader hash: 55c0bfae2fb552b6b34d6d3585c6e5be
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; VOXELINDEX               0        nointerpolation       
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
;
; ViewId state:
;
; Number of inputs: 1, outputs: 5

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !27)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxelDisplay_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VS", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VS)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOutVoxelIndex", file: !21, line: 28, size: 160, align: 32, elements: !22)
!21 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !20, file: !21, line: 30, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelIndex", scope: !20, file: !21, line: 31, baseType: !25, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !26)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !{!28, !39, !41, !42, !43, !46, !48, !50, !51, !52, !54, !56}
!28 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !29, line: 90, type: !30, isLocal: true, isDefinition: true)
!29 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 90, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!13, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!39 = !DIGlobalVariable(name: "PI", scope: !0, file: !29, line: 108, type: !40, isLocal: true, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!41 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !29, line: 109, type: !40, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !29, line: 110, type: !40, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !44, line: 48, type: !45, isLocal: false, isDefinition: true)
!44 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!46 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !44, line: 49, type: !47, isLocal: false, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!48 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !21, line: 15, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!50 = !DIGlobalVariable(name: "cos30", scope: !0, file: !21, line: 16, type: !40, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariable(name: "cos25", scope: !0, file: !21, line: 17, type: !40, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !29, line: 90, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !30, size: 32, align: 4, offset: 64)
!54 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !29, line: 90, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !30, size: 32, align: 4, offset: 32)
!56 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !29, line: 90, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !30, size: 32, align: 4)
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!61 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxelDisplay_VS.hlsl", !"#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A\0D\0AVertexOutVoxelIndex VS(uint coord : SV_Position)\0D\0A{\0D\0A    VertexOutVoxelIndex gsInput;\0D\0A    gsInput.Pos = float4(coord, 0.0f, 0.0f, 1.0f);\0D\0A    gsInput.VoxelIndex = coord;\0D\0A    \0D\0A    return gsInput;\0D\0A}"}
