#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; AXIS                     0   x           2     NONE    uint       
; NORMAL                   0   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; AXIS                     0   x           2     NONE    uint   x   
; NORMAL                   0   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
;
; shader debug name: faad094a7b667e6bc81e8c4cd94f1900.pdb
; shader hash: faad094a7b667e6bc81e8c4cd94f1900
;
; Pipeline Runtime Information: 
;
; Geometry Shader
; InputPrimitive=triangle
; OutputTopology=triangle
; OutputStreamMask=1
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !51)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxel_GS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "GS", scope: !1, file: !1, line: 9, type: !5, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @GS)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7, !47}
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1248, align: 32, elements: !45)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOutVoxel", file: !9, line: 19, size: 416, align: 32, elements: !10)
!9 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!10 = !{!11, !24, !33, !36, !37}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "PosH", scope: !8, file: !9, line: 21, baseType: !12, size: 128, align: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !14, templateParams: !20)
!14 = !{!15, !17, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !13, file: !1, line: 5, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!16 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !13, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !13, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !13, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !16)
!22 = !DITemplateValueParameter(name: "element_count", type: !23, value: i32 4)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "PosW", scope: !8, file: !9, line: 22, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 5, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!21, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !23, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ProjAxis", scope: !8, file: !9, line: 23, baseType: !34, size: 32, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 5, baseType: !35)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "NormalW", scope: !8, file: !9, line: 24, baseType: !25, size: 96, align: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !8, file: !9, line: 25, baseType: !38, size: 64, align: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 5, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 5, size: 64, align: 32, elements: !40, templateParams: !43)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 5, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !{!21, !44}
!44 = !DITemplateValueParameter(name: "element_count", type: !23, value: i32 2)
!45 = !{!46}
!46 = !DISubrange(count: 3)
!47 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "TriangleStream<VertexOutVoxel>", file: !1, line: 5, size: 416, align: 32, elements: !2, templateParams: !49)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "element", type: !8)
!51 = !{!52, !89, !92, !94, !95, !96, !99, !101, !103, !104, !105, !107, !109}
!52 = !DIGlobalVariable(name: "voxelCamera", linkageName: "\01?voxelCamera@cbVoxelCamera@@3UVoxelCamera@@B", scope: !0, file: !1, line: 5, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelCamera", file: !9, line: 58, size: 3712, align: 32, elements: !55)
!55 = !{!56, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "xAxisView", scope: !54, file: !9, line: 60, baseType: !57, size: 512, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 5, baseType: !16, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!21, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !23, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !23, value: i32 4)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "yAxisView", scope: !54, file: !9, line: 61, baseType: !57, size: 512, align: 32, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "zAxisView", scope: !54, file: !9, line: 62, baseType: !57, size: 512, align: 32, offset: 1024)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "orthoProj", scope: !54, file: !9, line: 63, baseType: !57, size: 512, align: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "xAxisViewProj", scope: !54, file: !9, line: 65, baseType: !57, size: 512, align: 32, offset: 2048)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "yAxisViewProj", scope: !54, file: !9, line: 66, baseType: !57, size: 512, align: 32, offset: 2560)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "zAxisViewProj", scope: !54, file: !9, line: 67, baseType: !57, size: 512, align: 32, offset: 3072)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "nearPlane", scope: !54, file: !9, line: 69, baseType: !16, size: 32, align: 32, offset: 3584)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "farPlane", scope: !54, file: !9, line: 70, baseType: !16, size: 32, align: 32, offset: 3616)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !54, file: !9, line: 71, baseType: !16, size: 32, align: 32, offset: 3648)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !54, file: !9, line: 72, baseType: !16, size: 32, align: 32, offset: 3680)
!89 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !90, line: 90, type: !91, isLocal: true, isDefinition: true)
!90 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!92 = !DIGlobalVariable(name: "PI", scope: !0, file: !90, line: 108, type: !93, isLocal: true, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!94 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !90, line: 109, type: !93, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !90, line: 110, type: !93, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !97, line: 48, type: !98, isLocal: false, isDefinition: true)
!97 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!99 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !97, line: 49, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!101 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !9, line: 15, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!103 = !DIGlobalVariable(name: "cos30", scope: !0, file: !9, line: 16, type: !93, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariable(name: "cos25", scope: !0, file: !9, line: 17, type: !93, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !90, line: 90, type: !106, isLocal: false, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !91, size: 32, align: 4)
!107 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !90, line: 90, type: !108, isLocal: false, isDefinition: true)
!108 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !91, size: 32, align: 4, offset: 64)
!109 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !90, line: 90, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !91, size: 32, align: 4, offset: 32)
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!114 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxel_GS.hlsl", !"#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A\0D\0Acbuffer cbVoxelCamera : register(b1)\0D\0A{\0D\0A    VoxelCamera voxelCamera;\0D\0A}\0D\0A\0D\0A[maxvertexcount(3)]\0D\0Avoid GS(\0D\0A\09triangle VertexOutVoxel input[3], \0D\0A\09inout TriangleStream< VertexOutVoxel > output\0D\0A)\0D\0A{\0D\0A\09// Compute face normal\0D\0A    float3 faceNormal = abs(normalize(cross(input[1].PosW - input[0].PosW, input[2].PosW - input[0].PosW)));\0D\0A    float maxNormal = max(faceNormal.x, max(faceNormal.y, faceNormal.z));\0D\0A\09\0D\0A    float4x4 viewMatrix = voxelCamera.xAxisView;\0D\0A    uint projAxis = 0;\0D\0A\09\0D\0A\09if (maxNormal == faceNormal.y)\0D\0A    {\0D\0A        viewMatrix = voxelCamera.yAxisView;\0D\0A        projAxis = 1;\0D\0A    }\0D\0A\09else if (maxNormal == faceNormal.z)\0D\0A    {\0D\0A        viewMatrix = voxelCamera.zAxisView;\0D\0A\09\09projAxis = 2;\0D\0A    }\0D\0A\0D\0A\09\0D\0A\09for (uint i = 0; i < 3; i++)\0D\0A\09{\0D\0A\09\09VertexOutVoxel element;\0D\0A\09\09element = input[i];\0D\0A        element.PosH = mul(element.PosH, mul(viewMatrix, voxelCamera.orthoProj));\0D\0A\09\09element.ProjAxis = projAxis;\0D\0A\09\09element.Tex = input[i].Tex;\0D\0A\09\09output.Append(element);\0D\0A\09}\0D\0A\09\0D\0A}"}
