#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; AXIS                     0   x           2     NONE    uint   x   
; NORMAL                   0   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
;
; shader debug name: 07805b05fb586729a24acf73715d28d3.pdb
; shader hash: 07805b05fb586729a24acf73715d28d3
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !66)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxel_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 15, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 15, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "VS", scope: !1, file: !1, line: 8, type: !33, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VS)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !60}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOutVoxel", file: !36, line: 19, size: 416, align: 32, elements: !37)
!36 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!37 = !{!38, !39, !48, !51, !52}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "PosH", scope: !35, file: !36, line: 21, baseType: !4, size: 128, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "PosW", scope: !35, file: !36, line: 22, baseType: !40, size: 96, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!13, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ProjAxis", scope: !35, file: !36, line: 23, baseType: !49, size: 32, align: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 5, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "NormalW", scope: !35, file: !36, line: 24, baseType: !40, size: 96, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !35, file: !36, line: 25, baseType: !53, size: 64, align: 32, offset: 352)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 5, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 5, size: 64, align: 32, elements: !55, templateParams: !58)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !{!13, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexInPosNormalTex", file: !61, line: 51, size: 256, align: 32, elements: !62)
!61 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "PosL", scope: !60, file: !61, line: 53, baseType: !40, size: 96, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "NormalL", scope: !60, file: !61, line: 54, baseType: !40, size: 96, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !60, file: !61, line: 55, baseType: !53, size: 64, align: 32, offset: 192)
!66 = !{!67, !100, !103, !105, !106, !107, !109, !111, !113, !114, !115, !117, !119}
!67 = !DIGlobalVariable(name: "object", linkageName: "\01?object@cbPerObject@@3UObject@@B", scope: !0, file: !1, line: 5, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !61, line: 35, size: 1664, align: 32, elements: !70)
!70 = !{!71, !94, !95, !96, !97, !98, !99}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "World", scope: !69, file: !61, line: 37, baseType: !72, size: 512, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !74, templateParams: !91)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !73, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!91 = !{!13, !92, !93}
!92 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!93 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "InvWorld", scope: !69, file: !61, line: 38, baseType: !72, size: 512, align: 32, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "TexTransform", scope: !69, file: !61, line: 39, baseType: !72, size: 512, align: 32, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !69, file: !61, line: 41, baseType: !49, size: 32, align: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !69, file: !61, line: 42, baseType: !8, size: 32, align: 32, offset: 1568)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !69, file: !61, line: 43, baseType: !8, size: 32, align: 32, offset: 1600)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !69, file: !61, line: 44, baseType: !8, size: 32, align: 32, offset: 1632)
!100 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !101, line: 90, type: !102, isLocal: true, isDefinition: true)
!101 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!103 = !DIGlobalVariable(name: "PI", scope: !0, file: !101, line: 108, type: !104, isLocal: true, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!105 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !101, line: 109, type: !104, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !101, line: 110, type: !104, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !61, line: 48, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!109 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !61, line: 49, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!111 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !36, line: 15, type: !112, isLocal: true, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!113 = !DIGlobalVariable(name: "cos30", scope: !0, file: !36, line: 16, type: !104, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariable(name: "cos25", scope: !0, file: !36, line: 17, type: !104, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !101, line: 90, type: !116, isLocal: false, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !102, size: 32, align: 4, offset: 32)
!117 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !101, line: 90, type: !118, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !102, size: 32, align: 4, offset: 64)
!119 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !101, line: 90, type: !120, isLocal: false, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !102, size: 32, align: 4)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!124 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxel_VS.hlsl", !"#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A\0D\0Acbuffer cbPerObject : register(b2)\0D\0A{\0D\0A    Object object;\0D\0A};\0D\0A\0D\0AVertexOutVoxel VS( VertexInPosNormalTex vIn )\0D\0A{\0D\0A    VertexOutVoxel vOut;\0D\0A    \0D\0A    float4 posW = mul(float4(vIn.PosL, 1.0f), object.World);\0D\0A    \0D\0A    vOut.PosW = posW.xyz;\0D\0A    vOut.NormalW = mul(vIn.NormalL, (float3x3) object.World);\0D\0A    vOut.PosH = posW;\0D\0A    vOut.Tex = vIn.Tex;\0D\0A    vOut.ProjAxis = 0;\0D\0A    \0D\0A    return vOut;\0D\0A}"}
