#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; VOXELINDEX               0   x           1     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOR                    0   xyz         2     NONE   float   xyz 
; CLUSTERINDEX             0   x           3     NONE    uint   x   
;
; shader debug name: ee03cd419eb2d409528c40126fd47526.pdb
; shader hash: ee03cd419eb2d409528c40126fd47526
;
; Pipeline Runtime Information: 
;
; Geometry Shader
; InputPrimitive=point
; OutputTopology=triangle
; OutputStreamMask=1
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; VOXELINDEX               0        nointerpolation       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !41, globals: !89)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders\5CVoxelDisplay_GS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !17, !26, !34}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 14, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 14, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 14, baseType: !16)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 14, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 14, size: 128, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !18, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!24 = !{!12, !25}
!25 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 232, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 232, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 232, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 232, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 232, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!33, !13}
!33 = !DITemplateTypeParameter(name: "element", type: !14)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 129, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 129, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!12, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!41 = !{!42, !63, !74, !79, !83, !86}
!42 = !DISubprogram(name: "GS", scope: !1, file: !1, line: 149, type: !43, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @GS)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45, !52}
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 32, elements: !50)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSInput", file: !1, line: 4, size: 160, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !46, file: !1, line: 6, baseType: !17, size: 128, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelIndex", scope: !46, file: !1, line: 7, baseType: !15, size: 32, align: 32, offset: 128)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "TriangleStream<GeometryOutClusterIndex>", file: !1, line: 14, size: 352, align: 32, elements: !2, templateParams: !54)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "element", type: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "GeometryOutClusterIndex", file: !57, line: 34, size: 352, align: 32, elements: !58)
!57 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !56, file: !57, line: 36, baseType: !17, size: 128, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !56, file: !57, line: 37, baseType: !4, size: 96, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !56, file: !57, line: 38, baseType: !4, size: 96, align: 32, offset: 224)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterIndex", scope: !56, file: !57, line: 39, baseType: !15, size: 32, align: 32, offset: 320)
!63 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !57, file: !57, line: 88, type: !64, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !15, !66}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 231, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 231, size: 96, align: 32, elements: !68, templateParams: !72)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !1, line: 231, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !1, line: 231, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !67, file: !1, line: 231, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!72 = !{!73, !13}
!73 = !DITemplateTypeParameter(name: "element", type: !16)
!74 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !57, file: !57, line: 120, type: !75, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !15, !78}
!77 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 18, size: 32, align: 32, elements: !2)
!79 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !80, file: !80, line: 120, type: !81, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!81 = !DISubroutineType(types: !82)
!82 = !{!34, !15}
!83 = !DISubprogram(name: "IsTriangleOutFrustum", linkageName: "\01?IsTriangleOutFrustum@@YA_NV?$vector@M$03@@00@Z", scope: !1, file: !1, line: 120, type: !84, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!77, !17, !17, !17}
!86 = !DISubprogram(name: "IsTriangleBehindVoxel", linkageName: "\01?IsTriangleBehindVoxel@@YA_NV?$vector@M$02@@000@Z", scope: !1, file: !1, line: 129, type: !87, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!77, !4, !4, !4, !4}
!89 = !{!90, !128, !131, !133, !134, !135, !137, !139, !141, !142, !143, !167, !168, !179, !182, !183, !184, !185, !186, !206, !207, !208, !209, !220, !221, !230, !233, !234, !236, !238}
!90 = !DIGlobalVariable(name: "camera", linkageName: "\01?camera@cbCamera@@3UCamera@@B", scope: !0, file: !1, line: 14, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !80, line: 17, size: 3328, align: 32, elements: !93)
!93 = !{!94, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !92, file: !80, line: 19, baseType: !95, size: 512, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 14, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 14, size: 512, align: 32, elements: !97, templateParams: !114)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !96, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!114 = !{!12, !115, !116}
!115 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!116 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "InvView", scope: !92, file: !80, line: 20, baseType: !95, size: 512, align: 32, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Proj", scope: !92, file: !80, line: 21, baseType: !95, size: 512, align: 32, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "InvProj", scope: !92, file: !80, line: 22, baseType: !95, size: 512, align: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProj", scope: !92, file: !80, line: 23, baseType: !95, size: 512, align: 32, offset: 2048)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "InvViewProj", scope: !92, file: !80, line: 24, baseType: !95, size: 512, align: 32, offset: 2560)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EyePos", scope: !92, file: !80, line: 26, baseType: !4, size: 96, align: 32, offset: 3072)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "NearPlane", scope: !92, file: !80, line: 27, baseType: !8, size: 32, align: 32, offset: 3168)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "FarPlane", scope: !92, file: !80, line: 29, baseType: !8, size: 32, align: 32, offset: 3200)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !92, file: !80, line: 30, baseType: !8, size: 32, align: 32, offset: 3232)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !92, file: !80, line: 31, baseType: !8, size: 32, align: 32, offset: 3264)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !92, file: !80, line: 32, baseType: !8, size: 32, align: 32, offset: 3296)
!128 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !129, line: 90, type: !130, isLocal: true, isDefinition: true)
!129 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!131 = !DIGlobalVariable(name: "PI", scope: !0, file: !129, line: 108, type: !132, isLocal: true, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!133 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !129, line: 109, type: !132, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !129, line: 110, type: !132, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !80, line: 48, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!137 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !80, line: 49, type: !138, isLocal: false, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!139 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !57, line: 15, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!141 = !DIGlobalVariable(name: "cos30", scope: !0, file: !57, line: 16, type: !132, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariable(name: "cos25", scope: !0, file: !57, line: 17, type: !132, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 10, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "T", type: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !148, line: 26, size: 1792, align: 32, elements: !149)
!148 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!149 = !{!150, !151, !152, !155, !156, !157, !159, !160, !161, !162, !163, !164, !165, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !147, file: !148, line: 28, baseType: !66, size: 96, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !147, file: !148, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !147, file: !148, line: 31, baseType: !153, size: 96, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !154, line: 4, baseType: !4)
!154 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !147, file: !148, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !147, file: !148, line: 34, baseType: !153, size: 96, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !147, file: !148, line: 35, baseType: !158, size: 32, align: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !154, line: 8, baseType: !15)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !147, file: !148, line: 37, baseType: !153, size: 96, align: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !147, file: !148, line: 38, baseType: !158, size: 32, align: 32, offset: 480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !147, file: !148, line: 40, baseType: !153, size: 96, align: 32, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !147, file: !148, line: 41, baseType: !158, size: 32, align: 32, offset: 608)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !147, file: !148, line: 43, baseType: !153, size: 96, align: 32, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !147, file: !148, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !147, file: !148, line: 46, baseType: !95, size: 512, align: 32, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !147, file: !148, line: 47, baseType: !95, size: 512, align: 32, offset: 1280)
!167 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 18, type: !78, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "gFragmentDataBuffer", linkageName: "\01?gFragmentDataBuffer@@3V?$StructuredBuffer@UFragmentData@@@@A", scope: !0, file: !1, line: 19, type: !169, isLocal: false, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<FragmentData>", file: !1, line: 19, size: 384, align: 32, elements: !2, templateParams: !170)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "element", type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "FragmentData", file: !57, line: 75, size: 384, align: 32, elements: !173)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !172, file: !57, line: 77, baseType: !4, size: 96, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !172, file: !57, line: 78, baseType: !8, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !172, file: !57, line: 80, baseType: !17, size: 128, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !172, file: !57, line: 82, baseType: !4, size: 96, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "voxelLinearCoord", scope: !172, file: !57, line: 83, baseType: !15, size: 32, align: 32, offset: 352)
!179 = !DIGlobalVariable(name: "gNextIndexBuffer", linkageName: "\01?gNextIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 20, size: 32, align: 32, elements: !2, templateParams: !181)
!181 = !{!73}
!182 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 22, type: !180, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 23, type: !180, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariable(name: "gVoxelIndicesCompacted", linkageName: "\01?gVoxelIndicesCompacted@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !180, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariable(name: "gVoxelHashesCompacted", linkageName: "\01?gVoxelHashesCompacted@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 26, type: !180, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 28, type: !187, isLocal: false, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 28, size: 2688, align: 32, elements: !2, templateParams: !188)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "element", type: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !148, line: 199, size: 2688, align: 32, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !190, file: !148, line: 201, baseType: !66, size: 96, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !190, file: !148, line: 202, baseType: !158, size: 32, align: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !190, file: !148, line: 204, baseType: !153, size: 96, align: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !190, file: !148, line: 205, baseType: !158, size: 32, align: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !190, file: !148, line: 207, baseType: !153, size: 96, align: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !190, file: !148, line: 208, baseType: !158, size: 32, align: 32, offset: 352)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !190, file: !148, line: 210, baseType: !153, size: 96, align: 32, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !190, file: !148, line: 211, baseType: !158, size: 32, align: 32, offset: 480)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !190, file: !148, line: 213, baseType: !153, size: 96, align: 32, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !190, file: !148, line: 214, baseType: !8, size: 32, align: 32, offset: 608)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !190, file: !148, line: 216, baseType: !203, size: 2048, align: 32, offset: 640)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 2048, align: 32, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 64)
!206 = !DIGlobalVariable(name: "gNextVoxelBuffer", linkageName: "\01?gNextVoxelBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 29, type: !180, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariable(name: "gClusterAssignmentBuffer", linkageName: "\01?gClusterAssignmentBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !180, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariable(name: "gVoxelLitBuffer", linkageName: "\01?gVoxelLitBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 32, type: !78, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariable(name: "gClusterLitBuffer", linkageName: "\01?gClusterLitBuffer@@3V?$StructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 33, type: !210, isLocal: false, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 33, size: 128, align: 32, elements: !2, templateParams: !211)
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "element", type: !213)
!213 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 33, size: 128, align: 32, elements: !214, templateParams: !219)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !1, line: 33, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !1, line: 33, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !213, file: !1, line: 33, baseType: !16, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !213, file: !1, line: 33, baseType: !16, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!219 = !{!73, !25}
!220 = !DIGlobalVariable(name: "gVoxelVisibleBuffer", linkageName: "\01?gVoxelVisibleBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 35, type: !78, isLocal: false, isDefinition: true)
!221 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 37, type: !222, isLocal: false, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 37, size: 64, align: 32, elements: !2, templateParams: !223)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "element", type: !225)
!225 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 243, size: 64, align: 32, elements: !226, templateParams: !229)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !225, file: !1, line: 243, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !225, file: !1, line: 243, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!229 = !{!73, !40}
!230 = !DIGlobalVariable(name: "gFaceClusterPenaltyBuffer", linkageName: "\01?gFaceClusterPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 39, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 39, size: 32, align: 32, elements: !2, templateParams: !232)
!232 = !{!12}
!233 = !DIGlobalVariable(name: "gFaceCloseVoxelsPenaltyBuffer", linkageName: "\01?gFaceCloseVoxelsPenaltyBuffer@@3V?$StructuredBuffer@M@@A", scope: !0, file: !1, line: 40, type: !231, isLocal: false, isDefinition: true)
!234 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !129, line: 90, type: !235, isLocal: false, isDefinition: true)
!235 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !130, size: 32, align: 4, offset: 32)
!236 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !129, line: 90, type: !237, isLocal: false, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !130, size: 32, align: 4, offset: 64)
!238 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !129, line: 90, type: !239, isLocal: false, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !130, size: 32, align: 4)
!240 = !{i32 2, !"Dwarf Version", i32 4}
!241 = !{i32 2, !"Debug Info Version", i32 3}
!242 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
