#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyz 
; POSITION                 0   xyz         1     NONE   float   xyz 
; AXIS                     0   x           2     NONE    uint   x   
; NORMAL                   0   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 31b69fbd040461260c005e02da5f9f26.pdb
; shader hash: 31b69fbd040461260c005e02da5f9f26
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; AXIS                     0        nointerpolation       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !66, globals: !94)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders\5CVoxel_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !26, !33, !48, !59}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 24, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 24, size: 96, align: 32, elements: !18, templateParams: !23)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 24, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 24, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 24, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !20)
!25 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 24, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 24, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!13, !25}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 50, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 50, size: 288, align: 32, elements: !35, templateParams: !45)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !34, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!45 = !{!13, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x3", file: !1, line: 123, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 3>", file: !1, line: 123, size: 192, align: 32, elements: !50, templateParams: !57)
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !{!13, !58, !47}
!58 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 2)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 29, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 29, size: 64, align: 32, elements: !61, templateParams: !64)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !60, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !60, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!64 = !{!13, !65}
!65 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!66 = !{!67, !79, !83, !86, !89}
!67 = !DISubprogram(name: "PS", scope: !1, file: !1, line: 43, type: !68, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PS)
!68 = !DISubroutineType(types: !69)
!69 = !{!4, !70}
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOutVoxel", file: !71, line: 19, size: 416, align: 32, elements: !72)
!71 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!72 = !{!73, !74, !75, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "PosH", scope: !70, file: !71, line: 21, baseType: !4, size: 128, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "PosW", scope: !70, file: !71, line: 22, baseType: !26, size: 96, align: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ProjAxis", scope: !70, file: !71, line: 23, baseType: !76, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !20)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "NormalW", scope: !70, file: !71, line: 24, baseType: !26, size: 96, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !70, file: !71, line: 25, baseType: !59, size: 64, align: 32, offset: 352)
!79 = !DISubprogram(name: "ComputeTwoChannelNormal", linkageName: "\01?ComputeTwoChannelNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !80, file: !80, line: 131, type: !81, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!81 = !DISubroutineType(types: !82)
!82 = !{!26, !59}
!83 = !DISubprogram(name: "CalculateTBN", linkageName: "\01?CalculateTBN@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@0V?$vector@M$01@@@Z", scope: !80, file: !80, line: 115, type: !84, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!33, !26, !26, !59}
!86 = !DISubprogram(name: "SetVoxelOccupied", linkageName: "\01?SetVoxelOccupied@@YAXI@Z", scope: !1, file: !1, line: 32, type: !87, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !76}
!89 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !71, file: !71, line: 148, type: !90, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !76, !93}
!92 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 11, size: 32, align: 32, elements: !2)
!94 = !{!95, !107, !109, !111, !113, !115, !116, !117, !120, !122, !123, !124, !125, !129, !130, !131, !132, !133, !134, !145, !148, !149, !150, !151, !152, !154, !156}
!95 = !DIGlobalVariable(name: "voxelCommons", linkageName: "\01?voxelCommons@cbVoxelCommons@@3UVoxelCommons@@B", scope: !0, file: !1, line: 24, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelCommons", file: !71, line: 42, size: 512, align: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gridDimension", scope: !97, file: !71, line: 44, baseType: !16, size: 96, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !97, file: !71, line: 45, baseType: !8, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cellSize", scope: !97, file: !71, line: 47, baseType: !26, size: 96, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !97, file: !71, line: 48, baseType: !8, size: 32, align: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "inverseGridDimension", scope: !97, file: !71, line: 50, baseType: !26, size: 96, align: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "storeData", scope: !97, file: !71, line: 51, baseType: !76, size: 32, align: 32, offset: 352)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "inverseCellSize", scope: !97, file: !71, line: 53, baseType: !26, size: 96, align: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !97, file: !71, line: 54, baseType: !8, size: 32, align: 32, offset: 480)
!107 = !DIGlobalVariable(name: "StoreData", linkageName: "\01?StoreData@RootConstant@@3IB", scope: !0, file: !1, line: 29, type: !108, isLocal: false, isDefinition: true)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!109 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !71, line: 15, type: !110, isLocal: true, isDefinition: true, variable: i32 -1)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!111 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !80, line: 90, type: !112, isLocal: true, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!113 = !DIGlobalVariable(name: "PI", scope: !0, file: !80, line: 108, type: !114, isLocal: true, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!115 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !80, line: 109, type: !114, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !80, line: 110, type: !114, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !118, line: 48, type: !119, isLocal: false, isDefinition: true)
!118 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CClusteredVoxelGI\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!120 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !118, line: 49, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!122 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !71, line: 15, type: !110, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariable(name: "cos30", scope: !0, file: !71, line: 16, type: !114, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariable(name: "cos25", scope: !0, file: !71, line: 17, type: !114, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariable(name: "gEmissiveTex", linkageName: "\01?gEmissiveTex@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 4, size: 160, align: 32, elements: !2, templateParams: !127)
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "element", type: !5)
!129 = !DIGlobalVariable(name: "gNormalMap", linkageName: "\01?gNormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !126, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "gDiffuseTex", linkageName: "\01?gDiffuseTex@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !126, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "gMetallicRoughness", linkageName: "\01?gMetallicRoughness@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !126, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "gOcclusion", linkageName: "\01?gOcclusion@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 8, type: !126, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 11, type: !93, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "gFragmentDataBuffer", linkageName: "\01?gFragmentDataBuffer@@3V?$RWStructuredBuffer@UFragmentData@@@@A", scope: !0, file: !1, line: 12, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<FragmentData>", file: !1, line: 12, size: 384, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "element", type: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "FragmentData", file: !71, line: 75, size: 384, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !138, file: !71, line: 77, baseType: !26, size: 96, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !138, file: !71, line: 78, baseType: !8, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !138, file: !71, line: 80, baseType: !4, size: 128, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !138, file: !71, line: 82, baseType: !26, size: 96, align: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "voxelLinearCoord", scope: !138, file: !71, line: 83, baseType: !76, size: 32, align: 32, offset: 352)
!145 = !DIGlobalVariable(name: "gNextIndexBuffer", linkageName: "\01?gNextIndexBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !147)
!147 = !{!24}
!148 = !DIGlobalVariable(name: "gVoxelIndicesBuffer", linkageName: "\01?gVoxelIndicesBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 14, type: !146, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "gFragmentCounter", linkageName: "\01?gFragmentCounter@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 15, type: !146, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "gOccupiedVoxelCounter", linkageName: "\01?gOccupiedVoxelCounter@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 16, type: !146, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariable(name: "gVoxelHashBuffer", linkageName: "\01?gVoxelHashBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !146, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !80, line: 90, type: !153, isLocal: false, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !112, size: 32, align: 4)
!154 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !80, line: 90, type: !155, isLocal: false, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !112, size: 32, align: 4, offset: 32)
!156 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !80, line: 90, type: !157, isLocal: false, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !112, size: 32, align: 4, offset: 64)
!158 = !{i32 2, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
