#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 137a9f821033026583304a6b8e6d7825.pdb
; shader hash: 137a9f821033026583304a6b8e6d7825
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbComputeNeighbour
; {
;
;   struct cbComputeNeighbour
;   {
;
;       struct struct.ConstantBufferComputeNeighbour
;       {
;
;           uint ClusterCount;                        ; Offset:    0
;           uint ElementsPerThread;                   ; Offset:    4
;           uint TotalComputationCount;               ; Offset:    8
;           float pad1;                               ; Offset:   12
;       
;       } cbComputeNeighbour;                         ; Offset:    0
;
;   
;   } cbComputeNeighbour;                             ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gClusterDataBuffer
; {
;
;   struct struct.ClusterData
;   {
;
;       uint3 Center;                                 ; Offset:    0
;       uint VoxelCount;                              ; Offset:   12
;       float3 Normal;                                ; Offset:   16
;       uint FirstDataIndex;                          ; Offset:   28

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !25)
!1 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders\5CComputeNeighbour_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 23, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !20}
!7 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 20, type: !8, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !12, templateParams: !16)
!12 = !{!13, !14, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !5)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 3)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DISubprogram(name: "intervalIntersection", linkageName: "\01?intervalIntersection@@YA_NMMMM@Z", scope: !1, file: !1, line: 8, type: !21, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: false)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24, !24, !24, !24}
!23 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !{!26, !37, !39, !40, !41, !44, !46, !49, !50, !51, !97, !107, !127, !129, !131}
!26 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !27, line: 87, type: !28, isLocal: true, isDefinition: true)
!27 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 34, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 34, size: 96, align: 32, elements: !31, templateParams: !35)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 34, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 34, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 34, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !18}
!36 = !DITemplateTypeParameter(name: "element", type: !24)
!37 = !DIGlobalVariable(name: "PI", scope: !0, file: !27, line: 105, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!39 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !27, line: 106, type: !38, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !27, line: 107, type: !38, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !42, line: 45, type: !43, isLocal: false, isDefinition: true)
!42 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 45, size: 32, align: 32, elements: !2)
!44 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !42, line: 46, type: !45, isLocal: false, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 46, size: 32, align: 32, elements: !2)
!46 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !47, line: 15, type: !48, isLocal: true, isDefinition: true)
!47 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/VoxelUtils.hlsli", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!49 = !DIGlobalVariable(name: "cos30", scope: !0, file: !47, line: 16, type: !38, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariable(name: "cos25", scope: !0, file: !47, line: 17, type: !38, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !53)
!53 = !{!54}
!54 = !DITemplateTypeParameter(name: "T", type: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !56, line: 26, size: 1792, align: 32, elements: !57)
!56 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/TechniquesCompat.h", directory: "")
!57 = !{!58, !59, !60, !63, !64, !65, !67, !68, !69, !70, !71, !72, !73, !96}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !55, file: !56, line: 28, baseType: !10, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !55, file: !56, line: 29, baseType: !24, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !55, file: !56, line: 31, baseType: !61, size: 96, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !62, line: 4, baseType: !29)
!62 = !DIFile(filename: "..\5C..\5CClusteredVoxelGI\5CShaders/HlslCompat.h", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !55, file: !56, line: 32, baseType: !24, size: 32, align: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !55, file: !56, line: 34, baseType: !61, size: 96, align: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !55, file: !56, line: 35, baseType: !66, size: 32, align: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !62, line: 8, baseType: !4)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !55, file: !56, line: 37, baseType: !61, size: 96, align: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !55, file: !56, line: 38, baseType: !66, size: 32, align: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !55, file: !56, line: 40, baseType: !61, size: 96, align: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !55, file: !56, line: 41, baseType: !66, size: 32, align: 32, offset: 608)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !55, file: !56, line: 43, baseType: !61, size: 96, align: 32, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !55, file: !56, line: 44, baseType: !24, size: 32, align: 32, offset: 736)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !55, file: !56, line: 46, baseType: !74, size: 512, align: 32, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !76, templateParams: !93)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !75, file: !1, line: 3, baseType: !24, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!93 = !{!36, !94, !95}
!94 = !DITemplateValueParameter(name: "row_count", type: !19, value: i32 4)
!95 = !DITemplateValueParameter(name: "col_count", type: !19, value: i32 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !55, file: !56, line: 47, baseType: !74, size: 512, align: 32, offset: 1280)
!97 = !DIGlobalVariable(name: "cbComputeNeighbour", linkageName: "\01?cbComputeNeighbour@@3U?$ConstantBuffer@UConstantBufferComputeNeighbour@@@@A", scope: !0, file: !1, line: 4, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferComputeNeighbour>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !99)
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "T", type: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferComputeNeighbour", file: !56, line: 213, size: 128, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !101, file: !56, line: 215, baseType: !66, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ElementsPerThread", scope: !101, file: !56, line: 216, baseType: !66, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "TotalComputationCount", scope: !101, file: !56, line: 217, baseType: !66, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !101, file: !56, line: 218, baseType: !24, size: 32, align: 32, offset: 96)
!107 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$RWStructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 6, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ClusterData>", file: !1, line: 6, size: 2688, align: 32, elements: !2, templateParams: !109)
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "element", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !56, line: 193, size: 2688, align: 32, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !111, file: !56, line: 195, baseType: !10, size: 96, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !111, file: !56, line: 196, baseType: !66, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !111, file: !56, line: 198, baseType: !61, size: 96, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !111, file: !56, line: 199, baseType: !66, size: 32, align: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !111, file: !56, line: 201, baseType: !61, size: 96, align: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !111, file: !56, line: 202, baseType: !66, size: 32, align: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !111, file: !56, line: 204, baseType: !61, size: 96, align: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !111, file: !56, line: 205, baseType: !66, size: 32, align: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !111, file: !56, line: 207, baseType: !61, size: 96, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !111, file: !56, line: 208, baseType: !24, size: 32, align: 32, offset: 608)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !111, file: !56, line: 210, baseType: !124, size: 2048, align: 32, offset: 640)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 32, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !27, line: 87, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !28, size: 32, align: 4, offset: 64)
!129 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !27, line: 87, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !28, size: 32, align: 4, offset: 32)
!131 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !27, line: 87, type: !132, isLocal: false, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !28, size: 32, align: 4)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!136 = !{!"..\5C..\5CClusteredVoxelGI\5CShaders\5CComputeNeighbour_CS.hlsl", !"#include \22VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferComputeNeighbour> cbComputeNeighbour : register(b1);\0D\0A\0D\0ARWStructuredBuffer<ClusterData> gClusterDataBuffer : register(u0, space0);\0D\0A\0D\0Abool intervalIntersection(float minX0, float maxX0, float minX1, float maxX1)\0D\0A{\0D\0A    if ((((minX0 >= minX1) && (minX0 <= maxX1)) || ((maxX0 >= minX1) && (maxX0 <= maxX1))) ||\0D\0A\09\09(((minX1 >= minX0) && (minX1 <= maxX0)) || ((maxX1 >= minX0) && (maxX1 <= maxX0))))\0D\0A    {\0D\0A        return true;\0D\0A    }\0D\0A\0D\0A    return false;\0D\0A}\0D\0A\0D\0A[numthreads(256, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    \0D\0A    uint threadStart = DTid.x * cbComputeNeighbour.ElementsPerThread;\0D\0A    uint threadEnd = min(threadStart + cbComputeNeighbour.ElementsPerThread, cbComputeNeighbour.TotalComputationCount);\0D\0A    \0D\0A    for (uint i = threadStart; i < threadEnd; i++)\0D\0A    {\0D\0A        uint iIndex = (uint) floor( (-1.0f + sqrt(1.0f + 8.0f * i)) / 2.0f);\0D\0A        uint jIndex = i - iIndex * (iIndex + 1) / 2;\0D\0A        \0D\0A        if (iIndex == jIndex)\0D\0A            continue;\0D\0A\0D\0A        ClusterData clusterDataI = gClusterDataBuffer[iIndex];\0D\0A        ClusterData clusterDataJ = gClusterDataBuffer[jIndex];\0D\0A        \0D\0A\0D\0A        bool result0 = intervalIntersection(clusterDataI.MinAABB.x - 1, clusterDataI.MaxAABB.x + 1, clusterDataJ.MinAABB.x, clusterDataJ.MaxAABB.x);\0D\0A        bool result1 = intervalIntersection(clusterDataI.MinAABB.y - 1, clusterDataI.MaxAABB.y + 1, clusterDataJ.MinAABB.y, clusterDataJ.MaxAABB.y);\0D\0A        bool result2 = intervalIntersection(clusterDataI.MinAABB.z - 1, clusterDataI.MaxAABB.z + 1, clusterDataJ.MinAABB.z, clusterDataJ.MaxAABB.z);\0D\0A\0D\0A        \0D\0A        if (result0 && result1 && result2)\0D\0A        {\0D\0A            uint numberNeighboursI = 0;\0D\0A            uint numberNeighboursJ = 0;\0D\0A            \0D\0A            InterlockedAdd(gClusterDataBuffer[iIndex].NeighbourCount, 1, numberNeighboursI);\0D\0A            InterlockedAdd(gClusterDataBuffer[jIndex].NeighbourCount, 1, numberNeighboursJ);\0D\0A            \0D\0A            if (numberNeighboursI < 64)\0D\0A            {\0D\0A                gClusterDataBuffer[iIndex].ClusterNeighbours[numberNeighboursI] = jIndex;\0D\0A            }\0D\0A            if (numberNeighboursJ < 64)\0D\0A            {\0D\0A                gClusterDataBuffer[jIndex].ClusterNeighbours[numberNeighboursJ] = iIndex;\0D\0A            }\0D\0A        }\0D\0A    }\0D\0A\0D\0A}"}
