#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c1886a586c33dd37b188ba5683bde470.pdb
; shader hash: c1886a586c33dd37b188ba5683bde470
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !94)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CGaussianFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !14, !23, !24, !33, !40, !28}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 174, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 174, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 174, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 174, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 174, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !{!22, !13}
!22 = !DITemplateTypeParameter(name: "element", type: !18)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 161, baseType: !18)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 196, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 196, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 196, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 196, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 196, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 226, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 226, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 226, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 226, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!22, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 232, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 232, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 232, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 232, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!32, !39}
!46 = !{!47, !50, !54, !57, !61, !67, !70, !73, !77, !80, !83, !87, !88, !91}
!47 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 159, type: !48, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !14}
!50 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !51, file: !51, line: 97, type: !52, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!23, !14, !14}
!54 = !DISubprogram(name: "gaussianDistribution", linkageName: "\01?gaussianDistribution@@YAMMMMM@Z", scope: !1, file: !1, line: 71, type: !55, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!28, !28, !28, !28, !28}
!57 = !DISubprogram(name: "UnpackUintToFloat3", linkageName: "\01?UnpackUintToFloat3@@YA?AV?$vector@M$02@@I@Z", scope: !58, file: !58, line: 150, type: !59, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!59 = !DISubroutineType(types: !60)
!60 = !{!24, !23}
!61 = !DISubprogram(name: "filterFace", linkageName: "\01?filterFace@@YA?AV?$vector@M$02@@II_NAIA_N@Z", scope: !1, file: !1, line: 81, type: !62, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!24, !23, !23, !64, !65}
!64 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !64)
!67 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !51, file: !51, line: 88, type: !68, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!14, !23, !14}
!70 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !51, file: !51, line: 105, type: !71, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!64, !14, !4, !14}
!73 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !51, file: !51, line: 142, type: !74, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!64, !14, !14, !76}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 6, size: 32, align: 32, elements: !2)
!77 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !51, file: !51, line: 120, type: !78, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!64, !23, !76}
!80 = !DISubprogram(name: "FindHashedCompactedPositionIndex", linkageName: "\01?FindHashedCompactedPositionIndex@@YA?AV?$vector@I$01@@V?$vector@I$02@@0@Z", scope: !1, file: !1, line: 31, type: !81, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!33, !14, !14}
!83 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 131, type: !84, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!64, !23, !86}
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 22, size: 32, align: 32, elements: !2)
!87 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !51, file: !51, line: 148, type: !84, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "PackFloat3ToUint", linkageName: "\01?PackFloat3ToUint@@YAIV?$vector@M$02@@@Z", scope: !58, file: !58, line: 138, type: !89, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!23, !24}
!91 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !58, file: !58, line: 128, type: !92, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!23, !40}
!94 = !{!95, !98, !100, !101, !102, !104, !106, !108, !109, !110, !156, !168, !169, !172, !173, !174, !175, !176, !178, !181, !185, !186, !187, !188, !189, !191, !193}
!95 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !96, line: 90, type: !97, isLocal: true, isDefinition: true)
!96 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!98 = !DIGlobalVariable(name: "PI", scope: !0, file: !96, line: 108, type: !99, isLocal: true, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!100 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !96, line: 109, type: !99, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !96, line: 110, type: !99, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !58, line: 48, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!104 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !58, line: 49, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!106 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !51, line: 15, type: !107, isLocal: true, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!108 = !DIGlobalVariable(name: "cos30", scope: !0, file: !51, line: 16, type: !99, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariable(name: "cos25", scope: !0, file: !51, line: 17, type: !99, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !111, isLocal: false, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !112)
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "T", type: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !115, line: 26, size: 1792, align: 32, elements: !116)
!115 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!116 = !{!117, !118, !119, !122, !123, !124, !126, !127, !128, !129, !130, !131, !132, !155}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !114, file: !115, line: 28, baseType: !14, size: 96, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !114, file: !115, line: 29, baseType: !28, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !114, file: !115, line: 31, baseType: !120, size: 96, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !121, line: 4, baseType: !24)
!121 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !114, file: !115, line: 32, baseType: !28, size: 32, align: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !114, file: !115, line: 34, baseType: !120, size: 96, align: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !114, file: !115, line: 35, baseType: !125, size: 32, align: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !121, line: 8, baseType: !23)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !114, file: !115, line: 37, baseType: !120, size: 96, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !114, file: !115, line: 38, baseType: !125, size: 32, align: 32, offset: 480)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !114, file: !115, line: 40, baseType: !120, size: 96, align: 32, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !114, file: !115, line: 41, baseType: !125, size: 32, align: 32, offset: 608)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !114, file: !115, line: 43, baseType: !120, size: 96, align: 32, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !114, file: !115, line: 44, baseType: !28, size: 32, align: 32, offset: 736)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !114, file: !115, line: 46, baseType: !133, size: 512, align: 32, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !135, templateParams: !152)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !134, file: !1, line: 3, baseType: !28, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!152 = !{!32, !153, !154}
!153 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!154 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !114, file: !115, line: 47, baseType: !133, size: 512, align: 32, offset: 1280)
!156 = !DIGlobalVariable(name: "cbGaussianFilter", linkageName: "\01?cbGaussianFilter@@3U?$ConstantBuffer@UConstantBufferGaussianFilter@@@@A", scope: !0, file: !1, line: 4, type: !157, isLocal: false, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferGaussianFilter>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !158)
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "T", type: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferGaussianFilter", file: !115, line: 227, size: 256, align: 32, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !160, file: !115, line: 229, baseType: !120, size: 96, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !160, file: !115, line: 230, baseType: !125, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !160, file: !115, line: 232, baseType: !125, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "KernelSize", scope: !160, file: !115, line: 233, baseType: !125, size: 32, align: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !160, file: !115, line: 234, baseType: !125, size: 32, align: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !160, file: !115, line: 235, baseType: !125, size: 32, align: 32, offset: 224)
!168 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 6, type: !76, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !171)
!171 = !{!22}
!172 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !170, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !170, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 11, type: !170, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "gFaceRadianceReadBuffer", linkageName: "\01?gFaceRadianceReadBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 14, type: !170, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "gGaussianFirstFilterBuffer", linkageName: "\01?gGaussianFirstFilterBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !171)
!178 = !DIGlobalVariable(name: "gGaussianPrecomputedDataBuffer", linkageName: "\01?gGaussianPrecomputedDataBuffer@@3V?$RWStructuredBuffer@M@@A", scope: !0, file: !1, line: 18, type: !179, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<float>", file: !1, line: 18, size: 32, align: 32, elements: !2, templateParams: !180)
!180 = !{!32}
!181 = !DIGlobalVariable(name: "gWriteFinalRadianceBuffer", linkageName: "\01?gWriteFinalRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 20, type: !182, isLocal: false, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !183)
!183 = !{!184}
!184 = !DITemplateTypeParameter(name: "element", type: !34)
!185 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 22, type: !86, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariable(name: "gGaussianFaceIndices", linkageName: "\01?gGaussianFaceIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 23, type: !177, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 24, type: !86, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 25, type: !86, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !96, line: 90, type: !190, isLocal: false, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !97, size: 32, align: 4, offset: 64)
!191 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !96, line: 90, type: !192, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !97, size: 32, align: 4)
!193 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !96, line: 90, type: !194, isLocal: false, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !97, size: 32, align: 4, offset: 32)
!195 = !{i32 2, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
