#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 38b04889bb5e94b024d37bd24f14e0db.pdb
; shader hash: 38b04889bb5e94b024d37bd24f14e0db
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !40, globals: !97)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CLightTransportIndirect_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !17, !10, !26, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 171, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 36, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 36, size: 96, align: 32, elements: !8, templateParams: !13)
!8 = !{!9, !11, !12}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 36, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 36, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 36, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !10)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 3)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 189, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 189, size: 128, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 189, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 189, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 189, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !18, file: !1, line: 189, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!24 = !{!14, !25}
!25 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 296, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 296, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 296, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 296, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!14, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 196, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 196, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 196, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 196, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!39, !32}
!39 = !DITemplateTypeParameter(name: "element", type: !5)
!40 = !{!41, !51, !55, !58, !81, !86, !89, !90, !93}
!41 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 169, type: !42, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !44}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 36, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 36, size: 96, align: 32, elements: !46, templateParams: !50)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !45, file: !1, line: 36, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !45, file: !1, line: 36, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !45, file: !1, line: 36, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!50 = !{!39, !15}
!51 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !52, file: !52, line: 88, type: !53, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!44, !4, !44}
!55 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !52, file: !52, line: 183, type: !56, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!10, !6, !6, !6, !6, !10}
!58 = !DISubprogram(name: "clusterToVoxelIrradiancePerVoxelArrayVoxel", linkageName: "\01?clusterToVoxelIrradiancePerVoxelArrayVoxel@@YA?AV?$vector@M$02@@UClusterData@@IV1@1@Z", scope: !1, file: !1, line: 38, type: !59, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!6, !61, !4, !6, !6}
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !62, line: 193, size: 2688, align: 32, elements: !63)
!62 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!63 = !{!64, !65, !68, !70, !71, !72, !73, !74, !75, !76, !77}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !61, file: !62, line: 195, baseType: !44, size: 96, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !61, file: !62, line: 196, baseType: !66, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !67, line: 8, baseType: !4)
!67 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !61, file: !62, line: 198, baseType: !69, size: 96, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !67, line: 4, baseType: !6)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !61, file: !62, line: 199, baseType: !66, size: 32, align: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !61, file: !62, line: 201, baseType: !69, size: 96, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !61, file: !62, line: 202, baseType: !66, size: 32, align: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !61, file: !62, line: 204, baseType: !69, size: 96, align: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !61, file: !62, line: 205, baseType: !66, size: 32, align: 32, offset: 480)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !61, file: !62, line: 207, baseType: !69, size: 96, align: 32, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !61, file: !62, line: 208, baseType: !10, size: 32, align: 32, offset: 608)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !61, file: !62, line: 210, baseType: !78, size: 2048, align: 32, offset: 640)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !52, file: !52, line: 120, type: !82, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !4, !85}
!84 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 26, size: 32, align: 32, elements: !2)
!86 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !52, file: !52, line: 210, type: !87, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!10, !6, !6}
!89 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !52, file: !52, line: 198, type: !87, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubprogram(name: "gatherIrradianceFromNeighbour", linkageName: "\01?gatherIrradianceFromNeighbour@@YA?AV?$vector@M$02@@IV1@@Z", scope: !1, file: !1, line: 135, type: !91, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!6, !4, !6}
!93 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !94, file: !94, line: 128, type: !95, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!95 = !DISubroutineType(types: !96)
!96 = !{!4, !26}
!97 = !{!98, !101, !103, !104, !105, !107, !109, !111, !112, !113, !155, !167, !170, !171, !172, !173, !177, !178, !179, !183, !184, !192, !202, !203, !207, !208, !209, !220, !221, !222, !223, !225, !227, !229, !231}
!98 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !99, line: 90, type: !100, isLocal: true, isDefinition: true)
!99 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!101 = !DIGlobalVariable(name: "PI", scope: !0, file: !99, line: 108, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !99, line: 109, type: !102, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !99, line: 110, type: !102, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !94, line: 48, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!107 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !94, line: 49, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!109 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !52, line: 15, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!111 = !DIGlobalVariable(name: "cos30", scope: !0, file: !52, line: 16, type: !102, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariable(name: "cos25", scope: !0, file: !52, line: 17, type: !102, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !62, line: 26, size: 1792, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !154}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !117, file: !62, line: 28, baseType: !44, size: 96, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !117, file: !62, line: 29, baseType: !10, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !117, file: !62, line: 31, baseType: !69, size: 96, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !117, file: !62, line: 32, baseType: !10, size: 32, align: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !117, file: !62, line: 34, baseType: !69, size: 96, align: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !117, file: !62, line: 35, baseType: !66, size: 32, align: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !117, file: !62, line: 37, baseType: !69, size: 96, align: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !117, file: !62, line: 38, baseType: !66, size: 32, align: 32, offset: 480)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !117, file: !62, line: 40, baseType: !69, size: 96, align: 32, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !117, file: !62, line: 41, baseType: !66, size: 32, align: 32, offset: 608)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !117, file: !62, line: 43, baseType: !69, size: 96, align: 32, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !117, file: !62, line: 44, baseType: !10, size: 32, align: 32, offset: 736)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !117, file: !62, line: 46, baseType: !132, size: 512, align: 32, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !134, templateParams: !151)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !133, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!151 = !{!14, !152, !153}
!152 = !DITemplateValueParameter(name: "row_count", type: !16, value: i32 4)
!153 = !DITemplateValueParameter(name: "col_count", type: !16, value: i32 4)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !117, file: !62, line: 47, baseType: !132, size: 512, align: 32, offset: 1280)
!155 = !DIGlobalVariable(name: "cbIndirectLight", linkageName: "\01?cbIndirectLight@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !156, isLocal: false, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "T", type: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !62, line: 152, size: 384, align: 32, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !159, file: !62, line: 154, baseType: !69, size: 96, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !159, file: !62, line: 155, baseType: !66, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "LightPosition", scope: !159, file: !62, line: 157, baseType: !69, size: 96, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "LightIntensity", scope: !159, file: !62, line: 158, baseType: !10, size: 32, align: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !159, file: !62, line: 160, baseType: !69, size: 96, align: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchNumber", scope: !159, file: !62, line: 161, baseType: !66, size: 32, align: 32, offset: 352)
!167 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 6, type: !168, isLocal: false, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !169)
!169 = !{!39}
!170 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !168, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !168, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !168, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 11, type: !174, isLocal: false, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 11, size: 2688, align: 32, elements: !2, templateParams: !175)
!175 = !{!176}
!176 = !DITemplateTypeParameter(name: "element", type: !61)
!177 = !DIGlobalVariable(name: "gVoxelsInCluster", linkageName: "\01?gVoxelsInCluster@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !168, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !168, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 14, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 14, size: 96, align: 32, elements: !2, templateParams: !181)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "element", type: !7)
!183 = !DIGlobalVariable(name: "gVoxelNormalBuffer", linkageName: "\01?gVoxelNormalBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 15, type: !180, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 17, type: !185, isLocal: false, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 17, size: 192, align: 32, elements: !2, templateParams: !186)
!186 = !{!187}
!187 = !DITemplateTypeParameter(name: "element", type: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !62, line: 12, size: 192, align: 32, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !188, file: !62, line: 14, baseType: !6, size: 96, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !188, file: !62, line: 15, baseType: !6, size: 96, align: 32, offset: 96)
!192 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 18, type: !193, isLocal: false, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 18, size: 256, align: 32, elements: !2, templateParams: !194)
!194 = !{!195}
!195 = !DITemplateTypeParameter(name: "element", type: !196)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !62, line: 177, size: 256, align: 32, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !196, file: !62, line: 179, baseType: !69, size: 96, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !196, file: !62, line: 180, baseType: !66, size: 32, align: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !196, file: !62, line: 181, baseType: !69, size: 96, align: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !196, file: !62, line: 182, baseType: !66, size: 32, align: 32, offset: 224)
!202 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !168, isLocal: false, isDefinition: true)
!203 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 22, type: !204, isLocal: false, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 22, size: 64, align: 32, elements: !2, templateParams: !205)
!205 = !{!206}
!206 = !DITemplateTypeParameter(name: "element", type: !34)
!207 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !168, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariable(name: "gLitVoxels", linkageName: "\01?gLitVoxels@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !85, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariable(name: "gLitClusters", linkageName: "\01?gLitClusters@@3V?$StructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 27, type: !210, isLocal: false, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !211)
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "element", type: !213)
!213 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 219, size: 128, align: 32, elements: !214, templateParams: !219)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !1, line: 219, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !1, line: 219, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !213, file: !1, line: 219, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !213, file: !1, line: 219, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!219 = !{!39, !25}
!220 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 29, type: !85, isLocal: false, isDefinition: true)
!221 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !168, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariable(name: "gGaussianVoxelBitmap", linkageName: "\01?gGaussianVoxelBitmap@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 31, type: !85, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 34, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 34, size: 64, align: 32, elements: !2, templateParams: !205)
!225 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !99, line: 90, type: !226, isLocal: false, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !100, size: 32, align: 4, offset: 64)
!227 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !99, line: 90, type: !228, isLocal: false, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !100, size: 32, align: 4, offset: 32)
!229 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !99, line: 90, type: !230, isLocal: false, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !100, size: 32, align: 4)
!231 = !DIGlobalVariable(name: "gsRadiancePerWave", linkageName: "\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim", scope: !0, file: !1, line: 36, type: !232, isLocal: false, isDefinition: true, variable: [6 x float] addrspace(3)* @"\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim")
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, align: 32, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 2)
!235 = !{i32 2, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
