#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: fb34e1ea91c6439746ff7ceb2eb1f4b1.pdb
; shader hash: fb34e1ea91c6439746ff7ceb2eb1f4b1
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !34, globals: !48)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CLightTransportDepth_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 72, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 72, size: 96, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 72, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 72, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 72, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !13}
!23 = !DITemplateTypeParameter(name: "element", type: !19)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 77, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 77, size: 128, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 77, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 77, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 77, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !1, line: 77, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 30, baseType: !8)
!34 = !{!35, !38, !42, !47}
!35 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 28, type: !36, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !39, file: !39, line: 88, type: !40, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!4, !33, !4}
!42 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !39, file: !39, line: 131, type: !43, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !33, !46}
!45 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 16, size: 32, align: 32, elements: !2)
!47 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !39, file: !39, line: 148, type: !43, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!48 = !{!49, !51, !54, !56, !57, !58, !61, !63, !64, !65, !66, !112, !129, !147, !150, !151, !152, !153, !157, !158, !160, !161, !162, !163, !167, !168, !169, !171, !173}
!49 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !39, line: 15, type: !50, isLocal: true, isDefinition: true, variable: i32 -1)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!51 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !52, line: 90, type: !53, isLocal: true, isDefinition: true)
!52 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!54 = !DIGlobalVariable(name: "PI", scope: !0, file: !52, line: 108, type: !55, isLocal: true, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!56 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !52, line: 109, type: !55, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !52, line: 110, type: !55, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !59, line: 48, type: !60, isLocal: false, isDefinition: true)
!59 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !59, line: 49, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!63 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !39, line: 15, type: !50, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariable(name: "cos30", scope: !0, file: !39, line: 16, type: !55, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariable(name: "cos25", scope: !0, file: !39, line: 17, type: !55, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "T", type: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !71, line: 26, size: 1792, align: 32, elements: !72)
!71 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!72 = !{!73, !74, !75, !78, !79, !80, !82, !83, !84, !85, !86, !87, !88, !111}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !70, file: !71, line: 28, baseType: !4, size: 96, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !70, file: !71, line: 29, baseType: !19, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !70, file: !71, line: 31, baseType: !76, size: 96, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !77, line: 4, baseType: !15)
!77 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !70, file: !71, line: 32, baseType: !19, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !70, file: !71, line: 34, baseType: !76, size: 96, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !70, file: !71, line: 35, baseType: !81, size: 32, align: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !77, line: 8, baseType: !33)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !70, file: !71, line: 37, baseType: !76, size: 96, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !70, file: !71, line: 38, baseType: !81, size: 32, align: 32, offset: 480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !70, file: !71, line: 40, baseType: !76, size: 96, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !70, file: !71, line: 41, baseType: !81, size: 32, align: 32, offset: 608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !70, file: !71, line: 43, baseType: !76, size: 96, align: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !70, file: !71, line: 44, baseType: !19, size: 32, align: 32, offset: 736)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !70, file: !71, line: 46, baseType: !89, size: 512, align: 32, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !91, templateParams: !108)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !90, file: !1, line: 3, baseType: !19, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!108 = !{!23, !109, !110}
!109 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!110 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !70, file: !71, line: 47, baseType: !89, size: 512, align: 32, offset: 1280)
!112 = !DIGlobalVariable(name: "cbFrustumCulling", linkageName: "\01?cbFrustumCulling@@3U?$ConstantBuffer@UConstantBufferFrustumCulling@@@@A", scope: !0, file: !1, line: 4, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferFrustumCulling>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !114)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !116)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferFrustumCulling", file: !71, line: 139, size: 1024, align: 32, elements: !117)
!117 = !{!118, !123, !124, !125, !126, !127, !128}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "FrustumPlanes", scope: !116, file: !71, line: 141, baseType: !119, size: 768, align: 32)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 768, align: 32, elements: !121)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !77, line: 5, baseType: !24)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !116, file: !71, line: 143, baseType: !76, size: 96, align: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AABBGroupCount", scope: !116, file: !71, line: 144, baseType: !81, size: 32, align: 32, offset: 864)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !116, file: !71, line: 146, baseType: !81, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !116, file: !71, line: 147, baseType: !81, size: 32, align: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !116, file: !71, line: 148, baseType: !81, size: 32, align: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ResetRadianceBuffers", scope: !116, file: !71, line: 149, baseType: !81, size: 32, align: 32, offset: 992)
!129 = !DIGlobalVariable(name: "cbCamera", linkageName: "\01?cbCamera@@3U?$ConstantBuffer@ULight@@@@A", scope: !0, file: !1, line: 5, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Light>", file: !1, line: 5, size: 32, align: 32, elements: !2, templateParams: !131)
!131 = !{!132}
!132 = !DITemplateTypeParameter(name: "T", type: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !52, line: 6, size: 1536, align: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !133, file: !52, line: 8, baseType: !15, size: 96, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !133, file: !52, line: 9, baseType: !19, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !133, file: !52, line: 10, baseType: !15, size: 96, align: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !133, file: !52, line: 11, baseType: !19, size: 32, align: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !133, file: !52, line: 12, baseType: !15, size: 96, align: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !133, file: !52, line: 13, baseType: !19, size: 32, align: 32, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !133, file: !52, line: 14, baseType: !89, size: 512, align: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !133, file: !52, line: 15, baseType: !89, size: 512, align: 32, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !133, file: !52, line: 16, baseType: !14, size: 32, align: 32, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !133, file: !52, line: 17, baseType: !19, size: 32, align: 32, offset: 1440)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !133, file: !52, line: 18, baseType: !19, size: 32, align: 32, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !133, file: !52, line: 19, baseType: !19, size: 32, align: 32, offset: 1504)
!147 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!12}
!150 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !148, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !148, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 10, type: !148, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "gCameraDepth", linkageName: "\01?gCameraDepth@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 13, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 13, size: 160, align: 32, elements: !2, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "element", type: !25)
!157 = !DIGlobalVariable(name: "gVisibleFacesCounter", linkageName: "\01?gVisibleFacesCounter@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 16, type: !46, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !149)
!160 = !DIGlobalVariable(name: "gGaussianVisibleFacesIndices", linkageName: "\01?gGaussianVisibleFacesIndices@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 18, type: !159, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 19, type: !46, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 20, type: !46, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "gGaussianDispatchIndirectBuffer", linkageName: "\01?gGaussianDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 21, type: !164, isLocal: false, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 21, size: 96, align: 32, elements: !2, templateParams: !165)
!165 = !{!166}
!166 = !DITemplateTypeParameter(name: "element", type: !5)
!167 = !DIGlobalVariable(name: "gIndirectLightDispatchIndirectBuffer", linkageName: "\01?gIndirectLightDispatchIndirectBuffer@@3V?$RWStructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 22, type: !164, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "SQRT_2", scope: !0, file: !1, line: 24, type: !55, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !52, line: 90, type: !170, isLocal: false, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !53, size: 32, align: 4, offset: 64)
!171 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !52, line: 90, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !53, size: 32, align: 4, offset: 32)
!173 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !52, line: 90, type: !174, isLocal: false, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !53, size: 32, align: 4)
!175 = !{i32 2, !"Dwarf Version", i32 4}
!176 = !{i32 2, !"Debug Info Version", i32 3}
!177 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
