#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 92f16c590caa256421f3dfd1540d2b57.pdb
; shader hash: 92f16c590caa256421f3dfd1540d2b57
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !26, globals: !84)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5CLightTransportIndirect_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !17, !10}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 173, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !8, templateParams: !13)
!8 = !{!9, !11, !12}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 37, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 37, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 37, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !10)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 3)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 191, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 191, size: 128, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 191, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 191, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 191, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !18, file: !1, line: 191, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!24 = !{!14, !25}
!25 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 4)
!26 = !{!27, !38, !42, !45, !68, !73, !76, !77, !80}
!27 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 171, type: !28, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30, !30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 37, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 37, size: 96, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 37, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 37, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 37, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!37, !15}
!37 = !DITemplateTypeParameter(name: "element", type: !5)
!38 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !39, file: !39, line: 88, type: !40, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!30, !4, !30}
!42 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !39, file: !39, line: 183, type: !43, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!10, !6, !6, !6, !6, !10}
!45 = !DISubprogram(name: "clusterToVoxelIrradiancePerVoxelArrayVoxel", linkageName: "\01?clusterToVoxelIrradiancePerVoxelArrayVoxel@@YA?AV?$vector@M$02@@UClusterData@@IV1@1@Z", scope: !1, file: !1, line: 39, type: !46, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!6, !48, !4, !6, !6}
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !49, line: 199, size: 2688, align: 32, elements: !50)
!49 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!50 = !{!51, !52, !55, !57, !58, !59, !60, !61, !62, !63, !64}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !48, file: !49, line: 201, baseType: !30, size: 96, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !48, file: !49, line: 202, baseType: !53, size: 32, align: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !54, line: 8, baseType: !4)
!54 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !48, file: !49, line: 204, baseType: !56, size: 96, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !54, line: 4, baseType: !6)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !48, file: !49, line: 205, baseType: !53, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !48, file: !49, line: 207, baseType: !56, size: 96, align: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !48, file: !49, line: 208, baseType: !53, size: 32, align: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !48, file: !49, line: 210, baseType: !56, size: 96, align: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !48, file: !49, line: 211, baseType: !53, size: 32, align: 32, offset: 480)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !48, file: !49, line: 213, baseType: !56, size: 96, align: 32, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !48, file: !49, line: 214, baseType: !10, size: 32, align: 32, offset: 608)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !48, file: !49, line: 216, baseType: !65, size: 2048, align: 32, offset: 640)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 64)
!68 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !39, file: !39, line: 120, type: !69, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !4, !72}
!71 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 26, size: 32, align: 32, elements: !2)
!73 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !39, file: !39, line: 210, type: !74, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!10, !6, !6}
!76 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !39, file: !39, line: 198, type: !74, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubprogram(name: "gatherIrradianceFromNeighbour", linkageName: "\01?gatherIrradianceFromNeighbour@@YA?AV?$vector@M$02@@IV1@@Z", scope: !1, file: !1, line: 137, type: !78, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!6, !4, !6}
!80 = !DISubprogram(name: "PackFloat3ToUint", linkageName: "\01?PackFloat3ToUint@@YAIV?$vector@M$02@@@Z", scope: !81, file: !81, line: 138, type: !82, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!4, !6}
!84 = !{!85, !88, !90, !91, !92, !94, !96, !98, !99, !100, !142, !158, !161, !162, !163, !164, !168, !169, !170, !174, !175, !183, !193, !194, !204, !205, !206, !217, !218, !219, !220, !222, !223, !225, !227, !229}
!85 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !86, line: 90, type: !87, isLocal: true, isDefinition: true)
!86 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!88 = !DIGlobalVariable(name: "PI", scope: !0, file: !86, line: 108, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!90 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !86, line: 109, type: !89, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !86, line: 110, type: !89, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !81, line: 48, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!94 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !81, line: 49, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!96 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !39, line: 15, type: !97, isLocal: true, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!98 = !DIGlobalVariable(name: "cos30", scope: !0, file: !39, line: 16, type: !89, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "cos25", scope: !0, file: !39, line: 17, type: !89, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !102)
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "T", type: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !49, line: 26, size: 1792, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !141}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !104, file: !49, line: 28, baseType: !30, size: 96, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !104, file: !49, line: 29, baseType: !10, size: 32, align: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !104, file: !49, line: 31, baseType: !56, size: 96, align: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !104, file: !49, line: 32, baseType: !10, size: 32, align: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !104, file: !49, line: 34, baseType: !56, size: 96, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !104, file: !49, line: 35, baseType: !53, size: 32, align: 32, offset: 352)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !104, file: !49, line: 37, baseType: !56, size: 96, align: 32, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !104, file: !49, line: 38, baseType: !53, size: 32, align: 32, offset: 480)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !104, file: !49, line: 40, baseType: !56, size: 96, align: 32, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !104, file: !49, line: 41, baseType: !53, size: 32, align: 32, offset: 608)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !104, file: !49, line: 43, baseType: !56, size: 96, align: 32, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !104, file: !49, line: 44, baseType: !10, size: 32, align: 32, offset: 736)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !104, file: !49, line: 46, baseType: !119, size: 512, align: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !120)
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !121, templateParams: !138)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !120, file: !1, line: 3, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!138 = !{!14, !139, !140}
!139 = !DITemplateValueParameter(name: "row_count", type: !16, value: i32 4)
!140 = !DITemplateValueParameter(name: "col_count", type: !16, value: i32 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !104, file: !49, line: 47, baseType: !119, size: 512, align: 32, offset: 1280)
!142 = !DIGlobalVariable(name: "cbIndirectLight", linkageName: "\01?cbIndirectLight@@3U?$ConstantBuffer@UConstantBufferIndirectLightTransport@@@@A", scope: !0, file: !1, line: 4, type: !143, isLocal: false, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferIndirectLightTransport>", file: !1, line: 4, size: 32, align: 32, elements: !2, templateParams: !144)
!144 = !{!145}
!145 = !DITemplateTypeParameter(name: "T", type: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferIndirectLightTransport", file: !49, line: 152, size: 640, align: 32, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !146, file: !49, line: 154, baseType: !56, size: 96, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !146, file: !49, line: 155, baseType: !53, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "LightPosition", scope: !146, file: !49, line: 157, baseType: !56, size: 96, align: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "LightIntensity", scope: !146, file: !49, line: 158, baseType: !10, size: 32, align: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "LightColor", scope: !146, file: !49, line: 160, baseType: !56, size: 96, align: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CloseVoxelStrength", scope: !146, file: !49, line: 161, baseType: !10, size: 32, align: 32, offset: 352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "FarVoxelStrength", scope: !146, file: !49, line: 163, baseType: !10, size: 32, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !146, file: !49, line: 164, baseType: !56, size: 96, align: 32, offset: 416)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "EyePosition", scope: !146, file: !49, line: 166, baseType: !56, size: 96, align: 32, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchNumber", scope: !146, file: !49, line: 167, baseType: !53, size: 32, align: 32, offset: 608)
!158 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 6, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 6, size: 32, align: 32, elements: !2, templateParams: !160)
!160 = !{!37}
!161 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !159, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 8, type: !159, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 9, type: !159, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 11, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 11, size: 2688, align: 32, elements: !2, templateParams: !166)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "element", type: !48)
!168 = !DIGlobalVariable(name: "gVoxelsInCluster", linkageName: "\01?gVoxelsInCluster@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 12, type: !159, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !159, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 14, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 14, size: 96, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "element", type: !7)
!174 = !DIGlobalVariable(name: "gVoxelNormalBuffer", linkageName: "\01?gVoxelNormalBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 15, type: !171, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 17, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 17, size: 192, align: 32, elements: !2, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "element", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !49, line: 12, size: 192, align: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !179, file: !49, line: 14, baseType: !6, size: 96, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !179, file: !49, line: 15, baseType: !6, size: 96, align: 32, offset: 96)
!183 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 18, type: !184, isLocal: false, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 18, size: 256, align: 32, elements: !2, templateParams: !185)
!185 = !{!186}
!186 = !DITemplateTypeParameter(name: "element", type: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !49, line: 183, size: 256, align: 32, elements: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !187, file: !49, line: 185, baseType: !56, size: 96, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !187, file: !49, line: 186, baseType: !53, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !187, file: !49, line: 187, baseType: !56, size: 96, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !187, file: !49, line: 188, baseType: !53, size: 32, align: 32, offset: 224)
!193 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !159, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 22, type: !195, isLocal: false, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 22, size: 64, align: 32, elements: !2, templateParams: !196)
!196 = !{!197}
!197 = !DITemplateTypeParameter(name: "element", type: !198)
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 198, size: 64, align: 32, elements: !199, templateParams: !202)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !198, file: !1, line: 198, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !198, file: !1, line: 198, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!202 = !{!37, !203}
!203 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!204 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !159, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariable(name: "gLitVoxels", linkageName: "\01?gLitVoxels@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !72, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariable(name: "gLitClusters", linkageName: "\01?gLitClusters@@3V?$StructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 27, type: !207, isLocal: false, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !208)
!208 = !{!209}
!209 = !DITemplateTypeParameter(name: "element", type: !210)
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 221, size: 128, align: 32, elements: !211, templateParams: !216)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !210, file: !1, line: 221, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !210, file: !1, line: 221, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !210, file: !1, line: 221, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !210, file: !1, line: 221, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!216 = !{!37, !25}
!217 = !DIGlobalVariable(name: "gVisibleFaceCounter", linkageName: "\01?gVisibleFaceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 29, type: !72, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariable(name: "gIndirectLightVisibleFacesIndices", linkageName: "\01?gIndirectLightVisibleFacesIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 30, type: !159, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariable(name: "gGaussianVoxelBitmap", linkageName: "\01?gGaussianVoxelBitmap@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 31, type: !72, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariable(name: "gFaceRadianceBuffer", linkageName: "\01?gFaceRadianceBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 34, type: !221, isLocal: false, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 34, size: 32, align: 32, elements: !2, templateParams: !160)
!222 = !DIGlobalVariable(name: "gRadianceForVisibleFaceIdx", linkageName: "\01?gRadianceForVisibleFaceIdx@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !221, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !86, line: 90, type: !224, isLocal: false, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !87, size: 32, align: 4)
!225 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !86, line: 90, type: !226, isLocal: false, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !87, size: 32, align: 4, offset: 64)
!227 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !86, line: 90, type: !228, isLocal: false, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !87, size: 32, align: 4, offset: 32)
!229 = !DIGlobalVariable(name: "gsRadiancePerWave", linkageName: "\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim", scope: !0, file: !1, line: 37, type: !230, isLocal: false, isDefinition: true, variable: [6 x float] addrspace(3)* @"\01?gsRadiancePerWave@@3PAV?$vector@M$02@@A.v.1dim")
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, align: 32, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !{i32 2, !"Dwarf Version", i32 4}
!234 = !{i32 2, !"Debug Info Version", i32 3}
!235 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
