#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 938d7185042f83c2af8150f47235b71c.pdb
; shader hash: 938d7185042f83c2af8150f47235b71c
;
; Buffer Definitions:
;
; cbuffer cbVoxelCommons
; {
;
;   struct hostlayout.cbVoxelCommons
;   {
;
;       struct hostlayout.struct.ConstantBufferVoxelCommons
;       {
;
;           uint3 voxelTextureDimensions;             ; Offset:    0
;           float totalTime;                          ; Offset:   12
;           float3 voxelCellSize;                     ; Offset:   16
;           float deltaTime;                          ; Offset:   28
;           float3 invVoxelTextureDimensions;         ; Offset:   32
;           uint StoreData;                           ; Offset:   44
;           float3 invVoxelCellSize;                  ; Offset:   48
;           uint VoxelCount;                          ; Offset:   60
;           float3 SceneAABBMin;                      ; Offset:   64
;           uint ClusterCount;                        ; Offset:   76
;           float3 SceneAABBMax;                      ; Offset:   80
;           float pad3;                               ; Offset:   92
;           column_major float4x4 VoxelToWorld;       ; Offset:   96
;           column_major float4x4 WorldToVoxel;       ; Offset:  160
;       
;       } cbVoxelCommons;                             ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !66, globals: !278)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5CRaytracingShadow.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !33, !40, !8, !48, !50, !58}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 88, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 88, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x3", file: !1, line: 123, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 3>", file: !1, line: 123, size: 192, align: 32, elements: !24, templateParams: !31)
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!31 = !{!18, !32, !21}
!32 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 88, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 88, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!18, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 88, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 88, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!18, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 87, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 157, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 157, size: 96, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!57, !47}
!57 = !DITemplateTypeParameter(name: "element", type: !49)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 102, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 102, size: 96, align: 32, elements: !60, templateParams: !64)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!64 = !{!65, !47}
!65 = !DITemplateTypeParameter(name: "element", type: !20)
!66 = !{!67, !97, !110, !113, !116, !119, !122, !123, !133, !172, !175, !178, !181, !182, !183, !186, !193, !196, !199, !202, !205, !209, !212, !216, !220, !224, !227, !228, !231, !232, !235, !238, !239, !248, !267, !270, !277}
!67 = !DISubprogram(name: "GetPBRMaterial", linkageName: "\01?GetPBRMaterial@@YA?AUPBRMaterial@@UGenericMaterial@@@Z", scope: !68, file: !68, line: 59, type: !69, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !87}
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBRMaterial", file: !68, line: 36, size: 352, align: 32, elements: !72)
!72 = !{!73, !83, !84, !85, !86}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "baseColor", scope: !71, file: !68, line: 38, baseType: !74, size: 128, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !76, templateParams: !81)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !75, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !75, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !75, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !75, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!81 = !{!18, !82}
!82 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !71, file: !68, line: 39, baseType: !74, size: 128, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !71, file: !68, line: 41, baseType: !8, size: 32, align: 32, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !71, file: !68, line: 42, baseType: !8, size: 32, align: 32, offset: 288)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !71, file: !68, line: 43, baseType: !8, size: 32, align: 32, offset: 320)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericMaterial", file: !68, line: 22, size: 640, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "float4_0", scope: !87, file: !68, line: 24, baseType: !74, size: 128, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "float4_1", scope: !87, file: !68, line: 25, baseType: !74, size: 128, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "float4_2", scope: !87, file: !68, line: 26, baseType: !74, size: 128, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "float4_3", scope: !87, file: !68, line: 27, baseType: !74, size: 128, align: 32, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "float_0", scope: !87, file: !68, line: 29, baseType: !8, size: 32, align: 32, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "float_1", scope: !87, file: !68, line: 30, baseType: !8, size: 32, align: 32, offset: 544)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "float_2", scope: !87, file: !68, line: 31, baseType: !8, size: 32, align: 32, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "float_3", scope: !87, file: !68, line: 32, baseType: !8, size: 32, align: 32, offset: 608)
!97 = !DISubprogram(name: "GetPhongMaterial", linkageName: "\01?GetPhongMaterial@@YA?AUPhongMaterial@@UGenericMaterial@@@Z", scope: !68, file: !68, line: 73, type: !98, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !87}
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhongMaterial", file: !68, line: 46, size: 640, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseColor", scope: !100, file: !68, line: 48, baseType: !74, size: 128, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !100, file: !68, line: 49, baseType: !74, size: 128, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "specularColor", scope: !100, file: !68, line: 50, baseType: !74, size: 128, align: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ambientColor", scope: !100, file: !68, line: 51, baseType: !74, size: 128, align: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !100, file: !68, line: 53, baseType: !8, size: 32, align: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !100, file: !68, line: 54, baseType: !8, size: 32, align: 32, offset: 544)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !100, file: !68, line: 55, baseType: !8, size: 32, align: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "refractiveIndex", scope: !100, file: !68, line: 56, baseType: !8, size: 32, align: 32, offset: 608)
!110 = !DISubprogram(name: "CalculateTBN", linkageName: "\01?CalculateTBN@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@0V?$vector@M$01@@@Z", scope: !68, file: !68, line: 115, type: !111, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!111 = !DISubroutineType(types: !112)
!112 = !{!4, !40, !40, !33}
!113 = !DISubprogram(name: "ComputeTwoChannelNormal", linkageName: "\01?ComputeTwoChannelNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !68, file: !68, line: 131, type: !114, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!114 = !DISubroutineType(types: !115)
!115 = !{!40, !33}
!116 = !DISubprogram(name: "signNotZero", linkageName: "\01?signNotZero@@YA?AV?$vector@M$01@@V1@@Z", scope: !68, file: !68, line: 147, type: !117, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!117 = !DISubroutineType(types: !118)
!118 = !{!33, !33}
!119 = !DISubprogram(name: "PackNormal", linkageName: "\01?PackNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !68, file: !68, line: 152, type: !120, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!120 = !DISubroutineType(types: !121)
!121 = !{!33, !40}
!122 = !DISubprogram(name: "UnpackNormal", linkageName: "\01?UnpackNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !68, file: !68, line: 160, type: !114, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubprogram(name: "Spec", linkageName: "\01?Spec@@YAMV?$vector@M$02@@USurfaceData@@M@Z", scope: !68, file: !68, line: 169, type: !124, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!124 = !DISubroutineType(types: !125)
!125 = !{!8, !40, !126, !8}
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceData", file: !68, line: 99, size: 416, align: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !126, file: !68, line: 101, baseType: !40, size: 96, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !126, file: !68, line: 102, baseType: !40, size: 96, align: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "NdotV", scope: !126, file: !68, line: 103, baseType: !8, size: 32, align: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "c_diff", scope: !126, file: !68, line: 104, baseType: !40, size: 96, align: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "c_spec", scope: !126, file: !68, line: 105, baseType: !40, size: 96, align: 32, offset: 320)
!133 = !DISubprogram(name: "ComputeDirectionalLight", linkageName: "\01?ComputeDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@MM@Z", scope: !68, file: !68, line: 178, type: !134, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!134 = !DISubroutineType(types: !135)
!135 = !{!40, !136, !126, !8, !8}
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !68, line: 6, size: 1536, align: 32, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !167, !168, !169, !170, !171}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !136, file: !68, line: 8, baseType: !40, size: 96, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !136, file: !68, line: 9, baseType: !8, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !136, file: !68, line: 10, baseType: !40, size: 96, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !136, file: !68, line: 11, baseType: !8, size: 32, align: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !136, file: !68, line: 12, baseType: !40, size: 96, align: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !136, file: !68, line: 13, baseType: !8, size: 32, align: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !136, file: !68, line: 14, baseType: !145, size: 512, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 175, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 175, size: 512, align: 32, elements: !147, templateParams: !164)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !146, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!164 = !{!18, !165, !166}
!165 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!166 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !136, file: !68, line: 15, baseType: !145, size: 512, align: 32, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !136, file: !68, line: 16, baseType: !20, size: 32, align: 32, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !136, file: !68, line: 17, baseType: !8, size: 32, align: 32, offset: 1440)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !136, file: !68, line: 18, baseType: !8, size: 32, align: 32, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !136, file: !68, line: 19, baseType: !8, size: 32, align: 32, offset: 1504)
!172 = !DISubprogram(name: "FresnelShlick", linkageName: "\01?FresnelShlick@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !68, file: !68, line: 199, type: !173, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false)
!173 = !DISubroutineType(types: !174)
!174 = !{!40, !40, !40, !8}
!175 = !DISubprogram(name: "Diffuse_Burley", linkageName: "\01?Diffuse_Burley@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !68, file: !68, line: 205, type: !176, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false)
!176 = !DISubroutineType(types: !177)
!177 = !{!40, !126, !8, !8, !8}
!178 = !DISubprogram(name: "Specular_D_GGX", linkageName: "\01?Specular_D_GGX@@YAMUSurfaceData@@MM@Z", scope: !68, file: !68, line: 212, type: !179, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false)
!179 = !DISubroutineType(types: !180)
!180 = !{!8, !126, !8, !8}
!181 = !DISubprogram(name: "G_Shlick_Smith_Hable", linkageName: "\01?G_Shlick_Smith_Hable@@YAMUSurfaceData@@MM@Z", scope: !68, file: !68, line: 221, type: !179, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false)
!182 = !DISubprogram(name: "Specular_BRDF", linkageName: "\01?Specular_BRDF@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !68, file: !68, line: 226, type: !176, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false)
!183 = !DISubprogram(name: "PBRDirectionalLight", linkageName: "\01?PBRDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@M@Z", scope: !68, file: !68, line: 242, type: !184, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false)
!184 = !DISubroutineType(types: !185)
!185 = !{!40, !136, !126, !8}
!186 = !DISubprogram(name: "CalcShadowFactor", linkageName: "\01?CalcShadowFactor@@YAMV?$Texture2D@V?$vector@M$03@@@@V?$vector@M$03@@@Z", scope: !187, file: !187, line: 79, type: !188, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!188 = !DISubroutineType(types: !189)
!189 = !{!8, !190, !74}
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 259, size: 160, align: 32, elements: !2, templateParams: !191)
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "element", type: !75)
!193 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !187, file: !187, line: 120, type: !194, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!194 = !DISubroutineType(types: !195)
!195 = !{!33, !48}
!196 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !187, file: !187, line: 128, type: !197, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!197 = !DISubroutineType(types: !198)
!198 = !{!48, !33}
!199 = !DISubprogram(name: "PackFloat3ToUint", linkageName: "\01?PackFloat3ToUint@@YAIV?$vector@M$02@@@Z", scope: !187, file: !187, line: 138, type: !200, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false)
!200 = !DISubroutineType(types: !201)
!201 = !{!48, !40}
!202 = !DISubprogram(name: "UnpackUintToFloat3", linkageName: "\01?UnpackUintToFloat3@@YA?AV?$vector@M$02@@I@Z", scope: !187, file: !187, line: 150, type: !203, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!203 = !DISubroutineType(types: !204)
!204 = !{!40, !48}
!205 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !206, file: !206, line: 88, type: !207, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!206 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!50, !48, !50}
!209 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !206, file: !206, line: 97, type: !210, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!48, !50, !50}
!212 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !206, file: !206, line: 105, type: !213, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !50, !58, !50}
!215 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!216 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !206, file: !206, line: 120, type: !217, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!217 = !DISubroutineType(types: !218)
!218 = !{!215, !48, !219}
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 118, size: 32, align: 32, elements: !2)
!220 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !206, file: !206, line: 131, type: !221, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{!215, !48, !223}
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 129, size: 32, align: 32, elements: !2)
!224 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !206, file: !206, line: 142, type: !225, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DISubroutineType(types: !226)
!226 = !{!215, !50, !50, !219}
!227 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !206, file: !206, line: 148, type: !221, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!228 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NV?$vector@I$02@@0URWByteAddressBuffer@@@Z", scope: !206, file: !206, line: 162, type: !229, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false)
!229 = !DISubroutineType(types: !230)
!230 = !{!215, !50, !50, !223}
!231 = !DISubprogram(name: "ClearVoxelPresence", linkageName: "\01?ClearVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !206, file: !206, line: 169, type: !221, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !206, file: !206, line: 183, type: !233, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DISubroutineType(types: !234)
!234 = !{!8, !40, !40, !40, !40, !8}
!235 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !206, file: !206, line: 198, type: !236, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!236 = !DISubroutineType(types: !237)
!237 = !{!8, !40, !40}
!238 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !206, file: !206, line: 210, type: !236, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false)
!239 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NV?$vector@M$02@@0Y01V1@AIAM2@Z", scope: !240, file: !240, line: 4, type: !241, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/RaytracingUtils.hlsli", directory: "")
!241 = !DISubroutineType(types: !242)
!242 = !{!215, !40, !40, !243, !246, !246}
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, align: 32, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!248 = !DISubprogram(name: "GetFaceEdgeMidpoints", linkageName: "\01?GetFaceEdgeMidpoints@@YA?AV?$matrix@M$03$02@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 40, type: !249, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !40, !40}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 34, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 34, size: 384, align: 32, elements: !253, templateParams: !266)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !252, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!266 = !{!18, !165, !21}
!267 = !DISubprogram(name: "ShadowRaygen", linkageName: "\01?ShadowRaygen@@YAXXZ", scope: !1, file: !1, line: 80, type: !268, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowRaygen@@YAXXZ")
!268 = !DISubroutineType(types: !269)
!269 = !{null}
!270 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 182, type: !271, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z")
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273}
!273 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 30, size: 32, align: 32, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "voxelIdx", scope: !274, file: !1, line: 32, baseType: !48, size: 32, align: 32)
!277 = !DISubprogram(name: "ShadowIntersection", linkageName: "\01?ShadowIntersection@@YAXXZ", scope: !1, file: !1, line: 188, type: !268, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?ShadowIntersection@@YAXXZ")
!278 = !{!279, !281, !282, !283, !285, !286, !287, !289, !290, !291, !292, !294, !296, !297, !298, !299, !323, !335, !337, !340, !341, !342, !343, !363, !364, !365, !369, !370, !381, !383, !385}
!279 = !DIGlobalVariable(name: "PI", scope: !0, file: !68, line: 108, type: !280, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!281 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !68, line: 110, type: !280, isLocal: true, isDefinition: true, variable: float 0x3EB0C6F7A0000000)
!282 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !239, file: !240, line: 18, type: !280, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 143, type: !284, isLocal: true, isDefinition: true, variable: i32 4)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!285 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 143, type: !284, isLocal: true, isDefinition: true, variable: i32 8)
!286 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !206, line: 15, type: !284, isLocal: true, isDefinition: true, variable: i32 -1)
!287 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !68, line: 90, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!289 = !DIGlobalVariable(name: "PI", scope: !0, file: !68, line: 108, type: !280, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !68, line: 109, type: !280, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !68, line: 110, type: !280, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !187, line: 48, type: !293, isLocal: false, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!294 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !187, line: 49, type: !295, isLocal: false, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!296 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !206, line: 15, type: !284, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariable(name: "cos30", scope: !0, file: !206, line: 16, type: !280, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariable(name: "cos25", scope: !0, file: !206, line: 17, type: !280, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 9, type: !300, isLocal: false, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 9, size: 32, align: 32, elements: !2, templateParams: !301)
!301 = !{!302}
!302 = !DITemplateTypeParameter(name: "T", type: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !304, line: 26, size: 1792, align: 32, elements: !305)
!304 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!305 = !{!306, !307, !308, !311, !312, !313, !315, !316, !317, !318, !319, !320, !321, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !303, file: !304, line: 28, baseType: !50, size: 96, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !303, file: !304, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !303, file: !304, line: 31, baseType: !309, size: 96, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !310, line: 4, baseType: !40)
!310 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !303, file: !304, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !303, file: !304, line: 34, baseType: !309, size: 96, align: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !303, file: !304, line: 35, baseType: !314, size: 32, align: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !310, line: 8, baseType: !48)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !303, file: !304, line: 37, baseType: !309, size: 96, align: 32, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !303, file: !304, line: 38, baseType: !314, size: 32, align: 32, offset: 480)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !303, file: !304, line: 40, baseType: !309, size: 96, align: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !303, file: !304, line: 41, baseType: !314, size: 32, align: 32, offset: 608)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !303, file: !304, line: 43, baseType: !309, size: 96, align: 32, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !303, file: !304, line: 44, baseType: !8, size: 32, align: 32, offset: 736)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !303, file: !304, line: 46, baseType: !145, size: 512, align: 32, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !303, file: !304, line: 47, baseType: !145, size: 512, align: 32, offset: 1280)
!323 = !DIGlobalVariable(name: "cbRaytracingShadows", linkageName: "\01?cbRaytracingShadows@@3U?$ConstantBuffer@UConstantBufferRTShadows@@@@A", scope: !0, file: !1, line: 10, type: !324, isLocal: false, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferRTShadows>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !325)
!325 = !{!326}
!326 = !DITemplateTypeParameter(name: "T", type: !327)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferRTShadows", file: !304, line: 88, size: 256, align: 32, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "LightDirection", scope: !327, file: !304, line: 90, baseType: !309, size: 96, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !327, file: !304, line: 91, baseType: !314, size: 32, align: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStep", scope: !327, file: !304, line: 93, baseType: !314, size: 32, align: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !327, file: !304, line: 94, baseType: !314, size: 32, align: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !327, file: !304, line: 95, baseType: !314, size: 32, align: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "FrameCount", scope: !327, file: !304, line: 96, baseType: !314, size: 32, align: 32, offset: 224)
!335 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 12, type: !336, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 12, size: 32, align: 32, elements: !2)
!337 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 14, type: !338, isLocal: false, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !339)
!339 = !{!57}
!340 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 15, type: !338, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 16, type: !338, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !338, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A")
!343 = !DIGlobalVariable(name: "gClusterDataBuffer", linkageName: "\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", scope: !0, file: !1, line: 19, type: !344, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<ClusterData>"* @"\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A")
!344 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterData>", file: !1, line: 19, size: 2688, align: 32, elements: !2, templateParams: !345)
!345 = !{!346}
!346 = !DITemplateTypeParameter(name: "element", type: !347)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterData", file: !304, line: 199, size: 2688, align: 32, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !347, file: !304, line: 201, baseType: !50, size: 96, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !347, file: !304, line: 202, baseType: !314, size: 32, align: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !347, file: !304, line: 204, baseType: !309, size: 96, align: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "FirstDataIndex", scope: !347, file: !304, line: 205, baseType: !314, size: 32, align: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !347, file: !304, line: 207, baseType: !309, size: 96, align: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !347, file: !304, line: 208, baseType: !314, size: 32, align: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "MinAABB", scope: !347, file: !304, line: 210, baseType: !309, size: 96, align: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "NeighbourCount", scope: !347, file: !304, line: 211, baseType: !314, size: 32, align: 32, offset: 480)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAABB", scope: !347, file: !304, line: 213, baseType: !309, size: 96, align: 32, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !347, file: !304, line: 214, baseType: !8, size: 32, align: 32, offset: 608)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterNeighbours", scope: !347, file: !304, line: 216, baseType: !360, size: 2048, align: 32, offset: 640)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 2048, align: 32, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 64)
!363 = !DIGlobalVariable(name: "gNextVoxelLinkedList", linkageName: "\01?gNextVoxelLinkedList@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !338, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariable(name: "gVoxelAssignmentMap", linkageName: "\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 21, type: !338, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A")
!365 = !DIGlobalVariable(name: "gVoxelColorBuffer", linkageName: "\01?gVoxelColorBuffer@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 22, type: !366, isLocal: false, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 22, size: 96, align: 32, elements: !2, templateParams: !367)
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "element", type: !41)
!369 = !DIGlobalVariable(name: "gVoxelLitBuffer", linkageName: "\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 25, type: !223, isLocal: false, isDefinition: true, variable: %struct.RWByteAddressBuffer* @"\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A")
!370 = !DIGlobalVariable(name: "gClusterLitBuffer", linkageName: "\01?gClusterLitBuffer@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 26, type: !371, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<vector<unsigned int, 4> >"* @"\01?gClusterLitBuffer@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A")
!371 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 4> >", file: !1, line: 26, size: 128, align: 32, elements: !2, templateParams: !372)
!372 = !{!373}
!373 = !DITemplateTypeParameter(name: "element", type: !374)
!374 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 26, size: 128, align: 32, elements: !375, templateParams: !380)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !374, file: !1, line: 26, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !374, file: !1, line: 26, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !374, file: !1, line: 26, baseType: !49, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !374, file: !1, line: 26, baseType: !49, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!380 = !{!57, !82}
!381 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !68, line: 90, type: !382, isLocal: false, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !288, size: 32, align: 4, offset: 64)
!383 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !68, line: 90, type: !384, isLocal: false, isDefinition: true)
!384 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !288, size: 32, align: 4, offset: 32)
!385 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !68, line: 90, type: !386, isLocal: false, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !288, size: 32, align: 4)
!387 = !{i32 2, !"Dwarf Version", i32 4}
!388 = !{i32 2, !"Debug Info Version", i32 3}
!389 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!390 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5CRaytracingShadow.hlsl", !"#ifndef RAYTRACING_SHADOW_HLSL\0D\0A#define RAYTRACING_SHADOW_HLSL\0D\0A\0D\0A#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A#include \22../../VoxelUtils/Shaders/TechniquesCompat.h\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0AConstantBuffer<ConstantBufferRTShadows> cbRaytracingShadows : register(b1);\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space1);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space1);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space1);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space1);\0D\0A\0D\0AStructuredBuffer<ClusterData> gClusterDataBuffer : register(t0, space2);\0D\0AStructuredBuffer<uint> gNextVoxelLinkedList : register(t1, space2);\0D\0AStructuredBuffer<uint> gVoxelAssignmentMap : register(t2, space2);\0D\0AStructuredBuffer<float3> gVoxelColorBuffer : register(t3, space2);\0D\0A\0D\0A\0D\0ARWByteAddressBuffer gVoxelLitBuffer : register(u0, space0);\0D\0ARWStructuredBuffer<uint4> gClusterLitBuffer : register(u1, space0);\0D\0A\0D\0A\0D\0A\0D\0Astruct Payload\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Astruct Attributes\0D\0A{\0D\0A    uint voxelIdx;\0D\0A};\0D\0A\0D\0Afloat4x3 GetFaceEdgeMidpoints(float3 voxelCenter, float3 faceDirection)\0D\0A{\0D\0A    // Define the half-size offsets.\0D\0A    float3 right = float3(1.0f, 0.0f, 0.0f);\0D\0A    float3 up = float3(0.0f, 1.0f, 0.0f);\0D\0A    float3 forward = float3(0.0f, 0.0f, 1.0f);\0D\0A\0D\0A    // Initialize a float3x4 to store the edge midpoints.\0D\0A    float4x3 edgeMidpoints;\0D\0A\0D\0A    // Determine midpoints based on face direction.\0D\0A    if (faceDirection.x != 0.0f)\0D\0A    {\0D\0A        // Left or right face.\0D\0A        edgeMidpoints[0] = faceDirection - up;\0D\0A        edgeMidpoints[1] = faceDirection + up;\0D\0A        edgeMidpoints[2] = faceDirection - forward;\0D\0A        edgeMidpoints[3] = faceDirection + forward;\0D\0A    }\0D\0A    else if (faceDirection.y != 0.0f)\0D\0A    {\0D\0A        // Top or bottom face.\0D\0A        edgeMidpoints[0] = faceDirection - right;\0D\0A        edgeMidpoints[1] = faceDirection + right;\0D\0A        edgeMidpoints[2] = faceDirection - forward;\0D\0A        edgeMidpoints[3] = faceDirection + forward;\0D\0A    }\0D\0A    else if (faceDirection.z != 0.0f)\0D\0A    {\0D\0A        // Front or back face.\0D\0A        edgeMidpoints[0] = faceDirection - right;\0D\0A        edgeMidpoints[1] = faceDirection + right;\0D\0A        edgeMidpoints[2] = faceDirection - up;\0D\0A        edgeMidpoints[3] = faceDirection + up;\0D\0A    }\0D\0A\0D\0A    return edgeMidpoints;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid ShadowRaygen()\0D\0A{\0D\0A\0D\0A    uint3 dispatchIdx = DispatchRaysIndex();\0D\0A    uint3 dispatchDim = DispatchRaysDimensions();\0D\0A\0D\0A    float3 faceDirectionPos[3] =\0D\0A    {\0D\0A        float3(0.0f, 0.0f, 0.5f),\0D\0A        float3(0.5f, 0.0f, 0.0f),\0D\0A        float3(0.0f, 0.5f, 0.0f),\0D\0A    };\0D\0A    \0D\0A    uint linearIdx = GetLinearCoord(dispatchIdx, dispatchDim);\0D\0A    \0D\0A    if (linearIdx >= cbRaytracingShadows.FaceCount)\0D\0A        return;\0D\0A    \0D\0A    // At most, only 3 faces can be lit by the light source\0D\0A    uint voxelIdx = (uint) floor(linearIdx / 3.0f);\0D\0A    uint faceIdx = linearIdx % 3;\0D\0A    \0D\0A    float3 faceDir = faceDirectionPos[faceIdx];\0D\0A    faceDir *= sign(dot(-cbRaytracingShadows.LightDirection, faceDir));\0D\0A    \0D\0A    float3 voxelCenter = float3(GetVoxelPosition(gVoxelHashedCompactBuffer[voxelIdx], cbVoxelCommons.voxelTextureDimensions));\0D\0A    \0D\0A    \0D\0A    // Define ray starting position and other parameters\0D\0A    RayDesc ray;\0D\0A    // A face is half a voxel distant from the center, so we divide the face direction by 2. We also multiply by 1.1 to add\0D\0A    // a small offset to avoid self intersection\0D\0A    ray.Direction = -cbRaytracingShadows.LightDirection;\0D\0A    // Start the ray slightly away from the origin \0D\0A    // TODO: check if this value is okay or can be improved\0D\0A    ray.TMin = 0.5f; \0D\0A    // Chebyshev Distance (1.74 is an approximation of sqrt(3));\0D\0A    // This is an approximation of the scene diagonal, which is the maximum distance a ray can travel for a hit.\0D\0A    ray.TMax = max(max(cbVoxelCommons.voxelTextureDimensions.x, cbVoxelCommons.voxelTextureDimensions.y), cbVoxelCommons.voxelTextureDimensions.z);\0D\0A    ray.TMax *= 1.74f; \0D\0A    Payload rayPayload = { 1 }; // Payload to store the index\0D\0A    \0D\0A    float3 points[5];\0D\0A\0D\0A    points[0] = voxelCenter + faceDir;\0D\0A    {\0D\0A        float4x3 edgeMidPoints = GetFaceEdgeMidpoints(voxelCenter, faceDir);\0D\0A        points[1] = voxelCenter + edgeMidPoints[0];\0D\0A        points[2] = voxelCenter + edgeMidPoints[1];\0D\0A        points[3] = voxelCenter + edgeMidPoints[2];\0D\0A        points[4] = voxelCenter + edgeMidPoints[3];\0D\0A    }\0D\0A\0D\0A    uint nSampleVisible = 0;\0D\0A    \0D\0A    // Not much difference when tracing a ray from only the center of the face\0D\0A    // Or also from the edges midpoints.\0D\0A    for (uint i = 0; i < 5; i++)\0D\0A    {\0D\0A\0D\0A        \0D\0A        ray.Origin = points[i];\0D\0A\0D\0A        TraceRay(Scene, RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER, ~0, 0, 0, 0, ray, rayPayload);\0D\0A        if (rayPayload.voxelIdx == 0)\0D\0A        {\0D\0A            nSampleVisible += 1;\0D\0A        }\0D\0A        \0D\0A        if (nSampleVisible > 4)\0D\0A            break;\0D\0A        \0D\0A        rayPayload.voxelIdx = 1;\0D\0A    }\0D\0A    \0D\0A    if (nSampleVisible > 4)\0D\0A    {\0D\0A        bool wasAlreadyLit = SetVoxelPresence(voxelIdx, gVoxelLitBuffer);\0D\0A        \0D\0A        if (!wasAlreadyLit)\0D\0A        {\0D\0A            uint clusterIdx = gVoxelAssignmentMap[voxelIdx];\0D\0A            \0D\0A            if (clusterIdx != UINT_MAX)\0D\0A            {\0D\0A                ClusterData clusterData = gClusterDataBuffer[clusterIdx];\0D\0A        \0D\0A                float formFactor = differentialAreaFormFactor(clusterData.Normal, cbRaytracingShadows.LightDirection);\0D\0A\0D\0A                float3 voxelRadiance = formFactor * clusterData.Color * 150.0f;\0D\0A                uint3 irradianceUint = uint3(voxelRadiance * IRRADIANCE_FIELD_MULTIPLIER);\0D\0A                \0D\0A                InterlockedAdd(gClusterLitBuffer[clusterIdx].x, irradianceUint.x);\0D\0A                InterlockedAdd(gClusterLitBuffer[clusterIdx].y, irradianceUint.y);\0D\0A                InterlockedAdd(gClusterLitBuffer[clusterIdx].z, irradianceUint.z);\0D\0A                InterlockedAdd(gClusterLitBuffer[clusterIdx].w, 1);\0D\0A            }\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid ShadowMiss(inout Payload rayPayload)\0D\0A{\0D\0A    rayPayload.voxelIdx = 0;\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid ShadowIntersection()\0D\0A{\0D\0A    Attributes attr = { 1 };\0D\0A    ReportHit(1.0f, 0, attr); // Report the hit with hitT as tMin\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_SHADOW_HLSL\0D\0A"}
!391 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#ifndef COMMON_HLSLI\0D\0A#define COMMON_HLSLI\0D\0A\0D\0A#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    uint UseRTGI;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}\0D\0A\0D\0Afloat2 UnpackFloats16(uint packedUint)\0D\0A{\0D\0A    uint packedX = packedUint.x & 0xFFFF;\0D\0A    uint packedY = ((packedUint.x >> 16) & 0xFFFF);\0D\0A    \0D\0A    return float2(f16tof32(packedX), f16tof32(packedY));\0D\0A}\0D\0A\0D\0Auint PackFloats16(float2 floatsToPack)\0D\0A{\0D\0A    uint radX16 = f32tof16(floatsToPack.x);\0D\0A    uint radY16 = f32tof16(floatsToPack.y);\0D\0A        \0D\0A    uint packedRadX = (radY16 << 16) | radX16;\0D\0A    \0D\0A    return packedRadX;\0D\0A}\0D\0A\0D\0Auint PackFloat3ToUint(float3 color)\0D\0A{\0D\0A    // Clamp the color values to [0, 1] and scale to the appropriate range\0D\0A    uint r = (uint) (clamp(color.r, 0.0, 1.0) * 1023.0); // 10 bits (0-1023)\0D\0A    // Human eye is more sensitive to green, so we give it more bits\0D\0A    uint g = (uint) (clamp(color.g, 0.0, 1.0) * 4095.0); // 12 bits (0-4095)\0D\0A    uint b = (uint) (clamp(color.b, 0.0, 1.0) * 1023.0); // 10 bits (0-1023)\0D\0A\0D\0A    // Pack the components into a single uint\0D\0A    return (r << 22) | (g << 10) | b;\0D\0A}\0D\0A\0D\0Afloat3 UnpackUintToFloat3(uint packedColor)\0D\0A{\0D\0A    float r = float((packedColor >> 22) & 0x3FF) / 1023.0; // Extract 10 bits and normalize\0D\0A    float g = float((packedColor >> 10) & 0xFFF) / 4095.0; // Extract 12 bits and normalize\0D\0A    float b = float(packedColor & 0x3FF) / 1023.0;         // Extract 10 bits and normalize\0D\0A\0D\0A    return float3(r, g, b);\0D\0A}\0D\0A#endif\0D\0A"}
!392 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#ifndef LIGHTING_UTIL\0D\0A#define LIGHTING_UTIL\0D\0A\0D\0A#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    float4x4 invShadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A#endif"}
!393 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!394 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09UINT ClusterCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT ClusterCount;\0D\0A\09UINT FrameCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFacePenalty\0D\0A{\0D\0A\09UINT FaceCount;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\09UINT ResetRadianceBuffers;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 LightPosition;\0D\0A\09float LightIntensity;\0D\0A\0D\0A\09XMFLOAT3 LightColor;\0D\0A\09float CloseVoxelStrength;\0D\0A\0D\0A\09float FarVoxelStrength;\0D\0A\09XMFLOAT3 pad0;\0D\0A\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT DispatchNumber;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClearBuffers\0D\0A{\0D\0A\09UINT ValueCount0;\0D\0A\09UINT ValueCount1;\0D\0A\09UINT ValueCount2;\0D\0A\09UINT ValueCount3;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLitVoxels\0D\0A{\0D\0A\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLerpRadiance\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09float accumulatedTime;\0D\0A\09float maxTime;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A\09XMUINT3 Center;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 Normal;\0D\0A\09UINT FirstDataIndex;\0D\0A\0D\0A\09XMFLOAT3 Color;\0D\0A\09UINT FragmentCount;\0D\0A\0D\0A\09XMFLOAT3 MinAABB;\0D\0A\09UINT NeighbourCount;\0D\0A\0D\0A\09XMFLOAT3 MaxAABB;\0D\0A\09float pad0;\0D\0A\0D\0A\09UINT ClusterNeighbours[64];\0D\0A};\0D\0A\0D\0Astruct ConstantBufferComputeNeighbour\0D\0A{\0D\0A\09UINT ClusterCount;\0D\0A\09UINT ElementsPerThread;\0D\0A\09UINT TotalComputationCount;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferGaussianFilter\0D\0A{\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT BlockNum;\0D\0A\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT KernelSize;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09float Sigma;\0D\0A\09UINT PassCount;\0D\0A\09UINT UsePreComputedGaussian;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRadianceFromNetwork\0D\0A{\0D\0A\09UINT ShouldReset;\0D\0A\09UINT FaceCount;\0D\0A\09UINT ReceivedFaceCount;\0D\0A\09UINT pad0;\0D\0A};\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!395 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0A#define IRRADIANCE_FIELD_MULTIPLIER 100000.0f\0D\0A#define MAX_DISTANCE_VOXEL_OFFSET 2.5f\0D\0A#define MINIMUM_ANGLE_VOXEL_OFFSET 0.342f\0D\0A\0D\0A#define CLUSTER_TO_VOXEL_FORM_FACTOR_ADD 14860\0D\0A#define VOXEL_TO_VOXEL_FORM_FACTOR_ADD 3\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutVoxelIndex\0D\0A{\0D\0A    float4 Pos : SV_Position;\0D\0A    uint VoxelIndex : VOXELINDEX;\0D\0A};\0D\0A\0D\0Astruct GeometryOutClusterIndex\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float3 normal : NORMAL;\0D\0A    float3 color : COLOR;\0D\0A    uint ClusterIndex : CLUSTERINDEX;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A    {\0D\0A        return false;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A        return all(result < gridDimension);\0D\0A    }\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0Abool ClearVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedAnd(index, ~(1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) == 0;\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 positionDA, float3 normalDB, float3 positionDB, float nSamples)\0D\0A{\0D\0A    float3 dAtoDiskDirection = positionDB - positionDA;\0D\0A    float distanceSq = dot(dAtoDiskDirection, dAtoDiskDirection);\0D\0A    dAtoDiskDirection = normalize(dAtoDiskDirection);\0D\0A    \0D\0A    float cosTheta1 = dot(normalDA, dAtoDiskDirection);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A    \0D\0A    float cosTheta2 = dot(normalDB, -dAtoDiskDirection);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    return (cosTheta1 * cosTheta2) / (PI * distanceSq + nSamples);\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 normalDB)\0D\0A{\0D\0A    float cosTheta1 = dot(normalDA, -normalDB);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A\0D\0A    float cosTheta2 = dot(normalDB, normalDB);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    // Avoid using distanceSq for directional lights as it is theoretically infinite\0D\0A    return (cosTheta1 * cosTheta2) / (PI * 1.0f);\0D\0A}\0D\0A\0D\0Afloat distanceSq(float3 a, float3 b)\0D\0A{\0D\0A    return dot(a - b, a - b);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!396 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!397 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5CRaytracingShadow.hlsl"}
!398 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDRGitTest\5CDistributed_Rendering\5CVoxelUtils\5CShaders\5C/../Data/Shaders/RaytracingShadow.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!399 = !{i32 1, i32 5}
!400 = !{i32 1, i32 6}
!401 = !{!"lib", i32 6, i32 5}
!402 = !{!403, !411, !415, null}
!403 = !{!404, !406, !408, !410}
!404 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !405}
!405 = !{i32 0, i32 4}
!406 = !{i32 1, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", !"gVoxelHashedCompactBuffer", i32 1, i32 3, i32 1, i32 12, i32 0, !407}
!407 = !{i32 1, i32 4}
!408 = !{i32 2, %"class.StructuredBuffer<ClusterData>"* @"\01?gClusterDataBuffer@@3V?$StructuredBuffer@UClusterData@@@@A", !"gClusterDataBuffer", i32 2, i32 0, i32 1, i32 12, i32 0, !409}
!409 = !{i32 1, i32 336}
!410 = !{i32 3, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentMap@@3V?$StructuredBuffer@I@@A", !"gVoxelAssignmentMap", i32 2, i32 2, i32 1, i32 12, i32 0, !407}
!411 = !{!412, !413}
!412 = !{i32 0, %struct.RWByteAddressBuffer* @"\01?gVoxelLitBuffer@@3URWByteAddressBuffer@@A", !"gVoxelLitBuffer", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!413 = !{i32 1, %"class.RWStructuredBuffer<vector<unsigned int, 4> >"* @"\01?gClusterLitBuffer@@3V?$RWStructuredBuffer@V?$vector@I$03@@@@A", !"gClusterLitBuffer", i32 0, i32 1, i32 1, i32 12, i1 false, i1 false, i1 false, !414}
!414 = !{i32 1, i32 16}
!415 = !{!416, !417}
!416 = !{i32 0, %hostlayout.cbVoxelCommons* @cbVoxelCommons_legacy, !"cbVoxelCommons", i32 0, i32 0, i32 1, i32 224, null}
!417 = !{i32 1, %cbRaytracingShadows* @cbRaytracingShadows, !"cbRaytracingShadows", i32 0, i32 1, i32 1, i32 32, null}
!418 = !{i32 0, %struct.PBRMaterial undef, !419, %struct.GenericMaterial undef, !425, %struct.PhongMaterial undef, !434, %struct.SurfaceData undef, !442, %struct.Light undef, !448, %struct.ConstantBufferVoxelCommons undef, !462, %struct.ConstantBufferRTShadows undef, !477, %"class.StructuredBuffer<unsigned int>" undef, !484, %"class.StructuredBuffer<ClusterData>" undef, !489, %struct.ClusterData undef, !494, %"class.StructuredBuffer<vector<float, 3> >" undef, !506, %"class.RWStructuredBuffer<vector<unsigned int, 4> >" undef, !511, %struct.RayDesc undef, !515, %struct.Payload undef, !520, %struct.Attributes undef, !520, %cbRaytracingShadows undef, !522, %hostlayout.struct.ConstantBufferVoxelCommons undef, !462, %hostlayout.cbVoxelCommons undef, !524}
!419 = !{i32 44, !420, !421, !422, !423, !424}
!420 = !{i32 6, !"baseColor", i32 3, i32 0, i32 7, i32 9}
!421 = !{i32 6, !"emissiveColor", i32 3, i32 16, i32 7, i32 9}
!422 = !{i32 6, !"metallic", i32 3, i32 32, i32 7, i32 9}
!423 = !{i32 6, !"roughness", i32 3, i32 36, i32 7, i32 9}
!424 = !{i32 6, !"normalScale", i32 3, i32 40, i32 7, i32 9}
!425 = !{i32 80, !426, !427, !428, !429, !430, !431, !432, !433}
!426 = !{i32 6, !"float4_0", i32 3, i32 0, i32 7, i32 9}
!427 = !{i32 6, !"float4_1", i32 3, i32 16, i32 7, i32 9}
!428 = !{i32 6, !"float4_2", i32 3, i32 32, i32 7, i32 9}
!429 = !{i32 6, !"float4_3", i32 3, i32 48, i32 7, i32 9}
!430 = !{i32 6, !"float_0", i32 3, i32 64, i32 7, i32 9}
!431 = !{i32 6, !"float_1", i32 3, i32 68, i32 7, i32 9}
!432 = !{i32 6, !"float_2", i32 3, i32 72, i32 7, i32 9}
!433 = !{i32 6, !"float_3", i32 3, i32 76, i32 7, i32 9}
!434 = !{i32 80, !435, !421, !436, !437, !438, !439, !440, !441}
!435 = !{i32 6, !"diffuseColor", i32 3, i32 0, i32 7, i32 9}
!436 = !{i32 6, !"specularColor", i32 3, i32 32, i32 7, i32 9}
!437 = !{i32 6, !"ambientColor", i32 3, i32 48, i32 7, i32 9}
!438 = !{i32 6, !"normalScale", i32 3, i32 64, i32 7, i32 9}
!439 = !{i32 6, !"opacity", i32 3, i32 68, i32 7, i32 9}
!440 = !{i32 6, !"shininess", i32 3, i32 72, i32 7, i32 9}
!441 = !{i32 6, !"refractiveIndex", i32 3, i32 76, i32 7, i32 9}
!442 = !{i32 60, !443, !444, !445, !446, !447}
!443 = !{i32 6, !"N", i32 3, i32 0, i32 7, i32 9}
!444 = !{i32 6, !"V", i32 3, i32 16, i32 7, i32 9}
!445 = !{i32 6, !"NdotV", i32 3, i32 28, i32 7, i32 9}
!446 = !{i32 6, !"c_diff", i32 3, i32 32, i32 7, i32 9}
!447 = !{i32 6, !"c_spec", i32 3, i32 48, i32 7, i32 9}
!448 = !{i32 192, !449, !450, !451, !452, !453, !454, !455, !457, !458, !459, !460, !461}
!449 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!450 = !{i32 6, !"fallOffStart", i32 3, i32 12, i32 7, i32 9}
!451 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!452 = !{i32 6, !"fallOffEnd", i32 3, i32 28, i32 7, i32 9}
!453 = !{i32 6, !"position", i32 3, i32 32, i32 7, i32 9}
!454 = !{i32 6, !"spotPower", i32 3, i32 44, i32 7, i32 9}
!455 = !{i32 6, !"shadowMatrix", i32 2, !456, i32 3, i32 48, i32 7, i32 9}
!456 = !{i32 4, i32 4, i32 2}
!457 = !{i32 6, !"invShadowMatrix", i32 2, !456, i32 3, i32 112, i32 7, i32 9}
!458 = !{i32 6, !"castShadows", i32 3, i32 176, i32 7, i32 4}
!459 = !{i32 6, !"_pad0", i32 3, i32 180, i32 7, i32 9}
!460 = !{i32 6, !"_pad1", i32 3, i32 184, i32 7, i32 9}
!461 = !{i32 6, !"_pad2", i32 3, i32 188, i32 7, i32 9}
!462 = !{i32 224, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!463 = !{i32 6, !"voxelTextureDimensions", i32 3, i32 0, i32 7, i32 5}
!464 = !{i32 6, !"totalTime", i32 3, i32 12, i32 7, i32 9}
!465 = !{i32 6, !"voxelCellSize", i32 3, i32 16, i32 7, i32 9}
!466 = !{i32 6, !"deltaTime", i32 3, i32 28, i32 7, i32 9}
!467 = !{i32 6, !"invVoxelTextureDimensions", i32 3, i32 32, i32 7, i32 9}
!468 = !{i32 6, !"StoreData", i32 3, i32 44, i32 7, i32 5}
!469 = !{i32 6, !"invVoxelCellSize", i32 3, i32 48, i32 7, i32 9}
!470 = !{i32 6, !"VoxelCount", i32 3, i32 60, i32 7, i32 5}
!471 = !{i32 6, !"SceneAABBMin", i32 3, i32 64, i32 7, i32 9}
!472 = !{i32 6, !"ClusterCount", i32 3, i32 76, i32 7, i32 5}
!473 = !{i32 6, !"SceneAABBMax", i32 3, i32 80, i32 7, i32 9}
!474 = !{i32 6, !"pad3", i32 3, i32 92, i32 7, i32 9}
!475 = !{i32 6, !"VoxelToWorld", i32 2, !456, i32 3, i32 96, i32 7, i32 9}
!476 = !{i32 6, !"WorldToVoxel", i32 2, !456, i32 3, i32 160, i32 7, i32 9}
!477 = !{i32 32, !478, !479, !480, !481, !482, !483}
!478 = !{i32 6, !"LightDirection", i32 3, i32 0, i32 7, i32 9}
!479 = !{i32 6, !"FaceCount", i32 3, i32 12, i32 7, i32 5}
!480 = !{i32 6, !"CurrentStep", i32 3, i32 16, i32 7, i32 5}
!481 = !{i32 6, !"VoxelCount", i32 3, i32 20, i32 7, i32 5}
!482 = !{i32 6, !"ClusterCount", i32 3, i32 24, i32 7, i32 5}
!483 = !{i32 6, !"FrameCount", i32 3, i32 28, i32 7, i32 5}
!484 = !{i32 4, !485, !486}
!485 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!486 = !{i32 0, !487}
!487 = !{!488}
!488 = !{i32 0, i32 undef}
!489 = !{i32 1092, !490, !491}
!490 = !{i32 6, !"h", i32 3, i32 0}
!491 = !{i32 0, !492}
!492 = !{!493}
!493 = !{i32 0, %struct.ClusterData undef}
!494 = !{i32 1092, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!495 = !{i32 6, !"Center", i32 3, i32 0, i32 7, i32 5}
!496 = !{i32 6, !"VoxelCount", i32 3, i32 12, i32 7, i32 5}
!497 = !{i32 6, !"Normal", i32 3, i32 16, i32 7, i32 9}
!498 = !{i32 6, !"FirstDataIndex", i32 3, i32 28, i32 7, i32 5}
!499 = !{i32 6, !"Color", i32 3, i32 32, i32 7, i32 9}
!500 = !{i32 6, !"FragmentCount", i32 3, i32 44, i32 7, i32 5}
!501 = !{i32 6, !"MinAABB", i32 3, i32 48, i32 7, i32 9}
!502 = !{i32 6, !"NeighbourCount", i32 3, i32 60, i32 7, i32 5}
!503 = !{i32 6, !"MaxAABB", i32 3, i32 64, i32 7, i32 9}
!504 = !{i32 6, !"pad0", i32 3, i32 76, i32 7, i32 9}
!505 = !{i32 6, !"ClusterNeighbours", i32 3, i32 80, i32 7, i32 5}
!506 = !{i32 12, !507, !508}
!507 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!508 = !{i32 0, !509}
!509 = !{!510}
!510 = !{i32 0, <3 x float> undef}
!511 = !{i32 16, !485, !512}
!512 = !{i32 0, !513}
!513 = !{!514}
!514 = !{i32 0, <4 x i32> undef}
!515 = !{i32 32, !516, !517, !518, !519}
!516 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!517 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!518 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!519 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!520 = !{i32 4, !521}
!521 = !{i32 6, !"voxelIdx", i32 3, i32 0, i32 7, i32 5}
!522 = !{i32 32, !523}
!523 = !{i32 6, !"cbRaytracingShadows", i32 3, i32 0}
!524 = !{i32 224, !525}
!525 = !{i32 6, !"cbVoxelCommons", i32 3, i32 0}
!526 = !{i32 1, void ()* @"\01?ShadowRaygen@@YAXXZ", !527, void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !529, void ()* @"\01?ShadowIntersection@@YAXXZ", !527}
!527 = !{!528}
!528 = !{i32 1, !2, !2}
!529 = !{!528, !530}
!530 = !{i32 2, !2, !2}
!531 = !{null, !"", null, !402, !532}
!532 = !{i32 0, i64 65553}
!533 = !{void ()* @"\01?ShadowIntersection@@YAXXZ", !"\01?ShadowIntersection@@YAXXZ", null, null, !534}
!534 = !{i32 8, i32 8, i32 5, !535}
!535 = !{i32 0}
!536 = !{void (%struct.Payload*)* @"\01?ShadowMiss@@YAXUPayload@@@Z", !"\01?ShadowMiss@@YAXUPayload@@@Z", null, null, !537}
!537 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !535}
!538 = !{void ()* @"\01?ShadowRaygen@@YAXXZ", !"\01?ShadowRaygen@@YAXXZ", null, null, !539}
!539 = !{i32 8, i32 7, i32 5, !535}
!540 = !DILocation(line: 161, column: 31, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 160, column: 9)
!542 = distinct !DILexicalBlock(scope: !543, file: !1, line: 159, column: 13)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 156, column: 5)
!544 = distinct !DILexicalBlock(scope: !267, file: !1, line: 155, column: 9)
!545 = !DILocation(line: 165, column: 43, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 164, column: 13)
!547 = distinct !DILexicalBlock(scope: !541, file: !1, line: 163, column: 17)
!548 = !DILocation(line: 105, column: 50, scope: !267)
!549 = !DILocation(line: 143, column: 9, scope: !550)
!550 = distinct !DILexicalBlock(scope: !551, file: !1, line: 138, column: 5)
!551 = distinct !DILexicalBlock(scope: !552, file: !1, line: 137, column: 5)
!552 = distinct !DILexicalBlock(scope: !267, file: !1, line: 137, column: 5)
!553 = !DILocation(line: 172, column: 32, scope: !546)
!554 = !DILocation(line: 157, column: 5, scope: !227, inlinedAt: !555)
!555 = distinct !DILocation(line: 157, column: 30, scope: !543)
!556 = !DILocation(line: 83, column: 25, scope: !267)
!557 = !DILocation(line: 83, column: 11, scope: !267)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchIdx", scope: !267, file: !1, line: 83, type: !50)
!559 = !DIExpression(DW_OP_bit_piece, 0, 32)
!560 = !DIExpression(DW_OP_bit_piece, 32, 32)
!561 = !DIExpression(DW_OP_bit_piece, 64, 32)
!562 = !DILocation(line: 84, column: 25, scope: !267)
!563 = !DILocation(line: 84, column: 11, scope: !267)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchDim", scope: !267, file: !1, line: 84, type: !50)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDirectionPos", scope: !267, file: !1, line: 86, type: !566)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 288, align: 32, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 3)
!569 = !DILocation(line: 86, column: 12, scope: !267)
!570 = !{i32 0, i32 96, i32 3}
!571 = !{i32 32, i32 96, i32 3}
!572 = !{i32 64, i32 96, i32 3}
!573 = !DILocation(line: 87, column: 5, scope: !267)
!574 = !DILocation(line: 93, column: 22, scope: !267)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gridDimension", arg: 2, scope: !209, file: !206, line: 97, type: !50)
!576 = !DILocation(line: 97, column: 41, scope: !209, inlinedAt: !577)
!577 = distinct !DILocation(line: 93, column: 22, scope: !267)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coord3", arg: 1, scope: !209, file: !206, line: 97, type: !50)
!579 = !DILocation(line: 97, column: 27, scope: !209, inlinedAt: !577)
!580 = !DILocation(line: 100, column: 22, scope: !209, inlinedAt: !577)
!581 = !DILocation(line: 99, column: 22, scope: !209, inlinedAt: !577)
!582 = !DILocation(line: 101, column: 22, scope: !209, inlinedAt: !577)
!583 = !DILocation(line: 101, column: 40, scope: !209, inlinedAt: !577)
!584 = !DILocation(line: 100, column: 40, scope: !209, inlinedAt: !577)
!585 = !DILocation(line: 99, column: 5, scope: !209, inlinedAt: !577)
!586 = !DILocation(line: 93, column: 10, scope: !267)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "linearIdx", scope: !267, file: !1, line: 93, type: !48)
!588 = !DIExpression()
!589 = !DILocation(line: 95, column: 42, scope: !590)
!590 = distinct !DILexicalBlock(scope: !267, file: !1, line: 95, column: 9)
!591 = !DILocation(line: 95, column: 19, scope: !590)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outVal", scope: !227, file: !206, line: 155, type: !48)
!593 = !DILocation(line: 155, column: 10, scope: !227, inlinedAt: !555)
!594 = !DILocation(line: 95, column: 9, scope: !267)
!595 = !DILocation(line: 96, column: 9, scope: !590)
!596 = !DILocation(line: 99, column: 34, scope: !267)
!597 = !DILocation(line: 99, column: 44, scope: !267)
!598 = !DILocation(line: 99, column: 28, scope: !267)
!599 = !DILocation(line: 99, column: 10, scope: !267)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelIdx", scope: !267, file: !1, line: 99, type: !48)
!601 = !DILocation(line: 100, column: 30, scope: !267)
!602 = !DILocation(line: 100, column: 10, scope: !267)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceIdx", scope: !267, file: !1, line: 100, type: !48)
!604 = !DILocation(line: 102, column: 22, scope: !267)
!605 = !DILocation(line: 102, column: 12, scope: !267)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDir", scope: !267, file: !1, line: 102, type: !40)
!607 = !DILocation(line: 103, column: 46, scope: !267)
!608 = !DILocation(line: 103, column: 25, scope: !267)
!609 = !DILocation(line: 103, column: 21, scope: !267)
!610 = !DILocation(line: 103, column: 16, scope: !267)
!611 = !DILocation(line: 103, column: 13, scope: !267)
!612 = !DILocation(line: 105, column: 102, scope: !267)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gridDimension", arg: 2, scope: !205, file: !206, line: 88, type: !50)
!614 = !DILocation(line: 88, column: 53, scope: !205, inlinedAt: !615)
!615 = distinct !DILocation(line: 105, column: 33, scope: !267)
!616 = !DILocation(line: 105, column: 33, scope: !267)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "voxelLinearCoord", arg: 1, scope: !205, file: !206, line: 88, type: !48)
!618 = !DILocation(line: 88, column: 29, scope: !205, inlinedAt: !615)
!619 = !DILocation(line: 91, column: 40, scope: !205, inlinedAt: !615)
!620 = !DILocation(line: 91, column: 21, scope: !205, inlinedAt: !615)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "voxelPosition", scope: !205, file: !206, line: 90, type: !50)
!622 = !DILocation(line: 90, column: 11, scope: !205, inlinedAt: !615)
!623 = !DILocation(line: 92, column: 41, scope: !205, inlinedAt: !615)
!624 = !DILocation(line: 92, column: 60, scope: !205, inlinedAt: !615)
