#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Raytracing tier 1.1 features
;
; shader debug name: 5bc961d62c22a4a3ee08d472bd4fd615.pdb
; shader hash: 5bc961d62c22a4a3ee08d472bd4fd615
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.RTSceneVisibility
;       {
;
;           float pad0;                               ; Offset:    0
;           float pad1;                               ; Offset:    4
;           float pad2;                               ; Offset:    8
;           uint FaceCount;                           ; Offset:   12
;           uint3 GridDimension;                      ; Offset:   16
;           uint CurrentPhase;                        ; Offset:   28
;           uint BlasCount;                           ; Offset:   32
;           uint GeometryCount;                       ; Offset:   36
;           float Rand1;                              ; Offset:   40
;           float Rand2;                              ; Offset:   44
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:    48
;
; }
;
; Resource bind info for gVoxelHashedCompactBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gVoxelAssignmentBuffer
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !81, globals: !296)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !33, !40, !8, !48, !50, !58, !66, !72}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 88, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 88, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x3", file: !1, line: 123, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 3>", file: !1, line: 123, size: 192, align: 32, elements: !24, templateParams: !31)
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!31 = !{!18, !32, !21}
!32 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 88, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 88, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!18, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 88, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 88, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!18, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 87, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 157, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 157, size: 96, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 157, baseType: !49, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!57, !47}
!57 = !DITemplateTypeParameter(name: "element", type: !49)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 102, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 102, size: 96, align: 32, elements: !60, templateParams: !64)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !59, file: !1, line: 102, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!64 = !{!65, !47}
!65 = !DITemplateTypeParameter(name: "element", type: !20)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 242, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 242, size: 64, align: 32, elements: !68, templateParams: !71)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !1, line: 242, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !1, line: 242, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!71 = !{!57, !39}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !74, templateParams: !79)
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !73, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !73, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !73, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !73, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!79 = !{!18, !80}
!80 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!81 = !{!82, !103, !116, !119, !122, !125, !128, !129, !139, !178, !181, !184, !187, !188, !189, !192, !199, !202, !205, !208, !211, !215, !218, !222, !226, !230, !233, !234, !237, !238, !241, !244, !245, !254, !255, !258, !267, !270, !273, !276, !279, !282, !292, !293}
!82 = !DISubprogram(name: "GetPBRMaterial", linkageName: "\01?GetPBRMaterial@@YA?AUPBRMaterial@@UGenericMaterial@@@Z", scope: !83, file: !83, line: 59, type: !84, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !93}
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBRMaterial", file: !83, line: 36, size: 352, align: 32, elements: !87)
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "baseColor", scope: !86, file: !83, line: 38, baseType: !72, size: 128, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !86, file: !83, line: 39, baseType: !72, size: 128, align: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !86, file: !83, line: 41, baseType: !8, size: 32, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !86, file: !83, line: 42, baseType: !8, size: 32, align: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !86, file: !83, line: 43, baseType: !8, size: 32, align: 32, offset: 320)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericMaterial", file: !83, line: 22, size: 640, align: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "float4_0", scope: !93, file: !83, line: 24, baseType: !72, size: 128, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "float4_1", scope: !93, file: !83, line: 25, baseType: !72, size: 128, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "float4_2", scope: !93, file: !83, line: 26, baseType: !72, size: 128, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "float4_3", scope: !93, file: !83, line: 27, baseType: !72, size: 128, align: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "float_0", scope: !93, file: !83, line: 29, baseType: !8, size: 32, align: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "float_1", scope: !93, file: !83, line: 30, baseType: !8, size: 32, align: 32, offset: 544)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "float_2", scope: !93, file: !83, line: 31, baseType: !8, size: 32, align: 32, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "float_3", scope: !93, file: !83, line: 32, baseType: !8, size: 32, align: 32, offset: 608)
!103 = !DISubprogram(name: "GetPhongMaterial", linkageName: "\01?GetPhongMaterial@@YA?AUPhongMaterial@@UGenericMaterial@@@Z", scope: !83, file: !83, line: 73, type: !104, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !93}
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhongMaterial", file: !83, line: 46, size: 640, align: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseColor", scope: !106, file: !83, line: 48, baseType: !72, size: 128, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "emissiveColor", scope: !106, file: !83, line: 49, baseType: !72, size: 128, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "specularColor", scope: !106, file: !83, line: 50, baseType: !72, size: 128, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ambientColor", scope: !106, file: !83, line: 51, baseType: !72, size: 128, align: 32, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "normalScale", scope: !106, file: !83, line: 53, baseType: !8, size: 32, align: 32, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !106, file: !83, line: 54, baseType: !8, size: 32, align: 32, offset: 544)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !106, file: !83, line: 55, baseType: !8, size: 32, align: 32, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "refractiveIndex", scope: !106, file: !83, line: 56, baseType: !8, size: 32, align: 32, offset: 608)
!116 = !DISubprogram(name: "CalculateTBN", linkageName: "\01?CalculateTBN@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@0V?$vector@M$01@@@Z", scope: !83, file: !83, line: 115, type: !117, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!117 = !DISubroutineType(types: !118)
!118 = !{!4, !40, !40, !33}
!119 = !DISubprogram(name: "ComputeTwoChannelNormal", linkageName: "\01?ComputeTwoChannelNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !83, file: !83, line: 131, type: !120, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!120 = !DISubroutineType(types: !121)
!121 = !{!40, !33}
!122 = !DISubprogram(name: "signNotZero", linkageName: "\01?signNotZero@@YA?AV?$vector@M$01@@V1@@Z", scope: !83, file: !83, line: 147, type: !123, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!33, !33}
!125 = !DISubprogram(name: "PackNormal", linkageName: "\01?PackNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !83, file: !83, line: 152, type: !126, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!33, !40}
!128 = !DISubprogram(name: "UnpackNormal", linkageName: "\01?UnpackNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !83, file: !83, line: 160, type: !120, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubprogram(name: "Spec", linkageName: "\01?Spec@@YAMV?$vector@M$02@@USurfaceData@@M@Z", scope: !83, file: !83, line: 169, type: !130, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!8, !40, !132, !8}
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceData", file: !83, line: 99, size: 416, align: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !132, file: !83, line: 101, baseType: !40, size: 96, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !132, file: !83, line: 102, baseType: !40, size: 96, align: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "NdotV", scope: !132, file: !83, line: 103, baseType: !8, size: 32, align: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "c_diff", scope: !132, file: !83, line: 104, baseType: !40, size: 96, align: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "c_spec", scope: !132, file: !83, line: 105, baseType: !40, size: 96, align: 32, offset: 320)
!139 = !DISubprogram(name: "ComputeDirectionalLight", linkageName: "\01?ComputeDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@MM@Z", scope: !83, file: !83, line: 178, type: !140, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!140 = !DISubroutineType(types: !141)
!141 = !{!40, !142, !132, !8, !8}
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !83, line: 6, size: 1536, align: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !173, !174, !175, !176, !177}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !142, file: !83, line: 8, baseType: !40, size: 96, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !142, file: !83, line: 9, baseType: !8, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !142, file: !83, line: 10, baseType: !40, size: 96, align: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !142, file: !83, line: 11, baseType: !8, size: 32, align: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !142, file: !83, line: 12, baseType: !40, size: 96, align: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !142, file: !83, line: 13, baseType: !8, size: 32, align: 32, offset: 352)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "shadowMatrix", scope: !142, file: !83, line: 14, baseType: !151, size: 512, align: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 175, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 175, size: 512, align: 32, elements: !153, templateParams: !170)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !152, file: !1, line: 175, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!170 = !{!18, !171, !172}
!171 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!172 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "invShadowMatrix", scope: !142, file: !83, line: 15, baseType: !151, size: 512, align: 32, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "castShadows", scope: !142, file: !83, line: 16, baseType: !20, size: 32, align: 32, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !142, file: !83, line: 17, baseType: !8, size: 32, align: 32, offset: 1440)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !142, file: !83, line: 18, baseType: !8, size: 32, align: 32, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !142, file: !83, line: 19, baseType: !8, size: 32, align: 32, offset: 1504)
!178 = !DISubprogram(name: "FresnelShlick", linkageName: "\01?FresnelShlick@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !83, file: !83, line: 199, type: !179, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false)
!179 = !DISubroutineType(types: !180)
!180 = !{!40, !40, !40, !8}
!181 = !DISubprogram(name: "Diffuse_Burley", linkageName: "\01?Diffuse_Burley@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !83, file: !83, line: 205, type: !182, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false)
!182 = !DISubroutineType(types: !183)
!183 = !{!40, !132, !8, !8, !8}
!184 = !DISubprogram(name: "Specular_D_GGX", linkageName: "\01?Specular_D_GGX@@YAMUSurfaceData@@MM@Z", scope: !83, file: !83, line: 212, type: !185, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false)
!185 = !DISubroutineType(types: !186)
!186 = !{!8, !132, !8, !8}
!187 = !DISubprogram(name: "G_Shlick_Smith_Hable", linkageName: "\01?G_Shlick_Smith_Hable@@YAMUSurfaceData@@MM@Z", scope: !83, file: !83, line: 221, type: !185, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false)
!188 = !DISubprogram(name: "Specular_BRDF", linkageName: "\01?Specular_BRDF@@YA?AV?$vector@M$02@@USurfaceData@@MMM@Z", scope: !83, file: !83, line: 226, type: !182, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false)
!189 = !DISubprogram(name: "PBRDirectionalLight", linkageName: "\01?PBRDirectionalLight@@YA?AV?$vector@M$02@@ULight@@USurfaceData@@M@Z", scope: !83, file: !83, line: 242, type: !190, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false)
!190 = !DISubroutineType(types: !191)
!191 = !{!40, !142, !132, !8}
!192 = !DISubprogram(name: "CalcShadowFactor", linkageName: "\01?CalcShadowFactor@@YAMV?$Texture2D@V?$vector@M$03@@@@V?$vector@M$03@@@Z", scope: !193, file: !193, line: 79, type: !194, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false)
!193 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!194 = !DISubroutineType(types: !195)
!195 = !{!8, !196, !72}
!196 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 259, size: 160, align: 32, elements: !2, templateParams: !197)
!197 = !{!198}
!198 = !DITemplateTypeParameter(name: "element", type: !73)
!199 = !DISubprogram(name: "UnpackFloats16", linkageName: "\01?UnpackFloats16@@YA?AV?$vector@M$01@@I@Z", scope: !193, file: !193, line: 120, type: !200, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!200 = !DISubroutineType(types: !201)
!201 = !{!33, !48}
!202 = !DISubprogram(name: "PackFloats16", linkageName: "\01?PackFloats16@@YAIV?$vector@M$01@@@Z", scope: !193, file: !193, line: 128, type: !203, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!203 = !DISubroutineType(types: !204)
!204 = !{!48, !33}
!205 = !DISubprogram(name: "PackFloat3ToUint", linkageName: "\01?PackFloat3ToUint@@YAIV?$vector@M$02@@@Z", scope: !193, file: !193, line: 138, type: !206, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false)
!206 = !DISubroutineType(types: !207)
!207 = !{!48, !40}
!208 = !DISubprogram(name: "UnpackUintToFloat3", linkageName: "\01?UnpackUintToFloat3@@YA?AV?$vector@M$02@@I@Z", scope: !193, file: !193, line: 150, type: !209, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!209 = !DISubroutineType(types: !210)
!210 = !{!40, !48}
!211 = !DISubprogram(name: "GetVoxelPosition", linkageName: "\01?GetVoxelPosition@@YA?AV?$vector@I$02@@IV1@@Z", scope: !212, file: !212, line: 88, type: !213, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!212 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!213 = !DISubroutineType(types: !214)
!214 = !{!50, !48, !50}
!215 = !DISubprogram(name: "GetLinearCoord", linkageName: "\01?GetLinearCoord@@YAIV?$vector@I$02@@0@Z", scope: !212, file: !212, line: 97, type: !216, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!216 = !DISubroutineType(types: !217)
!217 = !{!48, !50, !50}
!218 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@I$02@@V?$vector@H$02@@0@Z", scope: !212, file: !212, line: 105, type: !219, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !50, !58, !50}
!221 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!222 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIUByteAddressBuffer@@@Z", scope: !212, file: !212, line: 120, type: !223, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!223 = !DISubroutineType(types: !224)
!224 = !{!221, !48, !225}
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 118, size: 32, align: 32, elements: !2)
!226 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NIURWByteAddressBuffer@@@Z", scope: !212, file: !212, line: 131, type: !227, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!227 = !DISubroutineType(types: !228)
!228 = !{!221, !48, !229}
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 129, size: 32, align: 32, elements: !2)
!230 = !DISubprogram(name: "IsVoxelPresent", linkageName: "\01?IsVoxelPresent@@YA_NV?$vector@I$02@@0UByteAddressBuffer@@@Z", scope: !212, file: !212, line: 142, type: !231, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!231 = !DISubroutineType(types: !232)
!232 = !{!221, !50, !50, !225}
!233 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !212, file: !212, line: 148, type: !227, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!234 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NV?$vector@I$02@@0URWByteAddressBuffer@@@Z", scope: !212, file: !212, line: 162, type: !235, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false)
!235 = !DISubroutineType(types: !236)
!236 = !{!221, !50, !50, !229}
!237 = !DISubprogram(name: "ClearVoxelPresence", linkageName: "\01?ClearVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !212, file: !212, line: 169, type: !227, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!238 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@000M@Z", scope: !212, file: !212, line: 183, type: !239, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!239 = !DISubroutineType(types: !240)
!240 = !{!8, !40, !40, !40, !40, !8}
!241 = !DISubprogram(name: "differentialAreaFormFactor", linkageName: "\01?differentialAreaFormFactor@@YAMV?$vector@M$02@@0@Z", scope: !212, file: !212, line: 198, type: !242, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!242 = !DISubroutineType(types: !243)
!243 = !{!8, !40, !40}
!244 = !DISubprogram(name: "distanceSq", linkageName: "\01?distanceSq@@YAMV?$vector@M$02@@0@Z", scope: !212, file: !212, line: 210, type: !242, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NV?$vector@M$02@@0Y01V1@AIAM2@Z", scope: !246, file: !246, line: 4, type: !247, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!246 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/RaytracingUtils.hlsli", directory: "")
!247 = !DISubroutineType(types: !248)
!248 = !{!221, !40, !40, !249, !252, !252}
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, align: 32, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 2)
!252 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!254 = !DISubprogram(name: "LinearIndexToColor", linkageName: "\01?LinearIndexToColor@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 67, type: !209, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!255 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 98, type: !256, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false)
!256 = !DISubroutineType(types: !257)
!257 = !{!40}
!258 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 104, type: !259, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false)
!259 = !DISubroutineType(types: !260)
!260 = !{!40, !261, !264}
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 288, align: 32, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 3)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 101, size: 64, align: 32, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !264, file: !1, line: 101, baseType: !34, size: 64, align: 32)
!267 = !DISubprogram(name: "rand2", linkageName: "\01?rand2@@YAMV?$vector@M$01@@@Z", scope: !1, file: !1, line: 112, type: !268, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!268 = !DISubroutineType(types: !269)
!269 = !{!8, !33}
!270 = !DISubprogram(name: "ComputeOrthoBasis", linkageName: "\01?ComputeOrthoBasis@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 122, type: !271, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !40}
!273 = !DISubprogram(name: "UniformHemisphereSample", linkageName: "\01?UniformHemisphereSample@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 131, type: !274, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!274 = !DISubroutineType(types: !275)
!275 = !{!40, !8, !8}
!276 = !DISubprogram(name: "alreadyOccupiedVoxel", linkageName: "\01?alreadyOccupiedVoxel@@YA_NI@Z", scope: !1, file: !1, line: 148, type: !277, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!277 = !DISubroutineType(types: !278)
!278 = !{!221, !48}
!279 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 168, type: !280, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UAABBAttributes@@@Z", scope: !1, file: !1, line: 259, type: !283, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.AABBAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UAABBAttributes@@@Z")
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285, !289}
!285 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 62, size: 32, align: 32, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "primitiveIndex", scope: !286, file: !1, line: 64, baseType: !48, size: 32, align: 32)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABBAttributes", file: !1, line: 57, size: 32, align: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "aabbIndex", scope: !289, file: !1, line: 59, baseType: !48, size: 32, align: 32)
!292 = !DISubprogram(name: "MyIntersectionShader", linkageName: "\01?MyIntersectionShader@@YAXXZ", scope: !1, file: !1, line: 267, type: !280, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyIntersectionShader@@YAXXZ")
!293 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 292, type: !294, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!294 = !DISubroutineType(types: !295)
!295 = !{null, !285}
!296 = !{!297, !299, !300, !301, !302, !304, !306, !307, !308, !309, !311, !313, !314, !315, !316, !335, !337, !338, !341, !342, !343, !344, !345, !346, !354, !365, !366, !370, !372, !373, !374, !375, !376, !380, !382, !384}
!297 = !DIGlobalVariable(name: "PI", scope: !0, file: !83, line: 108, type: !298, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!299 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !83, line: 110, type: !298, isLocal: true, isDefinition: true, variable: float 0x3EB0C6F7A0000000)
!300 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !245, file: !246, line: 18, type: !298, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariable(name: "FLT_MAX", scope: !0, file: !1, line: 95, type: !298, isLocal: true, isDefinition: true, variable: float 0x7FF0000000000000)
!302 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 226, type: !303, isLocal: true, isDefinition: true, variable: i32 0)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!304 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !83, line: 90, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!306 = !DIGlobalVariable(name: "PI", scope: !0, file: !83, line: 108, type: !298, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !83, line: 109, type: !298, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !83, line: 110, type: !298, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !193, line: 48, type: !310, isLocal: false, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!311 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !193, line: 49, type: !312, isLocal: false, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!313 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !212, line: 15, type: !303, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariable(name: "cos30", scope: !0, file: !212, line: 16, type: !298, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariable(name: "cos25", scope: !0, file: !212, line: 17, type: !298, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@URTSceneVisibility@@@@A", scope: !0, file: !1, line: 25, type: !317, isLocal: false, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<RTSceneVisibility>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !318)
!318 = !{!319}
!319 = !DITemplateTypeParameter(name: "T", type: !320)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "RTSceneVisibility", file: !321, line: 99, size: 384, align: 32, elements: !322)
!321 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!322 = !{!323, !324, !325, !326, !329, !330, !331, !332, !333, !334}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !320, file: !321, line: 101, baseType: !8, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !320, file: !321, line: 102, baseType: !8, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !320, file: !321, line: 103, baseType: !8, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !320, file: !321, line: 104, baseType: !327, size: 32, align: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !328, line: 8, baseType: !48)
!328 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "GridDimension", scope: !320, file: !321, line: 106, baseType: !50, size: 96, align: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentPhase", scope: !320, file: !321, line: 107, baseType: !327, size: 32, align: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "BlasCount", scope: !320, file: !321, line: 109, baseType: !327, size: 32, align: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryCount", scope: !320, file: !321, line: 110, baseType: !327, size: 32, align: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Rand1", scope: !320, file: !321, line: 111, baseType: !8, size: 32, align: 32, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Rand2", scope: !320, file: !321, line: 112, baseType: !8, size: 32, align: 32, offset: 352)
!335 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 28, type: !336, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 28, size: 32, align: 32, elements: !2)
!337 = !DIGlobalVariable(name: "gVoxelOccupiedBuffer", linkageName: "\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 30, type: !225, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A")
!338 = !DIGlobalVariable(name: "gIndirectionRankBuffer", linkageName: "\01?gIndirectionRankBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 32, type: !339, isLocal: false, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !340)
!340 = !{!57}
!341 = !DIGlobalVariable(name: "gIndirectionIndexBuffer", linkageName: "\01?gIndirectionIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 33, type: !339, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariable(name: "gVoxelIndicesCompactBuffer", linkageName: "\01?gVoxelIndicesCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 34, type: !339, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariable(name: "gVoxelHashedCompactBuffer", linkageName: "\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 35, type: !339, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A")
!344 = !DIGlobalVariable(name: "gNextVoxelInClusterBuffer", linkageName: "\01?gNextVoxelInClusterBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 38, type: !339, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariable(name: "gVoxelAssignmentBuffer", linkageName: "\01?gVoxelAssignmentBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 39, type: !339, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentBuffer@@3V?$StructuredBuffer@I@@A")
!346 = !DIGlobalVariable(name: "gVoxelAABBBuffer", linkageName: "\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", scope: !0, file: !1, line: 41, type: !347, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<AABB>"* @"\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A")
!347 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AABB>", file: !1, line: 41, size: 192, align: 32, elements: !2, templateParams: !348)
!348 = !{!349}
!349 = !DITemplateTypeParameter(name: "element", type: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AABB", file: !321, line: 12, size: 192, align: 32, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !350, file: !321, line: 14, baseType: !40, size: 96, align: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !350, file: !321, line: 15, baseType: !40, size: 96, align: 32, offset: 96)
!354 = !DIGlobalVariable(name: "gClusterAABBInfoBuffer", linkageName: "\01?gClusterAABBInfoBuffer@@3V?$StructuredBuffer@UClusterAABBInfo@@@@A", scope: !0, file: !1, line: 42, type: !355, isLocal: false, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ClusterAABBInfo>", file: !1, line: 42, size: 256, align: 32, elements: !2, templateParams: !356)
!356 = !{!357}
!357 = !DITemplateTypeParameter(name: "element", type: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClusterAABBInfo", file: !321, line: 183, size: 256, align: 32, elements: !359)
!359 = !{!360, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Min", scope: !358, file: !321, line: 185, baseType: !361, size: 96, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !328, line: 4, baseType: !40)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterStartIndex", scope: !358, file: !321, line: 186, baseType: !327, size: 32, align: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Max", scope: !358, file: !321, line: 187, baseType: !361, size: 96, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterElementCount", scope: !358, file: !321, line: 188, baseType: !327, size: 32, align: 32, offset: 224)
!365 = !DIGlobalVariable(name: "gAABBVoxelIndices", linkageName: "\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 43, type: !339, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A")
!366 = !DIGlobalVariable(name: "gFaceClusterVisibility", linkageName: "\01?gFaceClusterVisibility@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 45, type: !367, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* @"\01?gFaceClusterVisibility@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A")
!367 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 45, size: 64, align: 32, elements: !2, templateParams: !368)
!368 = !{!369}
!369 = !DITemplateTypeParameter(name: "element", type: !67)
!370 = !DIGlobalVariable(name: "gVisibleClustersBuffer", linkageName: "\01?gVisibleClustersBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 47, type: !371, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<unsigned int>"* @"\01?gVisibleClustersBuffer@@3V?$RWStructuredBuffer@I@@A")
!371 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 47, size: 32, align: 32, elements: !2, templateParams: !340)
!372 = !DIGlobalVariable(name: "gGeometryStartOffset", linkageName: "\01?gGeometryStartOffset@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 50, type: !371, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<unsigned int>"* @"\01?gGeometryStartOffset@@3V?$RWStructuredBuffer@I@@A")
!373 = !DIGlobalVariable(name: "gAABBStartOffset", linkageName: "\01?gAABBStartOffset@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 51, type: !371, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<unsigned int>"* @"\01?gAABBStartOffset@@3V?$RWStructuredBuffer@I@@A")
!374 = !DIGlobalVariable(name: "gClusterCount", linkageName: "\01?gClusterCount@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 54, type: !371, isLocal: false, isDefinition: true, variable: %"class.RWStructuredBuffer<unsigned int>"* @"\01?gClusterCount@@3V?$RWStructuredBuffer@I@@A")
!375 = !DIGlobalVariable(name: "FLT_MAX", scope: !0, file: !1, line: 95, type: !298, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariable(name: "clusterFound", scope: !0, file: !1, line: 142, type: !377, isLocal: true, isDefinition: true, variable: [800 x i32]* @clusterFound)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 25600, align: 32, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 800)
!380 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !83, line: 90, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !305, size: 32, align: 4)
!382 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !83, line: 90, type: !383, isLocal: false, isDefinition: true)
!383 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !305, size: 32, align: 4, offset: 32)
!384 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !83, line: 90, type: !385, isLocal: false, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !305, size: 32, align: 4, offset: 64)
!386 = !{i32 2, !"Dwarf Version", i32 4}
!387 = !{i32 2, !"Debug Info Version", i32 3}
!388 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!389 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CRaytracing.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A#include \22RaytracingUtils.hlsli\22\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A};\0D\0A\0D\0A\0D\0AConstantBuffer<RTSceneVisibility> g_sceneCB : register(b0);\0D\0A\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A\0D\0AByteAddressBuffer gVoxelOccupiedBuffer : register(t0, space1);\0D\0A\0D\0AStructuredBuffer<uint> gIndirectionRankBuffer : register(t0, space2);\0D\0AStructuredBuffer<uint> gIndirectionIndexBuffer : register(t1, space2);\0D\0AStructuredBuffer<uint> gVoxelIndicesCompactBuffer : register(t2, space2);\0D\0AStructuredBuffer<uint> gVoxelHashedCompactBuffer : register(t3, space2);\0D\0A\0D\0A\0D\0AStructuredBuffer<uint> gNextVoxelInClusterBuffer : register(t1, space3);\0D\0AStructuredBuffer<uint> gVoxelAssignmentBuffer : register(t2, space3);\0D\0A\0D\0AStructuredBuffer<AABB> gVoxelAABBBuffer : register(t0, space4);\0D\0AStructuredBuffer<ClusterAABBInfo> gClusterAABBInfoBuffer : register(t1, space4);\0D\0AStructuredBuffer<uint> gAABBVoxelIndices : register(t2, space4);\0D\0A\0D\0ARWStructuredBuffer<uint2> gFaceClusterVisibility : register(u0);\0D\0A// Stores all the visible clusters for all the faces. Clusters visible from the same faced are stored in sequence.\0D\0ARWStructuredBuffer<uint> gVisibleClustersBuffer : register(u1);\0D\0A\0D\0A// Offset buffers used to map the raytracing primitive index to the voxel index\0D\0ARWStructuredBuffer<uint> gGeometryStartOffset : register(u2);\0D\0ARWStructuredBuffer<uint> gAABBStartOffset : register(u3);\0D\0A// For face at index i store in the x coordinate the start index in gVisibleClusterBuffer and in the y coordinate the number of visible\0D\0A// Clusters\0D\0ARWStructuredBuffer<uint> gClusterCount : register(u4);\0D\0A\0D\0A\0D\0Astruct AABBAttributes\0D\0A{\0D\0A    uint aabbIndex;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    uint primitiveIndex;\0D\0A};\0D\0A\0D\0Afloat3 LinearIndexToColor(uint index)\0D\0A{\0D\0A\0D\0A    // Hash the index to produce a pseudo-random float3 color\0D\0A    uint hash = index;\0D\0A\0D\0A    // Example hash function (based on bitwise operations)\0D\0A    hash = (hash ^ 61) ^ (hash >> 16);\0D\0A    hash = hash + (hash << 3);\0D\0A    hash = hash ^ (hash >> 4);\0D\0A    hash = hash * 0x27d4eb2d;\0D\0A    hash = hash ^ (hash >> 15);\0D\0A\0D\0A    // Convert the hash to a float3 color in the range [0, 1]\0D\0A    float r = (float) ((hash >> 16) & 0xFF) / 255.0;\0D\0A    float g = (float) ((hash >> 8) & 0xFF) / 255.0;\0D\0A    float b = (float) (hash & 0xFF) / 255.0;\0D\0A\0D\0A    if (r < 0.1 && g < 0.1 && b < 0.1)\0D\0A    {\0D\0A        r = 0.39f;\0D\0A        g = 0.39f;\0D\0A        b = 0.39f;\0D\0A    }\0D\0A    \0D\0A    return float3(r, g, b);\0D\0A}\0D\0A\0D\0Astatic const float FLT_MAX = 1.#INF;\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0A\0D\0Afloat rand2(float2 p)\0D\0A{\0D\0A    return frac(cos(dot(p, float2(23.14069263277926f, 2.665144142690225f))) * 12345.6789f);\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0Afloat3x3 ComputeOrthoBasis(float3 direction)\0D\0A{\0D\0A    float3 Z = normalize(direction); // Z-axis is the given direction\0D\0A    float3 up = abs(Z.y) < 0.999 ? float3(0, 1, 0) : float3(1, 0, 0); // Choose up vector\0D\0A    float3 X = normalize(cross(up, Z)); // X-axis is perpendicular to Z\0D\0A    float3 Y = cross(Z, X); // Y-axis is perpendicular to both X and Z\0D\0A    return float3x3(X, Y, Z); // Return the local coordinate system\0D\0A}\0D\0A\0D\0Afloat3 UniformHemisphereSample(float u1, float u2)\0D\0A{\0D\0A    float theta = acos(u1); // Theta is the polar angle\0D\0A    float phi = 2.0 * PI * u2; // Phi is the azimuth angle\0D\0A    float x = sin(theta) * cos(phi); // Convert spherical to Cartesian coordinates\0D\0A    float y = sin(theta) * sin(phi);\0D\0A    float z = cos(theta);\0D\0A    return float3(x, y, z); // Hemisphere direction\0D\0A}\0D\0A\0D\0A\0D\0Astatic uint clusterFound[800];\0D\0A\0D\0A/** Uses the shared variable array g_sharedArrayIndexBitWise to flag already verified clusters\0D\0A* and avoid counting two or more times irradiance to be added to a voxel from the same cluster\0D\0A* @param indexHashed [in] index of the cluster to tag and verify if already occupied\0D\0A* @return true if already tagged, false otherwise */\0D\0Abool alreadyOccupiedVoxel(uint indexHashed)\0D\0A{\0D\0A    float integerPart;\0D\0A    float indexDecimalFloat = float(indexHashed) / 32.0;\0D\0A    float fractional = modf(indexDecimalFloat, integerPart);\0D\0A    uint index = uint(integerPart);\0D\0A    uint bit = uint(fractional * 32.0);\0D\0A    uint value = (1 << bit);\0D\0A    \0D\0A    // I don't need a lock here because only this thread has access to clusterFound.\0D\0A    uint previousValue = clusterFound[index];\0D\0A    clusterFound[index] = previousValue | value;\0D\0A\09\0D\0A\09// Verify if the bit was previously flagged and decide for this thread\0D\0A    bool result = ((previousValue & (1 << bit)) > 0);\0D\0A\0D\0A    return result;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 faceDirection[6] =\0D\0A    {\0D\0A        float3(0.0f, 0.0f, -1.0f),\0D\0A        float3(0.0f, 0.0f, 1.0f),\0D\0A        float3(-1.0f, 0.0f, 0.0f),\0D\0A        float3(1.0f, 0.0f, 0.0f),\0D\0A        float3(0.0f, -1.0f, 0.0f),\0D\0A        float3(0.0f, 1.0f, 0.0f),\0D\0A    };\0D\0A        \0D\0A    uint3 dispatchId = DispatchRaysIndex();\0D\0A    uint3 dispatchDim = DispatchRaysDimensions();\0D\0A    \0D\0A    uint linearIndex = dispatchId.x + dispatchId.y * dispatchDim.x + dispatchId.z * dispatchDim.x * dispatchDim.y;\0D\0A    \0D\0A    if (linearIndex >= g_sceneCB.FaceCount)\0D\0A        return;\0D\0A    \0D\0A    uint voxelIndex = (uint) floor(linearIndex / 6.0f);\0D\0A    uint faceIdx = linearIndex % 6;\0D\0A    \0D\0A    float3 voxelCoord = float3(GetVoxelPosition(gVoxelHashedCompactBuffer[voxelIndex], g_sceneCB.GridDimension));\0D\0A    \0D\0A    float3 neighbourCoord = voxelCoord + faceDirection[faceIdx];\0D\0A    \0D\0A    \0D\0A    \0D\0A    bool isOutOfBounds = any(neighbourCoord < 0.0f) || any(neighbourCoord >= g_sceneCB.GridDimension);\0D\0A    bool isOccupied = IsVoxelPresent(uint3(neighbourCoord), g_sceneCB.GridDimension, gVoxelOccupiedBuffer);\0D\0A    \0D\0A    uint visibleClusterCount = 0;\0D\0A    \0D\0A    if (!isOutOfBounds && !isOccupied)\0D\0A    {\0D\0A        // Compute the orthonormal basis\0D\0A        float3x3 basis = ComputeOrthoBasis(faceDirection[faceIdx]);\0D\0A    \0D\0A        // Define ray starting position and other parameters\0D\0A        RayDesc ray;\0D\0A        ray.Origin = voxelCoord + faceDirection[faceIdx] / 2.0f; /* define ray origin (e.g., surface point) */;\0D\0A        ray.TMin = 0.001; // Start the ray slightly away from the origin\0D\0A        ray.TMax = FLT_MAX; // Max distance for the ray\0D\0A        RayPayload payload = { -1 }; // Payload to store the color\0D\0A    \0D\0A\0D\0A    \0D\0A        // Trace the ray\0D\0A        for (uint i = 0; i < 128; i++)\0D\0A        {\0D\0A            float div = i / 128.0f;\0D\0A            float u1 = rand2(float2(g_sceneCB.Rand1, div));\0D\0A            float u2 = rand2(float2(div, g_sceneCB.Rand2));\0D\0A            float3 localHemisphereRay = UniformHemisphereSample(u1, u2);\0D\0A            // Transform the ray direction to world space\0D\0A            float3 worldHemisphereRay = mul(localHemisphereRay, basis);\0D\0A            ray.Direction = normalize(worldHemisphereRay);\0D\0A            TraceRay(Scene, RAY_FLAG_NONE, ~0, 0, 0, 0, ray, payload);\0D\0A        \0D\0A            if (payload.primitiveIndex == -1)\0D\0A                continue;\0D\0A        \0D\0A            uint clusterIndex = gVoxelAssignmentBuffer[payload.primitiveIndex];\0D\0A        \0D\0A            if (clusterIndex == -1)\0D\0A                continue;\0D\0A        \0D\0A            // Add the cluster only if it is not already in the list\0D\0A            uint isNewCluster = 1 - (uint) alreadyOccupiedVoxel(clusterIndex);\0D\0A\0D\0A        \0D\0A            if (g_sceneCB.CurrentPhase == 1 && isNewCluster == 1)\0D\0A            {\0D\0A                uint2 faceClusterVisibility = gFaceClusterVisibility[voxelIndex * 6 + faceIdx];\0D\0A                gVisibleClustersBuffer[faceClusterVisibility.x + visibleClusterCount] = clusterIndex;\0D\0A            }\0D\0A        \0D\0A            visibleClusterCount += isNewCluster;\0D\0A        }\0D\0A    }\0D\0A\0D\0A    if (g_sceneCB.CurrentPhase == 0)\0D\0A    {\0D\0A        uint startIndex = 0;\0D\0A        InterlockedAdd(gClusterCount[0], visibleClusterCount, startIndex);\0D\0A        gFaceClusterVisibility[voxelIndex * 6 + faceIdx] = uint2(startIndex, visibleClusterCount);\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in AABBAttributes attr)\0D\0A{\0D\0A    uint idx = gAABBVoxelIndices[attr.aabbIndex];;\0D\0A    \0D\0A    payload.primitiveIndex = idx;\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid MyIntersectionShader()\0D\0A{\0D\0A    uint idx = gGeometryStartOffset[InstanceIndex()];\0D\0A    idx += GeometryIndex();\0D\0A    \0D\0A    idx = gAABBStartOffset[idx] + PrimitiveIndex();\0D\0A    \0D\0A    AABB aabb = gVoxelAABBBuffer[idx];\0D\0A\0D\0A    float3 aabbs[2] = { aabb.Min, aabb.Max };\0D\0A\0D\0A    float tMin;\0D\0A    float tMax;\0D\0A    \0D\0A    // Perform AABB intersection test\0D\0A    if (RayAABBIntersectionTest(WorldRayOrigin(), WorldRayDirection(), aabbs, tMin, tMax))\0D\0A    {\0D\0A        AABBAttributes attr;\0D\0A        attr.aabbIndex = idx;\0D\0A        \0D\0A        ReportHit(tMin, 0, attr); // Report the hit with hitT as tMin\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.0f, 0.0f, 0.0f, 0.0f);\0D\0A    payload.primitiveIndex = -1;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!390 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", !"#ifndef COMMON_HLSLI\0D\0A#define COMMON_HLSLI\0D\0A\0D\0A#include \22LightingUtil.hlsli\22\0D\0A\0D\0Astruct Commons\0D\0A{\0D\0A    float2 RenderTargetSize;\0D\0A    float2 InvRenderTargetSize;\0D\0A\0D\0A    float TotalTime;\0D\0A    float DeltaTime;\0D\0A    int NumLights;\0D\0A    uint UseRTGI;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A    float4x4 View;\0D\0A    float4x4 InvView;\0D\0A    float4x4 Proj;\0D\0A    float4x4 InvProj;\0D\0A    float4x4 ViewProj;\0D\0A    float4x4 InvViewProj;\0D\0A    \0D\0A    float3 EyePos;\0D\0A    float NearPlane;\0D\0A    \0D\0A    float FarPlane;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct Object\0D\0A{\0D\0A    float4x4 World;\0D\0A    float4x4 InvWorld;\0D\0A    float4x4 TexTransform;\0D\0A    \0D\0A    uint MaterialIndex;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0A\0D\0ASamplerState gSampler : register(s0);\0D\0ASamplerComparisonState gShadowSampler : register(s1);\0D\0A\0D\0Astruct VertexInPosNormalTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float3 NormalL : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosNormalTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexInPosTex\0D\0A{\0D\0A    float3 PosL : SV_Position;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutPosTex\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float2 Tex : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Afloat CalcShadowFactor(Texture2D shadowMap, float4 shadowPosH)\0D\0A{\0D\0A    // Complete projection by doing division by w.\0D\0A    shadowPosH.xyz /= shadowPosH.w;\0D\0A\0D\0A    // Depth in NDC space.\0D\0A    float depth = shadowPosH.z;\0D\0A\0D\0A    uint width, height, numMips;\0D\0A    shadowMap.GetDimensions(0, width, height, numMips);\0D\0A\0D\0A    // Texel size.\0D\0A    float dx = 1.0f / (float) width;\0D\0A    float dy = 1.0f / (float) height;\0D\0A\0D\0A    float percentLit = 0.0f;\0D\0A\0D\0A    // Use different offsets for different quality levels\0D\0A    float2 offsets[9] =\0D\0A    {\0D\0A        float2(-1.0f * dx, -1.0f * dy), float2(0.0f * dx, -1.0f * dy), float2(1.0f * dx, -1.0f * dy),\0D\0A        float2(-1.0f * dx, 0.0f * dy), float2(0.0f * dx, 0.0f * dy), float2(1.0f * dx, 0.0f * dy),\0D\0A        float2(-1.0f * dx, 1.0f * dy), float2(0.0f * dx, 1.0f * dy), float2(1.0f * dx, 1.0f * dy)\0D\0A    };\0D\0A\0D\0A    [unroll]\0D\0A    for (int i = 0; i < 9; ++i)\0D\0A    {\0D\0A        float2 shadowPosOffset = shadowPosH.xy + offsets[i];\0D\0A\0D\0A        // Hack to remove shadowmap edge artifacts\0D\0A        if (shadowPosOffset.x <= 0.01f || shadowPosOffset.x >= 0.99f || shadowPosOffset.y <= 0.01f || shadowPosOffset.y >= 0.99f)\0D\0A            continue;\0D\0A\0D\0A        percentLit += shadowMap.SampleCmpLevelZero(gShadowSampler,\0D\0A        shadowPosOffset, depth).r;\0D\0A    }\0D\0A\0D\0A    return percentLit / 9.0f;\0D\0A}\0D\0A\0D\0Afloat2 UnpackFloats16(uint packedUint)\0D\0A{\0D\0A    uint packedX = packedUint.x & 0xFFFF;\0D\0A    uint packedY = ((packedUint.x >> 16) & 0xFFFF);\0D\0A    \0D\0A    return float2(f16tof32(packedX), f16tof32(packedY));\0D\0A}\0D\0A\0D\0Auint PackFloats16(float2 floatsToPack)\0D\0A{\0D\0A    uint radX16 = f32tof16(floatsToPack.x);\0D\0A    uint radY16 = f32tof16(floatsToPack.y);\0D\0A        \0D\0A    uint packedRadX = (radY16 << 16) | radX16;\0D\0A    \0D\0A    return packedRadX;\0D\0A}\0D\0A\0D\0Auint PackFloat3ToUint(float3 color)\0D\0A{\0D\0A    // Clamp the color values to [0, 1] and scale to the appropriate range\0D\0A    uint r = (uint) (clamp(color.r, 0.0, 1.0) * 1023.0); // 10 bits (0-1023)\0D\0A    // Human eye is more sensitive to green, so we give it more bits\0D\0A    uint g = (uint) (clamp(color.g, 0.0, 1.0) * 4095.0); // 12 bits (0-4095)\0D\0A    uint b = (uint) (clamp(color.b, 0.0, 1.0) * 1023.0); // 10 bits (0-1023)\0D\0A\0D\0A    // Pack the components into a single uint\0D\0A    return (r << 22) | (g << 10) | b;\0D\0A}\0D\0A\0D\0Afloat3 UnpackUintToFloat3(uint packedColor)\0D\0A{\0D\0A    float r = float((packedColor >> 22) & 0x3FF) / 1023.0; // Extract 10 bits and normalize\0D\0A    float g = float((packedColor >> 10) & 0xFFF) / 4095.0; // Extract 12 bits and normalize\0D\0A    float b = float(packedColor & 0x3FF) / 1023.0;         // Extract 10 bits and normalize\0D\0A\0D\0A    return float3(r, g, b);\0D\0A}\0D\0A#endif\0D\0A"}
!391 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5C..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CLightingUtil.hlsli", !"#ifndef LIGHTING_UTIL\0D\0A#define LIGHTING_UTIL\0D\0A\0D\0A#define MAX_LIGHTS 16\0D\0A\0D\0Astruct Light\0D\0A{\0D\0A    float3 color;\0D\0A    float fallOffStart;\0D\0A    float3 direction;\0D\0A    float fallOffEnd;\0D\0A    float3 position;\0D\0A    float spotPower;\0D\0A    float4x4 shadowMatrix;\0D\0A    float4x4 invShadowMatrix;\0D\0A    int castShadows;\0D\0A    float _pad0;\0D\0A    float _pad1;\0D\0A    float _pad2;\0D\0A};\0D\0A\0D\0Astruct GenericMaterial\0D\0A{\0D\0A    float4 float4_0;\0D\0A    float4 float4_1;\0D\0A    float4 float4_2;\0D\0A    float4 float4_3;\0D\0A    \0D\0A    float float_0;\0D\0A    float float_1;\0D\0A    float float_2;\0D\0A    float float_3;\0D\0A};\0D\0A\0D\0A\0D\0Astruct PBRMaterial\0D\0A{\0D\0A    float4 baseColor;\0D\0A    float4 emissiveColor;\0D\0A    \0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float normalScale;\0D\0A};\0D\0A\0D\0Astruct PhongMaterial\0D\0A{\0D\0A    float4 diffuseColor;\0D\0A    float4 emissiveColor;\0D\0A    float4 specularColor;\0D\0A    float4 ambientColor;\0D\0A\0D\0A    float normalScale;\0D\0A    float opacity;\0D\0A    float shininess;\0D\0A    float refractiveIndex;\0D\0A};\0D\0A\0D\0APBRMaterial GetPBRMaterial(GenericMaterial material)\0D\0A{\0D\0A    PBRMaterial pbrMaterial;\0D\0A    \0D\0A    pbrMaterial.baseColor = material.float4_0;\0D\0A    pbrMaterial.emissiveColor = material.float4_1;\0D\0A    \0D\0A    pbrMaterial.normalScale = material.float_0;\0D\0A    pbrMaterial.metallic = material.float_1;\0D\0A    pbrMaterial.roughness = material.float_2;\0D\0A\0D\0A    return pbrMaterial;\0D\0A}\0D\0A\0D\0APhongMaterial GetPhongMaterial(GenericMaterial material)\0D\0A{\0D\0A    PhongMaterial phongMaterial;\0D\0A    \0D\0A    phongMaterial.diffuseColor = material.float4_0;\0D\0A    phongMaterial.emissiveColor = material.float4_1;\0D\0A    phongMaterial.specularColor = material.float4_2;\0D\0A    phongMaterial.ambientColor = material.float4_3;\0D\0A    \0D\0A    phongMaterial.normalScale = material.float_0;\0D\0A    phongMaterial.opacity = material.float_1;\0D\0A    phongMaterial.shininess = material.float_2;\0D\0A    phongMaterial.refractiveIndex = material.float_3;\0D\0A    \0D\0A    return phongMaterial;\0D\0A}\0D\0A\0D\0Astatic const float3 ambientLightStrength = float3(0.13f, 0.13f, 0.13f);\0D\0A\0D\0Astruct LightResult\0D\0A{\0D\0A    float3 diffuse;\0D\0A    float3 specular;\0D\0A    float3 ambient;\0D\0A};\0D\0A\0D\0Astruct SurfaceData\0D\0A{\0D\0A    float3 N;\0D\0A    float3 V;\0D\0A    float NdotV;\0D\0A    float3 c_diff;\0D\0A    float3 c_spec;\0D\0A};\0D\0A\0D\0Astatic const float PI = 3.14159265;\0D\0Astatic const float kDielectricSpecular = 0.04f;\0D\0Astatic const float EPSILON = 1e-6f;\0D\0A\0D\0A/* https://github.com/microsoft/DirectXTK12/blob/main/Src/Shaders/Utilities.fxh */\0D\0A// Christian Schuler, \22Normal Mapping without Precomputed Tangents\22, ShaderX 5, Chapter 2.6, pp. 131-140\0D\0A// See also follow-up blog post: http://www.thetenthplanet.de/archives/1180\0D\0Afloat3x3 CalculateTBN(float3 p, float3 n, float2 tex)\0D\0A{\0D\0A    float3 dp1 = ddx(p);\0D\0A    float3 dp2 = ddy(p);\0D\0A    float2 duv1 = ddx(tex);\0D\0A    float2 duv2 = ddy(tex);\0D\0A\0D\0A    float3x3 M = float3x3(dp1, dp2, cross(dp1, dp2));\0D\0A    float2x3 inverseM = float2x3(cross(M[1], M[2]), cross(M[2], M[0]));\0D\0A    float3 t = normalize(mul(float2(duv1.x, duv2.x), inverseM));\0D\0A    float3 b = normalize(mul(float2(duv1.y, duv2.y), inverseM));\0D\0A    return float3x3(t, b, n);\0D\0A}\0D\0A\0D\0A// Compute normal unit vector from two x and y components\0D\0A// This is used for material textures which have a format of B8G8R8A8_UNORM\0D\0Afloat3 ComputeTwoChannelNormal(float2 normal)\0D\0A{\0D\0A    // Change normal mapping from [0, 1] to [-1, 1]\0D\0A    float2 xy = 2.0f * normal - 1.0f;\0D\0A    \0D\0A    // Compute z from x and y\0D\0A    float z = sqrt(1.0f - dot(xy, xy));\0D\0A\0D\0A    return float3(xy.x, xy.y, z);\0D\0A}\0D\0A\0D\0A\0D\0A// Packing and unpacking of normals for GBuffer\0D\0A// From https://jcgt.org/published/0003/02/01/\0D\0A\0D\0A// Returns \C2\B11\0D\0Afloat2 signNotZero(float2 v)\0D\0A{\0D\0A    return float2((v.x >= 0.0) ? +1.0 : -1.0, (v.y >= 0.0) ? +1.0 : -1.0);\0D\0A}\0D\0A// Assume normalized input. Output is on [-1, 1] for each component.\0D\0Afloat2 PackNormal(float3 v)\0D\0A{\0D\0A// Project the sphere onto the octahedron, and then onto the xy plane\0D\0A    float2 p = v.xy * (1.0 / (abs(v.x) + abs(v.y) + abs(v.z)));\0D\0A// Reflect the folds of the lower hemisphere over the diagonals\0D\0A    return (v.z <= 0.0) ? ((1.0 - abs(p.yx)) * signNotZero(p)) : p;\0D\0A}\0D\0A\0D\0Afloat3 UnpackNormal(float2 e)\0D\0A{\0D\0A    float3 v = float3(e.xy, 1.0 - abs(e.x) - abs(e.y));\0D\0A    if (v.z < 0)\0D\0A        v.xy = (1.0 - abs(v.yx)) * signNotZero(v.xy);\0D\0A    return normalize(v);\0D\0A}\0D\0A\0D\0A\0D\0Afloat Spec(float3 lightVec, SurfaceData surfData, float shininess)\0D\0A{\0D\0A    float3 R = normalize(reflect(-lightVec, surfData.N));\0D\0A    float RdotV = max(0, dot(R, surfData.V));\0D\0A    \0D\0A    return pow(RdotV, shininess);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 ComputeDirectionalLight(Light light, SurfaceData surfData, float shininess, float IoR)\0D\0A{\0D\0A    float3 L = -light.direction;\0D\0A    \0D\0A    float3 NdotL = max(dot(surfData.N, L), 0.0f);\0D\0A    \0D\0A\0D\0A    float3 diffuse = light.color * NdotL;\0D\0A    float3 specular = light.color * Spec(L, surfData, shininess);\0D\0A\0D\0A   \0D\0A    diffuse = saturate(diffuse);\0D\0A    specular = saturate(specular);\0D\0A    \0D\0A    \0D\0A    float3 ambient = surfData.c_diff * ambientLightStrength;\0D\0A    ambient = saturate(ambient);\0D\0A        \0D\0A    return (diffuse * surfData.c_diff + specular * surfData.c_spec + ambient);\0D\0A}\0D\0A\0D\0Afloat3 FresnelShlick(float3 F0, float3 F90, float cosine)\0D\0A{\0D\0A    return F0 + (F90 - F0) * pow(1.f - cosine, 5.f);\0D\0A\0D\0A}\0D\0A\0D\0Afloat3 Diffuse_Burley(SurfaceData surfData, float roughness, float LdotH, float NdotL)\0D\0A{\0D\0A    float fd90 = 0.5f + 2.0f * roughness * LdotH * LdotH;\0D\0A    \0D\0A    return FresnelShlick(1, fd90, NdotL).x * FresnelShlick(1, fd90, surfData.NdotV).x;\0D\0A}\0D\0A\0D\0Afloat Specular_D_GGX(SurfaceData surfData, float NdotH, float alphaSqr)\0D\0A{\0D\0A\0D\0A    float lower = (NdotH * NdotH * (alphaSqr - 1)) + 1;\0D\0A    \0D\0A    return alphaSqr / max(EPSILON, PI * lower * lower);\0D\0A\0D\0A}\0D\0A\0D\0Afloat G_Shlick_Smith_Hable(SurfaceData surfData, float LdotH, float alphaSqr)\0D\0A{\0D\0A    return rcp(lerp(LdotH * LdotH, 1, alphaSqr * 0.25f));\0D\0A}\0D\0A\0D\0Afloat3 Specular_BRDF(SurfaceData surfData, float LdotH, float NdotH, float alpha)\0D\0A{\0D\0A    float alphaSqr = alpha * alpha;\0D\0A    \0D\0A    float ND = Specular_D_GGX(surfData, NdotH, alphaSqr);\0D\0A    \0D\0A    float GV = G_Shlick_Smith_Hable(surfData, LdotH, alphaSqr);\0D\0A    \0D\0A    float3 F = FresnelShlick(surfData.c_spec, 1.0, LdotH);\0D\0A    \0D\0A    return ND * F * GV;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 PBRDirectionalLight(Light Light, SurfaceData surfData, float roughness)\0D\0A{    \0D\0A    float3 L = normalize(-Light.direction);\0D\0A    \0D\0A    \0D\0A    float3 H = normalize(L + surfData.V);\0D\0A    \0D\0A    float NdotL = saturate(dot(surfData.N, L));\0D\0A    float LdotH = saturate(dot(L, H));\0D\0A    float NdotH = saturate(dot(surfData.N, H));\0D\0A    \0D\0A    float alpha = roughness * roughness;\0D\0A    \0D\0A    float3 diffuse = Diffuse_Burley(surfData, roughness, LdotH, NdotL);\0D\0A    float3 specular = Specular_BRDF(surfData, LdotH, NdotH, alpha);\0D\0A    \0D\0A    return NdotL * Light.color * ((surfData.c_diff * diffuse) + specular);\0D\0A}\0D\0A\0D\0A#endif"}
!392 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!393 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CTechniquesCompat.h", !"#ifndef TECHNIQUEHLSLCOMPAT_H\0D\0A#define TECHNIQUEHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#define XMFLOAT4X4 float4x4\0D\0A#define XMUINT2 uint2\0D\0A#define XMUINT3 uint3 /* I don't know why, but this won't work if i define it in the HlslCompat.h file */\0D\0A\0D\0A// AABB is already defined in MathHelper.h so we don't need to redefine it for the c++ side;\0D\0A// However we need to define it for the hlsl files.\0D\0Astruct AABB\0D\0A{\0D\0A\09float3 Min;\0D\0A\09float3 Max;\0D\0A};\0D\0A\0D\0A#else\0D\0A\0D\0A#include <directx/d3d12.h>\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A\0D\0A#endif // HLSL\0D\0A\0D\0Astruct ConstantBufferVoxelCommons\0D\0A{\0D\0A\09XMUINT3 voxelTextureDimensions;\0D\0A\09float totalTime;\0D\0A\0D\0A\09XMFLOAT3 voxelCellSize;\0D\0A\09float deltaTime;\0D\0A\0D\0A\09XMFLOAT3 invVoxelTextureDimensions;\0D\0A\09UINT StoreData;\0D\0A\0D\0A\09XMFLOAT3 invVoxelCellSize;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMin;\0D\0A\09UINT ClusterCount;\0D\0A\0D\0A\09XMFLOAT3 SceneAABBMax;\0D\0A\09float pad3;\0D\0A\0D\0A\09XMFLOAT4X4 VoxelToWorld;\0D\0A\09XMFLOAT4X4 WorldToVoxel;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferCompactBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT CurrentStep;\0D\0A\09UINT CompactBufferSize;\0D\0A\09UINT ElementsPerThread;\0D\0A\0D\0A\09UINT NumElementsSweepDown;\0D\0A\09UINT NumElementsBase;\0D\0A\09UINT NumElementsLevel0;\0D\0A\09UINT NumElementsLevel1;\0D\0A\0D\0A\09UINT NumElementsLevel2;\0D\0A\09UINT NumElementsLevel3;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\0D\0A\09XMUINT3 VoxelGridSize;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClusterizeBuffer\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT K;\0D\0A\09float m;\0D\0A\0D\0A\09XMUINT3 VoxelTextureDimensions;\0D\0A\09UINT S;\0D\0A\0D\0A\09XMUINT3 TileGridDimension;\0D\0A\09UINT FirstClusterSet;\0D\0A\0D\0A\09XMUINT3 CurrentTileUpdate;\0D\0A\09UINT UnassignedOnlyPass;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRTShadows\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT ClusterCount;\0D\0A\09UINT FrameCount;\0D\0A};\0D\0A\0D\0Astruct RTSceneVisibility\0D\0A{\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A\09float pad2;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT BlasCount;\0D\0A\09UINT GeometryCount;\0D\0A\09float Rand1;\0D\0A\09float Rand2;\0D\0A\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFaceCount\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT CurrentPhase;\0D\0A\0D\0A\09UINT VoxelCount;\0D\0A\09XMUINT3 pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferAABBGeneration\0D\0A{\0D\0A\09XMUINT3 GridDimension;\0D\0A\09UINT ClusterCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFacePenalty\0D\0A{\0D\0A\09UINT FaceCount;\0D\0A\09UINT VoxelCount;\0D\0A\09float pad0;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferFrustumCulling\0D\0A{\0D\0A\09XMFLOAT4 FrustumPlanes[6];\0D\0A\0D\0A\09XMFLOAT3 CameraPosition;\0D\0A\09UINT AABBGroupCount;\0D\0A\0D\0A\09UINT CurrentStep;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\09UINT ResetRadianceBuffers;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferIndirectLightTransport\0D\0A{\0D\0A\09XMFLOAT3 LightDirection;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 LightPosition;\0D\0A\09float LightIntensity;\0D\0A\0D\0A\09XMFLOAT3 LightColor;\0D\0A\09float CloseVoxelStrength;\0D\0A\0D\0A\09float FarVoxelStrength;\0D\0A\09XMFLOAT3 pad0;\0D\0A\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT DispatchNumber;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferClearBuffers\0D\0A{\0D\0A\09UINT ValueCount0;\0D\0A\09UINT ValueCount1;\0D\0A\09UINT ValueCount2;\0D\0A\09UINT ValueCount3;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLitVoxels\0D\0A{\0D\0A\0D\0A};\0D\0A\0D\0Astruct ClusterAABBInfo\0D\0A{\0D\0A\09XMFLOAT3 Min;\0D\0A\09UINT ClusterStartIndex;\0D\0A\09XMFLOAT3 Max;\0D\0A\09UINT ClusterElementCount;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferLerpRadiance\0D\0A{\0D\0A\09UINT CurrentPhase;\0D\0A\09float accumulatedTime;\0D\0A\09float maxTime;\0D\0A\09UINT FaceCount;\0D\0A};\0D\0A\0D\0Astruct ClusterData\0D\0A{\0D\0A\09XMUINT3 Center;\0D\0A\09UINT VoxelCount;\0D\0A\0D\0A\09XMFLOAT3 Normal;\0D\0A\09UINT FirstDataIndex;\0D\0A\0D\0A\09XMFLOAT3 Color;\0D\0A\09UINT FragmentCount;\0D\0A\0D\0A\09XMFLOAT3 MinAABB;\0D\0A\09UINT NeighbourCount;\0D\0A\0D\0A\09XMFLOAT3 MaxAABB;\0D\0A\09float pad0;\0D\0A\0D\0A\09UINT ClusterNeighbours[64];\0D\0A};\0D\0A\0D\0Astruct ConstantBufferComputeNeighbour\0D\0A{\0D\0A\09UINT ClusterCount;\0D\0A\09UINT ElementsPerThread;\0D\0A\09UINT TotalComputationCount;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferGaussianFilter\0D\0A{\0D\0A\09XMFLOAT3 EyePosition;\0D\0A\09UINT BlockNum;\0D\0A\0D\0A\09UINT CurrentPhase;\0D\0A\09UINT KernelSize;\0D\0A\09UINT VoxelCount;\0D\0A\09UINT FaceCount;\0D\0A\0D\0A\09float Sigma;\0D\0A\09UINT PassCount;\0D\0A\09UINT UsePreComputedGaussian;\0D\0A\09float pad1;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferRadianceFromNetwork\0D\0A{\0D\0A\09UINT ShouldReset;\0D\0A\09UINT FaceCount;\0D\0A\09UINT ReceivedFaceCount;\0D\0A\09UINT pad0;\0D\0A};\0D\0A\0D\0A#endif // TECHNIQUEHLSLCOMPAT_H"}
!394 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C..\5C..\5CVoxelUtils\5CShaders\5CVoxelUtils.hlsli", !"#ifndef VOXEL_UTILS\0D\0A#define VOXEL_UTILS\0D\0A\0D\0A#include \22..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli\22\0D\0A#define HLSL\0D\0A#include \22TechniquesCompat.h\22\0D\0A\0D\0A#define IRRADIANCE_FIELD_MULTIPLIER 100000.0f\0D\0A#define MAX_DISTANCE_VOXEL_OFFSET 2.5f\0D\0A#define MINIMUM_ANGLE_VOXEL_OFFSET 0.342f\0D\0A\0D\0A#define CLUSTER_TO_VOXEL_FORM_FACTOR_ADD 14860\0D\0A#define VOXEL_TO_VOXEL_FORM_FACTOR_ADD 3\0D\0A\0D\0Astatic const unsigned int UINT_MAX = 0xffffffff;\0D\0Astatic const float cos30 = 0.81915204428f;\0D\0Astatic const float cos25 = 0.9f;\0D\0A\0D\0Astruct VertexOutVoxel\0D\0A{\0D\0A    float4 PosH : SV_POSITION;\0D\0A    float3 PosW : POSITION0;\0D\0A    uint ProjAxis : AXIS;\0D\0A    float3 NormalW : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOutVoxelIndex\0D\0A{\0D\0A    float4 Pos : SV_Position;\0D\0A    uint VoxelIndex : VOXELINDEX;\0D\0A};\0D\0A\0D\0Astruct GeometryOutClusterIndex\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float3 normal : NORMAL;\0D\0A    float3 color : COLOR;\0D\0A    uint ClusterIndex : CLUSTERINDEX;\0D\0A};\0D\0A\0D\0Astruct VoxelCommons\0D\0A{\0D\0A    uint3 gridDimension;\0D\0A    float totalTime;\0D\0A    \0D\0A    float3 cellSize;\0D\0A    float deltaTime;\0D\0A    \0D\0A    float3 inverseGridDimension;\0D\0A    uint storeData;\0D\0A    \0D\0A    float3 inverseCellSize;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0A\0D\0Astruct VoxelCamera\0D\0A{\0D\0A    float4x4 xAxisView;\0D\0A    float4x4 yAxisView;\0D\0A    float4x4 zAxisView;\0D\0A    float4x4 orthoProj;\0D\0A    \0D\0A    float4x4 xAxisViewProj;\0D\0A    float4x4 yAxisViewProj;\0D\0A    float4x4 zAxisViewProj;\0D\0A    \0D\0A    float nearPlane;\0D\0A    float farPlane;\0D\0A    float pad0;\0D\0A    float pad1;\0D\0A};\0D\0A\0D\0Astruct FragmentData\0D\0A{\0D\0A    float3 position;\0D\0A    float pad0;\0D\0A\0D\0A    float4 color;\0D\0A\09\0D\0A    float3 normal;\0D\0A    uint voxelLinearCoord;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Auint3 GetVoxelPosition(uint voxelLinearCoord, uint3 gridDimension)\0D\0A{\0D\0A    uint3 voxelPosition;\0D\0A    voxelPosition.x = voxelLinearCoord % gridDimension.x;\0D\0A    voxelPosition.y = (voxelLinearCoord / gridDimension.x) % gridDimension.y;\0D\0A    voxelPosition.z = voxelLinearCoord / (gridDimension.x * gridDimension.y); \0D\0A    return voxelPosition;\0D\0A}\0D\0A\0D\0Auint GetLinearCoord(uint3 coord3, uint3 gridDimension)\0D\0A{\0D\0A    return  coord3.x +\0D\0A            coord3.y * gridDimension.x +\0D\0A            coord3.z * gridDimension.x * gridDimension.y;\0D\0A}\0D\0A\0D\0A// Returns true if the voxel coordinates are withing the bounds after adding the offset vector\0D\0Abool IsWithinBounds(uint3 coord, int3 offset, uint3 gridDimension)\0D\0A{\0D\0A    // Check for underflow\0D\0A    if (any(coord < uint3(-min(int3(0, 0, 0), offset))))\0D\0A    {\0D\0A        return false;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        uint3 result = coord + max(int3(0, 0, 0), offset);\0D\0A\0D\0A        return all(result < gridDimension);\0D\0A    }\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    // ByteAddressBuffer operations wants multiple of 4 bytes\0D\0A    uint value = voxelPresenceBuffer.Load(index * 4);\0D\0A    \0D\0A    return (value & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool IsVoxelPresent(uint3 voxelCoord, uint3 gridDimension, ByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return IsVoxelPresent(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedOr(index, (1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) != 0;\0D\0A}\0D\0A\0D\0Abool SetVoxelPresence(uint3 voxelCoord, uint3 gridDimension, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint voxelLinearCoord = GetLinearCoord(voxelCoord, gridDimension);\0D\0A    return SetVoxelPresence(voxelLinearCoord, voxelPresenceBuffer);\0D\0A}\0D\0A\0D\0A\0D\0Abool ClearVoxelPresence(uint voxelLinearCoord, RWByteAddressBuffer voxelPresenceBuffer)\0D\0A{\0D\0A    uint index = voxelLinearCoord >> 5u;\0D\0A    uint bit = voxelLinearCoord & 31u;\0D\0A    \0D\0A    index = index * 4;\0D\0A    \0D\0A    uint outVal = 0;\0D\0A    \0D\0A    voxelPresenceBuffer.InterlockedAnd(index, ~(1u << bit), outVal);\0D\0A    \0D\0A    return (outVal & (1u << bit)) == 0;\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 positionDA, float3 normalDB, float3 positionDB, float nSamples)\0D\0A{\0D\0A    float3 dAtoDiskDirection = positionDB - positionDA;\0D\0A    float distanceSq = dot(dAtoDiskDirection, dAtoDiskDirection);\0D\0A    dAtoDiskDirection = normalize(dAtoDiskDirection);\0D\0A    \0D\0A    float cosTheta1 = dot(normalDA, dAtoDiskDirection);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A    \0D\0A    float cosTheta2 = dot(normalDB, -dAtoDiskDirection);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    return (cosTheta1 * cosTheta2) / (PI * distanceSq + nSamples);\0D\0A}\0D\0A\0D\0Afloat differentialAreaFormFactor(float3 normalDA, float3 normalDB)\0D\0A{\0D\0A    float cosTheta1 = dot(normalDA, -normalDB);\0D\0A    cosTheta1 = clamp(cosTheta1, 0.0, 1.0);\0D\0A\0D\0A    float cosTheta2 = dot(normalDB, normalDB);\0D\0A    cosTheta2 = clamp(cosTheta2, 0.0, 1.0);\0D\0A\0D\0A    // Avoid using distanceSq for directional lights as it is theoretically infinite\0D\0A    return (cosTheta1 * cosTheta2) / (PI * 1.0f);\0D\0A}\0D\0A\0D\0Afloat distanceSq(float3 a, float3 b)\0D\0A{\0D\0A    return dot(a - b, a - b);\0D\0A}\0D\0A\0D\0A\0D\0A#endif // VOXEL_UTILS"}
!395 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CRaytracingUtils.hlsli", !"#ifndef RAYTRACINGUTILS_HLSLI\0D\0A#define RAYTRACINGUTILS_HLSLI\0D\0A\0D\0Abool RayAABBIntersectionTest(float3 rayOrigin, float3 rayDirection, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = rayDirection > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = rayDirection != 0 ? 1 / rayDirection : (rayDirection > 0 ? FLT_INFINITY : -FLT_INFINITY);\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - rayOrigin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - rayOrigin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - rayOrigin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGUTILS_HLSLI"}
!396 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5CRaytracing.hlsl"}
!397 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_5", !"/Fo", !"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CVoxelUtils\5CShaders\5C/../Data/Shaders/Raytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!398 = !{i32 1, i32 5}
!399 = !{i32 1, i32 6}
!400 = !{!"lib", i32 6, i32 5}
!401 = !{!402, !412, !419, null}
!402 = !{!403, !405, !406, !408, !409, !411}
!403 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !404}
!404 = !{i32 0, i32 4}
!405 = !{i32 1, %struct.ByteAddressBuffer* @"\01?gVoxelOccupiedBuffer@@3UByteAddressBuffer@@A", !"gVoxelOccupiedBuffer", i32 1, i32 0, i32 1, i32 11, i32 0, null}
!406 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelHashedCompactBuffer@@3V?$StructuredBuffer@I@@A", !"gVoxelHashedCompactBuffer", i32 2, i32 3, i32 1, i32 12, i32 0, !407}
!407 = !{i32 1, i32 4}
!408 = !{i32 3, %"class.StructuredBuffer<unsigned int>"* @"\01?gVoxelAssignmentBuffer@@3V?$StructuredBuffer@I@@A", !"gVoxelAssignmentBuffer", i32 3, i32 2, i32 1, i32 12, i32 0, !407}
!409 = !{i32 4, %"class.StructuredBuffer<AABB>"* @"\01?gVoxelAABBBuffer@@3V?$StructuredBuffer@UAABB@@@@A", !"gVoxelAABBBuffer", i32 4, i32 0, i32 1, i32 12, i32 0, !410}
!410 = !{i32 1, i32 24}
!411 = !{i32 5, %"class.StructuredBuffer<unsigned int>"* @"\01?gAABBVoxelIndices@@3V?$StructuredBuffer@I@@A", !"gAABBVoxelIndices", i32 4, i32 2, i32 1, i32 12, i32 0, !407}
!412 = !{!413, !415, !416, !417, !418}
!413 = !{i32 0, %"class.RWStructuredBuffer<vector<unsigned int, 2> >"* @"\01?gFaceClusterVisibility@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", !"gFaceClusterVisibility", i32 0, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !414}
!414 = !{i32 1, i32 8}
!415 = !{i32 1, %"class.RWStructuredBuffer<unsigned int>"* @"\01?gVisibleClustersBuffer@@3V?$RWStructuredBuffer@I@@A", !"gVisibleClustersBuffer", i32 0, i32 1, i32 1, i32 12, i1 false, i1 false, i1 false, !407}
!416 = !{i32 2, %"class.RWStructuredBuffer<unsigned int>"* @"\01?gGeometryStartOffset@@3V?$RWStructuredBuffer@I@@A", !"gGeometryStartOffset", i32 0, i32 2, i32 1, i32 12, i1 false, i1 false, i1 false, !407}
!417 = !{i32 3, %"class.RWStructuredBuffer<unsigned int>"* @"\01?gAABBStartOffset@@3V?$RWStructuredBuffer@I@@A", !"gAABBStartOffset", i32 0, i32 3, i32 1, i32 12, i1 false, i1 false, i1 false, !407}
!418 = !{i32 4, %"class.RWStructuredBuffer<unsigned int>"* @"\01?gClusterCount@@3V?$RWStructuredBuffer@I@@A", !"gClusterCount", i32 0, i32 4, i32 1, i32 12, i1 false, i1 false, i1 false, !407}
!419 = !{!420}
!420 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 48, null}
!421 = !{i32 0, %struct.PBRMaterial undef, !422, %struct.GenericMaterial undef, !428, %struct.PhongMaterial undef, !437, %struct.SurfaceData undef, !445, %struct.Light undef, !451, %struct.RTSceneVisibility undef, !465, %"class.StructuredBuffer<unsigned int>" undef, !476, %"class.StructuredBuffer<AABB>" undef, !481, %struct.AABB undef, !486, %"class.StructuredBuffer<ClusterAABBInfo>" undef, !489, %struct.ClusterAABBInfo undef, !493, %"class.RWStructuredBuffer<vector<unsigned int, 2> >" undef, !496, %"class.RWStructuredBuffer<unsigned int>" undef, !476, %struct.BuiltInTriangleIntersectionAttributes undef, !500, %struct.RayDesc undef, !502, %struct.RayPayload undef, !507, %struct.AABBAttributes undef, !509, %g_sceneCB undef, !511}
!422 = !{i32 44, !423, !424, !425, !426, !427}
!423 = !{i32 6, !"baseColor", i32 3, i32 0, i32 7, i32 9}
!424 = !{i32 6, !"emissiveColor", i32 3, i32 16, i32 7, i32 9}
!425 = !{i32 6, !"metallic", i32 3, i32 32, i32 7, i32 9}
!426 = !{i32 6, !"roughness", i32 3, i32 36, i32 7, i32 9}
!427 = !{i32 6, !"normalScale", i32 3, i32 40, i32 7, i32 9}
!428 = !{i32 80, !429, !430, !431, !432, !433, !434, !435, !436}
!429 = !{i32 6, !"float4_0", i32 3, i32 0, i32 7, i32 9}
!430 = !{i32 6, !"float4_1", i32 3, i32 16, i32 7, i32 9}
!431 = !{i32 6, !"float4_2", i32 3, i32 32, i32 7, i32 9}
!432 = !{i32 6, !"float4_3", i32 3, i32 48, i32 7, i32 9}
!433 = !{i32 6, !"float_0", i32 3, i32 64, i32 7, i32 9}
!434 = !{i32 6, !"float_1", i32 3, i32 68, i32 7, i32 9}
!435 = !{i32 6, !"float_2", i32 3, i32 72, i32 7, i32 9}
!436 = !{i32 6, !"float_3", i32 3, i32 76, i32 7, i32 9}
!437 = !{i32 80, !438, !424, !439, !440, !441, !442, !443, !444}
!438 = !{i32 6, !"diffuseColor", i32 3, i32 0, i32 7, i32 9}
!439 = !{i32 6, !"specularColor", i32 3, i32 32, i32 7, i32 9}
!440 = !{i32 6, !"ambientColor", i32 3, i32 48, i32 7, i32 9}
!441 = !{i32 6, !"normalScale", i32 3, i32 64, i32 7, i32 9}
!442 = !{i32 6, !"opacity", i32 3, i32 68, i32 7, i32 9}
!443 = !{i32 6, !"shininess", i32 3, i32 72, i32 7, i32 9}
!444 = !{i32 6, !"refractiveIndex", i32 3, i32 76, i32 7, i32 9}
!445 = !{i32 60, !446, !447, !448, !449, !450}
!446 = !{i32 6, !"N", i32 3, i32 0, i32 7, i32 9}
!447 = !{i32 6, !"V", i32 3, i32 16, i32 7, i32 9}
!448 = !{i32 6, !"NdotV", i32 3, i32 28, i32 7, i32 9}
!449 = !{i32 6, !"c_diff", i32 3, i32 32, i32 7, i32 9}
!450 = !{i32 6, !"c_spec", i32 3, i32 48, i32 7, i32 9}
!451 = !{i32 192, !452, !453, !454, !455, !456, !457, !458, !460, !461, !462, !463, !464}
!452 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!453 = !{i32 6, !"fallOffStart", i32 3, i32 12, i32 7, i32 9}
!454 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!455 = !{i32 6, !"fallOffEnd", i32 3, i32 28, i32 7, i32 9}
!456 = !{i32 6, !"position", i32 3, i32 32, i32 7, i32 9}
!457 = !{i32 6, !"spotPower", i32 3, i32 44, i32 7, i32 9}
!458 = !{i32 6, !"shadowMatrix", i32 2, !459, i32 3, i32 48, i32 7, i32 9}
!459 = !{i32 4, i32 4, i32 2}
!460 = !{i32 6, !"invShadowMatrix", i32 2, !459, i32 3, i32 112, i32 7, i32 9}
!461 = !{i32 6, !"castShadows", i32 3, i32 176, i32 7, i32 4}
!462 = !{i32 6, !"_pad0", i32 3, i32 180, i32 7, i32 9}
!463 = !{i32 6, !"_pad1", i32 3, i32 184, i32 7, i32 9}
!464 = !{i32 6, !"_pad2", i32 3, i32 188, i32 7, i32 9}
!465 = !{i32 48, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!466 = !{i32 6, !"pad0", i32 3, i32 0, i32 7, i32 9}
!467 = !{i32 6, !"pad1", i32 3, i32 4, i32 7, i32 9}
!468 = !{i32 6, !"pad2", i32 3, i32 8, i32 7, i32 9}
!469 = !{i32 6, !"FaceCount", i32 3, i32 12, i32 7, i32 5}
!470 = !{i32 6, !"GridDimension", i32 3, i32 16, i32 7, i32 5}
!471 = !{i32 6, !"CurrentPhase", i32 3, i32 28, i32 7, i32 5}
!472 = !{i32 6, !"BlasCount", i32 3, i32 32, i32 7, i32 5}
!473 = !{i32 6, !"GeometryCount", i32 3, i32 36, i32 7, i32 5}
!474 = !{i32 6, !"Rand1", i32 3, i32 40, i32 7, i32 9}
!475 = !{i32 6, !"Rand2", i32 3, i32 44, i32 7, i32 9}
!476 = !{i32 4, !477, !478}
!477 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!478 = !{i32 0, !479}
!479 = !{!480}
!480 = !{i32 0, i32 undef}
!481 = !{i32 28, !482, !483}
!482 = !{i32 6, !"h", i32 3, i32 0}
!483 = !{i32 0, !484}
!484 = !{!485}
!485 = !{i32 0, %struct.AABB undef}
!486 = !{i32 28, !487, !488}
!487 = !{i32 6, !"Min", i32 3, i32 0, i32 7, i32 9}
!488 = !{i32 6, !"Max", i32 3, i32 16, i32 7, i32 9}
!489 = !{i32 32, !482, !490}
!490 = !{i32 0, !491}
!491 = !{!492}
!492 = !{i32 0, %struct.ClusterAABBInfo undef}
!493 = !{i32 32, !487, !494, !488, !495}
!494 = !{i32 6, !"ClusterStartIndex", i32 3, i32 12, i32 7, i32 5}
!495 = !{i32 6, !"ClusterElementCount", i32 3, i32 28, i32 7, i32 5}
!496 = !{i32 8, !477, !497}
!497 = !{i32 0, !498}
!498 = !{!499}
!499 = !{i32 0, <2 x i32> undef}
!500 = !{i32 8, !501}
!501 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!502 = !{i32 32, !503, !504, !505, !506}
!503 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!504 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!505 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!506 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!507 = !{i32 4, !508}
!508 = !{i32 6, !"primitiveIndex", i32 3, i32 0, i32 7, i32 5}
!509 = !{i32 4, !510}
!510 = !{i32 6, !"aabbIndex", i32 3, i32 0, i32 7, i32 5}
!511 = !{i32 48, !512}
!512 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!513 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !514, void (%struct.RayPayload*, %struct.AABBAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UAABBAttributes@@@Z", !516, void ()* @"\01?MyIntersectionShader@@YAXXZ", !514, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !519}
!514 = !{!515}
!515 = !{i32 1, !2, !2}
!516 = !{!515, !517, !518}
!517 = !{i32 2, !2, !2}
!518 = !{i32 0, !2, !2}
!519 = !{!515, !517}
!520 = !{null, !"", null, !401, !521}
!521 = !{i32 0, i64 33619985}
!522 = !{void (%struct.RayPayload*, %struct.AABBAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UAABBAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UAABBAttributes@@@Z", null, null, !523}
!523 = !{i32 8, i32 10, i32 6, i32 4, i32 7, i32 4, i32 5, !524}
!524 = !{i32 0}
!525 = !{void ()* @"\01?MyIntersectionShader@@YAXXZ", !"\01?MyIntersectionShader@@YAXXZ", null, null, !526}
!526 = !{i32 8, i32 8, i32 5, !524}
!527 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !528}
!528 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !524}
!529 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !530}
!530 = !{i32 8, i32 7, i32 5, !524}
!531 = !DILocation(line: 231, column: 33, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !1, line: 218, column: 9)
!533 = distinct !DILexicalBlock(scope: !534, file: !1, line: 217, column: 9)
!534 = distinct !DILexicalBlock(scope: !535, file: !1, line: 217, column: 9)
!535 = distinct !DILexicalBlock(scope: !536, file: !1, line: 203, column: 5)
!536 = distinct !DILexicalBlock(scope: !279, file: !1, line: 202, column: 9)
!537 = !DILocation(line: 191, column: 49, scope: !279)
!538 = !DILocation(line: 126, column: 18, scope: !222, inlinedAt: !539)
!539 = distinct !DILocation(line: 145, column: 12, scope: !230, inlinedAt: !540)
!540 = distinct !DILocation(line: 198, column: 23, scope: !279)
!541 = !DILocation(line: 226, column: 13, scope: !532)
!542 = !DILocation(line: 253, column: 24, scope: !543)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 251, column: 5)
!544 = distinct !DILexicalBlock(scope: !279, file: !1, line: 250, column: 9)
!545 = !DILocation(line: 243, column: 17, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 241, column: 13)
!547 = distinct !DILexicalBlock(scope: !532, file: !1, line: 240, column: 17)
!548 = !DILocation(line: 242, column: 47, scope: !546)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "faceDirection", scope: !279, file: !1, line: 170, type: !550)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 576, align: 32, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 6)
!553 = !DIExpression(DW_OP_bit_piece, 0, 32)
!554 = !DILocation(line: 170, column: 12, scope: !279)
!555 = !{i32 0, i32 96, i32 6}
!556 = !DIExpression(DW_OP_bit_piece, 32, 32)
!557 = !{i32 32, i32 96, i32 6}
!558 = !DIExpression(DW_OP_bit_piece, 64, 32)
!559 = !{i32 64, i32 96, i32 6}
!560 = !DILocation(line: 171, column: 5, scope: !279)
!561 = !DILocation(line: 180, column: 24, scope: !279)
!562 = !DILocation(line: 180, column: 11, scope: !279)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchId", scope: !279, file: !1, line: 180, type: !50)
!564 = !DILocation(line: 181, column: 25, scope: !279)
!565 = !DILocation(line: 181, column: 11, scope: !279)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dispatchDim", scope: !279, file: !1, line: 181, type: !50)
!567 = !DILocation(line: 183, column: 52, scope: !279)
!568 = !DILocation(line: 183, column: 37, scope: !279)
!569 = !DILocation(line: 183, column: 83, scope: !279)
!570 = !DILocation(line: 183, column: 99, scope: !279)
!571 = !DILocation(line: 183, column: 68, scope: !279)
!572 = !DILocation(line: 183, column: 10, scope: !279)
