#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e4e5fdbad39697c215544f6609381459.pdb
; shader hash: e4e5fdbad39697c215544f6609381459
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cbRadianceNetwork
; {
;
;   struct cbRadianceNetwork
;   {
;
;       struct struct.ConstantBufferRadianceFromNetwork
;       {
;
;           uint ShouldReset;                         ; Offset:    0
;           uint FaceCount;                           ; Offset:    4
;           uint ReceivedFaceCount;                   ; Offset:    8
;           uint pad0;                                ; Offset:   12
;       
;       } cbRadianceNetwork;                          ; Offset:    0
;
;   
;   } cbRadianceNetwork;                              ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for gFaceIndexBuffer
; {
;
;   uint $Element;                                    ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for gRadianceForFaceBuffer
; {
;
;   uint2 $Element;                                   ; Offset:    0 Size:     8
;
; }
;
; Resource bind info for gFinalRadianceBuffer
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !26)
!1 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders\5CRadianceFromNetwork_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !20}
!7 = !DISubprogram(name: "CS", scope: !1, file: !1, line: 20, type: !8, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CS)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !12, templateParams: !16)
!12 = !{!13, !14, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !5)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 3)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DISubprogram(name: "SetVoxelPresence", linkageName: "\01?SetVoxelPresence@@YA_NIURWByteAddressBuffer@@@Z", scope: !21, file: !21, line: 148, type: !22, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!21 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders/../../VoxelUtils/Shaders/VoxelUtils.hlsli", directory: "")
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !4, !25}
!24 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 13, size: 32, align: 32, elements: !2)
!26 = !{!27, !39, !41, !42, !43, !46, !48, !50, !51, !52, !98, !108, !111, !121, !122, !123, !125, !127, !129}
!27 = !DIGlobalVariable(name: "ambientLightStrength", scope: !0, file: !28, line: 90, type: !29, isLocal: true, isDefinition: true)
!28 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders/LightingUtil.hlsli", directory: "")
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 90, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 90, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 90, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!38, !18}
!38 = !DITemplateTypeParameter(name: "element", type: !34)
!39 = !DIGlobalVariable(name: "PI", scope: !0, file: !28, line: 108, type: !40, isLocal: true, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!41 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !28, line: 109, type: !40, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !28, line: 110, type: !40, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariable(name: "gSampler", linkageName: "\01?gSampler@@3USamplerState@@A", scope: !0, file: !44, line: 48, type: !45, isLocal: false, isDefinition: true)
!44 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders/../../VoxelUtils/Shaders/..\5C..\5CDirectXLib\5CDX12Lib\5CDXWrapper\5CShaders\5CCommon.hlsli", directory: "")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!46 = !DIGlobalVariable(name: "gShadowSampler", linkageName: "\01?gShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !44, line: 49, type: !47, isLocal: false, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!48 = !DIGlobalVariable(name: "UINT_MAX", scope: !0, file: !21, line: 15, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!50 = !DIGlobalVariable(name: "cos30", scope: !0, file: !21, line: 16, type: !40, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariable(name: "cos25", scope: !0, file: !21, line: 17, type: !40, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariable(name: "cbVoxelCommons", linkageName: "\01?cbVoxelCommons@@3U?$ConstantBuffer@UConstantBufferVoxelCommons@@@@A", scope: !0, file: !1, line: 3, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferVoxelCommons>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !54)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "T", type: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferVoxelCommons", file: !57, line: 26, size: 1792, align: 32, elements: !58)
!57 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders/../../VoxelUtils/Shaders/TechniquesCompat.h", directory: "")
!58 = !{!59, !60, !61, !64, !65, !66, !68, !69, !70, !71, !72, !73, !74, !97}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "voxelTextureDimensions", scope: !56, file: !57, line: 28, baseType: !10, size: 96, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !56, file: !57, line: 29, baseType: !34, size: 32, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "voxelCellSize", scope: !56, file: !57, line: 31, baseType: !62, size: 96, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !63, line: 4, baseType: !30)
!63 = !DIFile(filename: "C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders/../../VoxelUtils/Shaders/HlslCompat.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "deltaTime", scope: !56, file: !57, line: 32, baseType: !34, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelTextureDimensions", scope: !56, file: !57, line: 34, baseType: !62, size: 96, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "StoreData", scope: !56, file: !57, line: 35, baseType: !67, size: 32, align: 32, offset: 352)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !63, line: 8, baseType: !4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "invVoxelCellSize", scope: !56, file: !57, line: 37, baseType: !62, size: 96, align: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelCount", scope: !56, file: !57, line: 38, baseType: !67, size: 32, align: 32, offset: 480)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMin", scope: !56, file: !57, line: 40, baseType: !62, size: 96, align: 32, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !56, file: !57, line: 41, baseType: !67, size: 32, align: 32, offset: 608)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "SceneAABBMax", scope: !56, file: !57, line: 43, baseType: !62, size: 96, align: 32, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !56, file: !57, line: 44, baseType: !34, size: 32, align: 32, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "VoxelToWorld", scope: !56, file: !57, line: 46, baseType: !75, size: 512, align: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !77, templateParams: !94)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !76, file: !1, line: 3, baseType: !34, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!94 = !{!38, !95, !96}
!95 = !DITemplateValueParameter(name: "row_count", type: !19, value: i32 4)
!96 = !DITemplateValueParameter(name: "col_count", type: !19, value: i32 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "WorldToVoxel", scope: !56, file: !57, line: 47, baseType: !75, size: 512, align: 32, offset: 1280)
!98 = !DIGlobalVariable(name: "cbRadianceNetwork", linkageName: "\01?cbRadianceNetwork@@3U?$ConstantBuffer@UConstantBufferRadianceFromNetwork@@@@A", scope: !0, file: !1, line: 5, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferRadianceFromNetwork>", file: !1, line: 5, size: 32, align: 32, elements: !2, templateParams: !100)
!100 = !{!101}
!101 = !DITemplateTypeParameter(name: "T", type: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferRadianceFromNetwork", file: !57, line: 232, size: 128, align: 32, elements: !103)
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ShouldReset", scope: !102, file: !57, line: 234, baseType: !67, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "FaceCount", scope: !102, file: !57, line: 235, baseType: !67, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedFaceCount", scope: !102, file: !57, line: 236, baseType: !67, size: 32, align: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !102, file: !57, line: 237, baseType: !67, size: 32, align: 32, offset: 96)
!108 = !DIGlobalVariable(name: "gFaceIndexBuffer", linkageName: "\01?gFaceIndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 7, type: !109, isLocal: false, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !110)
!110 = !{!17}
!111 = !DIGlobalVariable(name: "gRadianceForFaceBuffer", linkageName: "\01?gRadianceForFaceBuffer@@3V?$StructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 8, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 8, size: 64, align: 32, elements: !2, templateParams: !113)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "element", type: !115)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 8, size: 64, align: 32, elements: !116, templateParams: !119)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !115, file: !1, line: 8, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !115, file: !1, line: 8, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!119 = !{!17, !120}
!120 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 2)
!121 = !DIGlobalVariable(name: "gIndirectLightUpdatedVoxelsBitmap", linkageName: "\01?gIndirectLightUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 13, type: !25, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "gGaussianUpdatedVoxelsBitmap", linkageName: "\01?gGaussianUpdatedVoxelsBitmap@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 14, type: !25, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "gFinalRadianceBuffer", linkageName: "\01?gFinalRadianceBuffer@@3V?$RWStructuredBuffer@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 17, type: !124, isLocal: false, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<unsigned int, 2> >", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !113)
!125 = !DIGlobalVariable(name: "ambientLightStrength.0", linkageName: "ambientLightStrength.0", scope: !0, file: !28, line: 90, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !29, size: 32, align: 4)
!127 = !DIGlobalVariable(name: "ambientLightStrength.2", linkageName: "ambientLightStrength.2", scope: !0, file: !28, line: 90, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !29, size: 32, align: 4, offset: 64)
!129 = !DIGlobalVariable(name: "ambientLightStrength.1", linkageName: "ambientLightStrength.1", scope: !0, file: !28, line: 90, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !29, size: 32, align: 4, offset: 32)
!131 = !{i32 2, !"Dwarf Version", i32 4}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!134 = !{!"C:\5CUsers\5Ciacco\5CDesktop\5CDistributedRendering\5CLocalIllumination\5CShaders\5CRadianceFromNetwork_CS.hlsl", !"#include \22../../VoxelUtils/Shaders/VoxelUtils.hlsli\22\0D\0A\0D\0AConstantBuffer<ConstantBufferVoxelCommons> cbVoxelCommons : register(b0);\0D\0A\0D\0AConstantBuffer<ConstantBufferRadianceFromNetwork> cbRadianceNetwork : register(b1);\0D\0A\0D\0AStructuredBuffer<uint> gFaceIndexBuffer : register(t0, space0);\0D\0AStructuredBuffer<uint2> gRadianceForFaceBuffer : register(t1, space0);\0D\0A\0D\0A// UAV 0 not needed\0D\0A// UAV 1 not needed\0D\0A// UAV 2 not needed\0D\0ARWByteAddressBuffer gIndirectLightUpdatedVoxelsBitmap : register(u3);\0D\0ARWByteAddressBuffer gGaussianUpdatedVoxelsBitmap : register(u4);\0D\0A\0D\0A\0D\0ARWStructuredBuffer<uint2> gFinalRadianceBuffer : register(u0, space1);\0D\0A\0D\0A[numthreads(128, 1, 1)]\0D\0Avoid CS( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A \0D\0A    if (DTid.x >= cbRadianceNetwork.ReceivedFaceCount)\0D\0A        return;\0D\0A \0D\0A    uint faceIdx = gFaceIndexBuffer[DTid.x];\0D\0A    uint voxIdx = (uint) floor(faceIdx / 6.0f);\0D\0A    \0D\0A    gFinalRadianceBuffer[faceIdx] = gRadianceForFaceBuffer[DTid.x];\0D\0A    SetVoxelPresence(voxIdx, gIndirectLightUpdatedVoxelsBitmap);\0D\0A\0D\0A}"}
